{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who has been transported back to the edge of the maze. He is described as having his face screwed up against the noise and being turned over by a pair of hands."
    },
    {
      "name": "albus dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is crouched over Harry, looking at him with concern. He is part of the crowd that has gathered around them."
    },
    {
      "name": "cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric is someone who Harry clutches tightly to him, indicating a close relationship or connection between them."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is mentioned by Harry as having returned. He is not physically present in the scene but is referenced as a significant event."
    },
    {
      "name": "cornelius fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge appears upside down over Harry, looking white and appalled. His face suggests that he is shocked by what has happened."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "albus dumbledore",
      "relationship_type": "interaction",
      "description": "Harry interacts with Dumbledore, who is crouched over him and looking at him with concern."
    },
    {
      "entity_1": "harry",
      "entity_2": "cedric",
      "relationship_type": "connection",
      "description": "Harry clutches Cedric tightly to him, indicating a close relationship or connection between them."
    },
    {
      "entity_1": "harry",
      "entity_2": "voldemort",
      "relationship_type": "mention",
      "description": "Harry mentions Voldemort as having returned, but they are not physically present in the scene."
    },
    {
      "entity_1": "harry",
      "entity_2": "cornelius fudge",
      "relationship_type": "interaction",
      "description": "Fudge appears upside down over Harry, looking white and appalled."
    }
  ]
}