{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as being in a rage and hitting Draco Malfoy around the face. She is also shown to be leading her friends back up the road to Hagrid's cabin, shouting at him to come out."
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Draco Malfoy is mentioned as being hit by Hermione in a rage. He is not described further in this passage."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is described as hiding and being upset by the actions of Rita Skeeter. Hermione is trying to get him out of his cabin, saying that nobody cares about his mother being a giantess."
    },
    {
      "name": "rita skeeter",
      "entity_type": "person",
      "singular": true,
      "description": "Rita Skeeter is mentioned as the one who has upset Hagrid. She is described as a 'foul' woman, implying that she is doing something wrong."
    },
    {
      "name": "fang",
      "entity_type": "animal",
      "singular": true,
      "description": "Fang is mentioned as barking at the approach of Hermione and her friends to Hagrid's cabin."
    },
    {
      "name": "albus dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Albus Dumbledore is described as opening the door to Hagrid's cabin, smiling down at Hermione and her friends."
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "draco malfoy",
      "relationship_type": "hit",
      "description": "Hermione hits Draco Malfoy around the face in a rage. This is described as Hermione being in a state of anger and frustration."
    },
    {
      "entity_1": "hermione",
      "entity_2": "hagrid",
      "relationship_type": "shouting_at",
      "description": "Hermione shouts at Hagrid to come out of his cabin, saying that nobody cares about his mother being a giantess. This is described as Hermione trying to get Hagrid out of his hiding place."
    },
    {
      "entity_1": "hermione",
      "entity_2": "rita skeeter",
      "relationship_type": "accusing",
      "description": "Hermione accuses Rita Skeeter of upsetting Hagrid. This is described as Hermione trying to defend Hagrid against the actions of Rita Skeeter."
    },
    {
      "entity_1": "hermione",
      "entity_2": "albus dumbledore",
      "relationship_type": "surprised_by",
      "description": "Hermione is surprised by Albus Dumbledore opening the door to Hagrid's cabin. This is described as Hermione stopping in her tracks and being face-to-face with Dumbledore."
    }
  ]
}