{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's name was drawn from the Goblet of Fire, indicating he is a participant in the tournament. (\"Harry's name just came out of the Goblet of Fire!\")"
    },
    {
      "name": "cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric looked nonplussed and bewildered when Harry's name was drawn from the Goblet of Fire. (\"Cedric looked from Bagman to Harry and back again as though sure he must have misheard what Bagman had said.\")"
    },
    {
      "name": "bagman",
      "entity_type": "person",
      "singular": true,
      "description": "Bagman was present when Harry's name was drawn from the Goblet of Fire. (\"He looked from Bagman to Harry and back again as though sure he must have misheard what Bagman had said.\")"
    },
    {
      "name": "fleur delacour",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur Delacour was present when Harry's name was drawn from the Goblet of Fire and seemed to think it was a joke. (\"Fleur Delacour, however, tossed her hair, smiling, and said, “Oh, vair y funny joke, Meester Bagman.”\")"
    },
    {
      "name": "krum",
      "entity_type": "person",
      "singular": true,
      "description": "Krum's thick eyebrows contracted slightly when Harry's name was drawn from the Goblet of Fire. (\"Krum’s thick eyebrows contracted slightly.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "bagman",
      "entity_2": "harry",
      "relationship_type": "said_to",
      "description": "Bagman said that Harry's name came out of the Goblet of Fire. (\"Harry’s name just came out of the Goblet of Fire!\")"
    },
    {
      "entity_1": "bagman",
      "entity_2": "harry",
      "relationship_type": "said_to",
      "description": "Bagman said that Harry's age restriction was a mistake. (\"But, as  you know, the age restriction\")"
    },
    {
      "entity_1": "fleur delacour",
      "entity_2": "bagman",
      "relationship_type": "spoke_to",
      "description": "Fleur Delacour spoke to Bagman and called his statement a joke. (\"Oh, vair y funny joke, Meester Bagman.\")"
    },
    {
      "entity_1": "fleur delacour",
      "entity_2": "bagman",
      "relationship_type": "spoke_to",
      "description": "Fleur Delacour spoke to Bagman and said that Harry cannot compete due to his age. (\" ’E cannot compete. ’E is too young.\")"
    },
    {
      "entity_1": "krum",
      "entity_2": "harry",
      "relationship_type": "looked_at",
      "description": "Krum looked at Harry when his name was drawn from the Goblet of Fire. (\"Krum’s thick eyebrows contracted slightly.\")"
    }
  ]
}