{
  "entities": [
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is mentioned as one of the students who puts her hand over her mouth in horror when Professor Trelawney says she saw Death during her crystal gazing. (\"Parvati and Lavender both put their hands over their mouths, looking horrified.\")"
    },
    {
      "name": "lavender",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender is mentioned as one of the students who puts her hand over her mouth in horror when Professor Trelawney says she saw Death during her crystal gazing. (\"Parvati and Lavender both put their hands over their mouths, looking horrified.\")"
    },
    {
      "name": "professor trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Trelawney is mentioned as the one who claims to have seen Death during her crystal gazing. (\"Yes,\" said Professor Trelawney, nodding impressively, \"it comes, ever closer, it circles overhead like a vulture, ever lower . . . ever lower over the castle.\")"
    },
    {
      "name": "death",
      "entity_type": "concept",
      "singular": true,
      "description": "Death is mentioned as something that Professor Trelawney claims to have seen during her crystal gazing. (\"Death, my dears.\" \"Yes,\" said Professor Trelawney, nodding impressively, \"it comes, ever closer, it circles overhead like a vulture, ever lower . . . ever lower over the castle.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as one of the students who is stared at by Professor Trelawney. (\"As I sat here, absorbed in my needlework, th e urge to consult the orb overpowered me. I arose, I settled myself before it, and I gazed into its crystalline depths . . . and what do  you think I saw gazing back at me?\" \"Death, my dears.\" Professor Trelawney stared pointedly at Harry, who yawned very widely and obviously.)"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as one of the students who makes a comment about what he thinks Professor Trelawney saw during her crystal gazing. (\"An ugly old bat in outsize specs?\" Ron muttered under his breath.)"
    }
  ],
  "relationships": [
    {
      "entity_1": "professor trelawney",
      "entity_2": "death",
      "relationship_type": "sees",
      "description": "Professor Trelawney claims to have seen Death during her crystal gazing. (\"Yes,\" said Professor Trelawney, nodding impressively, \"it comes, ever closer, it circles overhead like a vulture, ever lower . . . ever lower over the castle.\")"
    },
    {
      "entity_1": "professor trelawney",
      "entity_2": "harry",
      "relationship_type": "stares_at",
      "description": "Professor Trelawney stares at Harry. (\"She stared pointedly at Harry, who yawned very widely and obviously.\")"
    },
    {
      "entity_1": "professor trelawney",
      "entity_2": "parvati",
      "relationship_type": "stares_at",
      "description": "Professor Trelawney stares at Parvati. (This is implied by the fact that Professor Trelawney points out what she saw to Parvati and Lavender.)"
    },
    {
      "entity_1": "professor trelawney",
      "entity_2": "lavender",
      "relationship_type": "stares_at",
      "description": "Professor Trelawney stares at Lavender. (This is implied by the fact that Professor Trelawney points out what she saw to Parvati and Lavender.)"
    },
    {
      "entity_1": "ron",
      "entity_2": "professor trelawney",
      "relationship_type": "comments_on",
      "description": "Ron makes a comment about what he thinks Professor Trelawney saw during her crystal gazing. (\"An ugly old bat in outsize specs?\" Ron muttered under his breath.)"
    },
    {
      "entity_1": "harry",
      "entity_2": "professor trelawney",
      "relationship_type": "is_stared_at_by",
      "description": "Professor Trelawney stares at Harry. (\"She stared pointedly at Harry, who yawned very widely and obviously.\")"
    }
  ]
}