{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a gamekeeper at Hogwarts who has skrewts in his care. He is mentioned as someone Harry and Ron are hesitant to visit."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is one of Harry's best friends. He is mentioned as being exasperated with Hermione's sudden realization."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is the main protagonist of the story. He is mentioned as suggesting they visit Hagrid."
    },
    {
      "name": "hermione granger",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione Granger is one of Harry's best friends. She is mentioned as suddenly realizing she hasn't asked Hagrid to join S.P.E.W."
    },
    {
      "name": "s.p.e.w.",
      "entity_type": "organization",
      "singular": false,
      "description": "S.P.E.W. (Society for the Promotion of Elfish Welfare) is an organization that Hermione is a part of. She mentions asking Hagrid to join it."
    },
    {
      "name": "skrewts",
      "entity_type": "animal",
      "singular": false,
      "description": "Skrewts are creatures that Hagrid has in his care. Ron is hesitant to visit him because he might ask them to donate fingers to the skrewts."
    },
    {
      "name": "goblet of fire",
      "entity_type": "object",
      "singular": true,
      "description": "The Goblet of Fire is a magical object that is being guarded by students in the Great Hall. It is mentioned as being watched eagerly by the students."
    },
    {
      "name": "madame maxime",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Maxime is a Beauxbatons teacher who enters the hall behind her students. She is mentioned as entering with her students."
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione granger",
      "entity_2": "hagrid",
      "relationship_type": "asked_to_join_organization",
      "description": "Hermione realizes she hasn't asked Hagrid to join S.P.E.W. and decides to go ask him."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "skrewts",
      "relationship_type": "afraid_of",
      "description": "Ron is hesitant to visit Hagrid because he might ask them to donate fingers to the skrewts."
    }
  ]
}