{
  "entities": [
    {
      "name": "yule ball",
      "entity_type": "event",
      "singular": true,
      "description": "The Yule Ball is a Christmas event where students from Hogwarts attend a feast and dance."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is a student at Hogwarts who attends the Yule Ball with Hermione. He is incredulous when she says she needs three hours to get ready."
    },
    {
      "name": "hermione granger",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione Granger is a student at Hogwarts who attends the Yule Ball with Ron. She waves goodbye to him and disappears into the castle."
    },
    {
      "name": "george weasley",
      "entity_type": "person",
      "singular": true,
      "description": "George Weasley throws a snowball that hits Ron on the side of the head, distracting him from his conversation with Hermione."
    },
    {
      "name": "fat lady",
      "entity_type": "person",
      "singular": true,
      "description": "The Fat Lady is a portrait who guards the entrance to the common room. She is extremely tipsy and lets Ron and Harry inside after they give her the password."
    },
    {
      "name": "violet",
      "entity_type": "person",
      "singular": true,
      "description": "Violet is the Fat Lady's friend who is also extremely tipsy and drinking chocolate liqueurs with her."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron weasley",
      "entity_2": "hermione granger",
      "relationship_type": "attends_with",
      "description": "Ron Weasley attends the Yule Ball with Hermione Granger, as mentioned in the text: '“Who’re you going with?” he yelled after Hermione...’"
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "george weasley",
      "relationship_type": "brother_of",
      "description": "Ron Weasley is a brother of George Weasley, as mentioned in the text: 'George, hit him hard on the side of the head.'"
    },
    {
      "entity_1": "hermione granger",
      "entity_2": "ron weasley",
      "relationship_type": "attends_with",
      "description": "Hermione Granger attends the Yule Ball with Ron Weasley, as mentioned in the text: '“Who’re you going with?” he yelled after Hermione...’"
    },
    {
      "entity_1": "fat lady",
      "entity_2": "violet",
      "relationship_type": "friend_of",
      "description": "The Fat Lady is friends with Violet, as mentioned in the text: 'The Fat Lady was sitting  in her frame with her friend Violet from downstairs...'"
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "fat lady",
      "relationship_type": "interacts_with",
      "description": "Ron Weasley interacts with the Fat Lady when he and Harry give her the password to let them inside."
    }
  ]
}