{
  "entities": [
    {
      "name": "the dark mark",
      "entity_type": "dark_mark",
      "singular": true,
      "description": "The Dark Mark is introduced as a sign that appears in the wood, causing screams and panic. It is described as 'Voldemort's sign' by Hermione."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who is trying to understand what is happening around him. He is called upon by Hermione to move away from the Dark Mark."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a friend of Harry's and is terrified by the appearance of the Dark Mark. She tries to pull Harry away from it."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is mentioned as the one who is associated with the Dark Mark. His name is used in a fearful and ominous tone by Hermione."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a friend of Harry's who is also present in the clearing when the Dark Mark appears. He helps to scoop up his miniature Krum and move away from the scene."
    },
    {
      "name": "krum",
      "entity_type": "object",
      "singular": true,
      "description": "Krum is an object that Ron scoops up as they are moving away from the Dark Mark."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "the dark mark",
      "relationship_type": "near",
      "description": "Harry is near the Dark Mark when it appears, causing him to be startled and confused."
    },
    {
      "entity_1": "hermione",
      "entity_2": "the dark mark",
      "relationship_type": "near",
      "description": "Hermione is also near the Dark Mark when it appears, causing her to become terrified and try to pull Harry away from it."
    },
    {
      "entity_1": "ron",
      "entity_2": "krum",
      "relationship_type": "has",
      "description": "Ron has Krum with him as they are moving away from the Dark Mark."
    }
  ]
}