{
  "entities": [
    {
      "name": "priori incantatem",
      "entity_type": "spell",
      "singular": true,
      "description": "Priori Incantatem is a spell mentioned in the text. It is described as a spell that can be used to force beads of light back towards Voldemort's wand, and it is said to have been used by Harry Potter."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is the main character in the text. He is described as a wizard who is trying to use the Priori Incantatem spell to force beads of light back towards Voldemort's wand."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is the antagonist in the text. He is described as a wizard who is being affected by the Priori Incantatem spell, and his wand is said to be vibrating extra-hard."
    },
    {
      "name": "phoenix song",
      "entity_type": "sound",
      "singular": true,
      "description": "The phoenix song is mentioned in the text as something that Harry Potter can hear. It is described as a sound that helps him concentrate on using the Priori Incantatem spell."
    },
    {
      "name": "wand",
      "entity_type": "object",
      "singular": true,
      "description": "Wands are mentioned in the text as objects that wizards use to cast spells. Harry Potter's wand is said to be vibrating hard, and Voldemort's wand is said to be vibrating extra-hard."
    },
    {
      "name": "bead of light",
      "entity_type": "object",
      "singular": true,
      "description": "Beads of light are mentioned in the text as objects that are being affected by the Priori Incantatem spell. They are described as quivering and moving towards Voldemort's wand."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "priori incantatem",
      "relationship_type": "uses",
      "description": "Harry Potter is using the Priori Incantatem spell to try and force beads of light back towards Voldemort's wand. This is described in the text as Harry concentrating every last particle of his mind upon forcing the bead back toward Voldemort."
    },
    {
      "entity_1": "priori incantatem",
      "entity_2": "voldemort",
      "relationship_type": "affects",
      "description": "The Priori Incantatem spell is affecting Voldemort, causing his wand to vibrate extra-hard and making him look astonished and fearful."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "phoenix song",
      "relationship_type": "listens_to",
      "description": "Harry Potter can hear the phoenix song, which is helping him concentrate on using the Priori Incantatem spell."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "wand",
      "relationship_type": "possesses",
      "description": "Voldemort possesses a wand that is vibrating extra-hard due to the effects of the Priori Incantatem spell."
    }
  ]
}