{
  "entities": [
    {
      "name": "Harry",
      "entity_type": "character",
      "singular": true,
      "description": "The main protagonist of the story. He is going to send a letter to Sirius using Pigwidgeon."
    },
    {
      "name": "Ron",
      "entity_type": "character",
      "singular": true,
      "description": "Harry's friend who accompanies him to the Owlery. He is shocked to hear that Karkaroff was a Death Eater but later thinks it fits with what he already knew."
    },
    {
      "name": "Hermione",
      "entity_type": "character",
      "singular": true,
      "description": "Harry's friend who accompanies him to the Owlery. She is not mentioned as having any specific thoughts or actions in this passage."
    },
    {
      "name": "Pigwidgeon",
      "entity_type": "animal",
      "singular": true,
      "description": "A small owl that Harry uses to send a letter to Sirius."
    },
    {
      "name": "Sirius",
      "entity_type": "character",
      "singular": true,
      "description": "Harry's godfather who is the recipient of the letter. He has told Harry about Karkaroff being a Death Eater."
    },
    {
      "name": "Karkaroff",
      "entity_type": "character",
      "singular": true,
      "description": "A former Death Eater who was friends with Malfoy's father and is now in trouble for putting Harry's name in the Goblet of Fire."
    },
    {
      "name": "Malfoy",
      "entity_type": "character",
      "singular": true,
      "description": "The son of a former Death Eater who was friends with Karkaroff. He mentioned on the train that his father knew Karkaroff."
    }
  ],
  "relationships": [
    {
      "entity_1": "Harry",
      "entity_2": "Pigwidgeon",
      "relationship_type": "uses",
      "description": "Harry is using Pigwidgeon to send a letter to Sirius. This is mentioned in the sentence 'so that Harry could send S i r i u s  a  l e t t e r'."
    },
    {
      "entity_1": "Ron",
      "entity_2": "Karkaroff",
      "relationship_type": "suspects",
      "description": "Ron is suspecting Karkaroff of being a Death Eater. This is mentioned in the sentence 'by the time they entered the Owlery Ron was saying th at they ought to have suspected it all along'."
    },
    {
      "entity_1": "Harry",
      "entity_2": "Karkaroff",
      "relationship_type": "has_name_in_goblet",
      "description": "Karkaroff has put Harry's name in the Goblet of Fire. This is mentioned in the sentence 'if it was Karkaroff who put yo ur name in the gob-let'."
    },
    {
      "entity_1": "Malfoy's father",
      "entity_2": "Karkaroff",
      "relationship_type": "friends_with",
      "description": "Malfoy's father and Karkaroff were friends. This is mentioned in the sentence 'Rem ember what Malfoy said on the train, about his dad being friends with Karkaroff?'"
    }
  ]
}