{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as being on Harry's behalf, showing his loyalty and support for Harry. (\"Ron’s indignation on his behalf was worth about a hundred points to him.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character of the story and is described as being in first place along with Krum. (\"You’re tied in first place, Harry! You and Krum!\")"
    },
    {
      "name": "krum",
      "entity_type": "person",
      "singular": true,
      "description": "Krum is mentioned as being tied in first place with Harry. (\"You’re tied in first place, Harry! You and Krum!\")"
    },
    {
      "name": "cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric is mentioned as being on the same side as Harry when they were facing a challenge. (\"...most of the school had been on his side as well as Cedric’s.\")"
    },
    {
      "name": "charlie weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Charlie Weasley is mentioned as being present and congratulating Harry on being tied in first place. (\"You’re tied in first place, Harry! You and Krum!\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "support",
      "description": "Ron is supporting Harry by being on his behalf. (\"Ron’s indignation on his behalf was worth about a hundred points to him.\")"
    },
    {
      "entity_1": "charlie weasley",
      "entity_2": "harry",
      "relationship_type": "congratulation",
      "description": "Charlie Weasley is congratulating Harry on being tied in first place. (\"You’re tied in first place, Harry! You and Krum!\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "krum",
      "relationship_type": "tie",
      "description": "Harry and Krum are tied in first place. (\"You’re tied in first place, Harry! You and Krum!\")"
    }
  ]
}