{
  "entities": [
    {
      "name": "tree root",
      "entity_type": "physical obstacle",
      "singular": true,
      "description": "The tree root is described as the cause of Harry tripping over it. It is mentioned that 'he said angrily, getting to his feet again' after tripping over the tree root."
    },
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as one of the main characters who trips over a tree root. He is described as having 'feet that size', which makes it hard not to trip over something."
    },
    {
      "name": "Ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as being present with Harry and Hermione at the campsite. He tells Malfoy to do something that Harry would never have dared say in front of Mrs. Weasley."
    },
    {
      "name": "Hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as being present with Harry and Ron at the campsite."
    },
    {
      "name": "Draco Malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is introduced as a character who is standing nearby, leaning against a tree. He seems to have been watching the scene at the campsite through a gap in the trees."
    },
    {
      "name": "Mrs. Weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is mentioned as someone that Harry would never dare say something in front of."
    }
  ],
  "relationships": [
    {
      "entity_1": "Harry",
      "entity_2": "tree root",
      "relationship_type": "tripped over",
      "description": "The relationship between Harry and the tree root is described as Harry tripping over it. It is mentioned that 'he said angrily, getting to his feet again' after tripping over the tree root."
    },
    {
      "entity_1": "Ron",
      "entity_2": "Malfoy",
      "relationship_type": "told",
      "description": "The relationship between Ron and Malfoy is described as Ron telling Malfoy to do something that Harry would never have dared say in front of Mrs. Weasley."
    },
    {
      "entity_1": "Harry",
      "entity_2": "Mrs. Weasley",
      "relationship_type": "afraid of",
      "description": "The relationship between Harry and Mrs. Weasley is described as Harry being afraid to say something in front of her."
    },
    {
      "entity_1": "Malfoy",
      "entity_2": "Harry",
      "relationship_type": "teasing",
      "description": "The relationship between Malfoy and Harry is described as Malfoy teasing Harry about his feet size."
    }
  ]
}