{
  "entities": [
    {
      "name": "krum",
      "entity_type": "person",
      "singular": true,
      "description": "Krum is a Quidditch player who caught the Snitch. He is described as brave and looks like a 'terrible mess' after landing."
    },
    {
      "name": "ireland",
      "entity_type": "team",
      "singular": false,
      "description": "Ireland is a team in the Quidditch match that Krum played for. They are described as being ahead of their opponents by 160 points when Krum caught the Snitch."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is one of the characters who is watching the Quidditch match and reacting to Krum's actions. He is described as shouting back at Ron over the noise."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is another character who is watching the Quidditch match and reacting to Krum's actions. He is described as bellowing a question about why Krum caught the Snitch."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is another character who is watching the Quidditch match and reacting to Krum's actions. She is described as saying that Krum was brave and looks like a 'terrible mess' after landing."
    },
    {
      "name": "irish chasers",
      "entity_type": "team",
      "singular": false,
      "description": "The Irish Chasers are the team of players from Ireland who are playing in the Quidditch match. They are described as being too good for their opponents to catch up with."
    }
  ],
  "relationships": [
    {
      "entity_1": "krum",
      "entity_2": "ireland",
      "relationship_type": "member_of",
      "description": "Krum is a member of the Ireland team in the Quidditch match."
    },
    {
      "entity_1": "harry",
      "entity_2": "krum",
      "relationship_type": "observer_of",
      "description": "Harry is observing Krum's actions during the Quidditch match."
    },
    {
      "entity_1": "ron",
      "entity_2": "krum",
      "relationship_type": "questioner_of",
      "description": "Ron is questioning why Krum caught the Snitch during the Quidditch match."
    },
    {
      "entity_1": "hermione",
      "entity_2": "krum",
      "relationship_type": "observer_of",
      "description": "Hermione is observing Krum's actions during the Quidditch match and commenting on his bravery."
    }
  ]
}