{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a gamekeeper at Hogwarts and one of Harry's friends. He is mentioned as getting up to leave with Moody, waving at Harry, and being unable to see him."
    },
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "Moody is a wizard who has a magical eye. He is mentioned as getting up to leave with Hagrid, pausing to look at Harry, and limping around the table."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character of the story. He is mentioned as watching Hagrid and Moody leave, waving at them, and being noticed by Moody's magical eye."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is one of Harry's friends. She is mentioned as smiling back at Hagrid and sitting at a table with Harry."
    }
  ],
  "relationships": [
    {
      "entity_1": "moody",
      "entity_2": "hagrid",
      "relationship_type": "accompanying",
      "description": "Moody and Hagrid are walking together, as mentioned in the sentence 'As Harry watched, he saw Hagrid and Moody get up to leave'."
    },
    {
      "entity_1": "moody",
      "entity_2": "harry",
      "relationship_type": "observing",
      "description": "Moody's magical eye is observing Harry, as mentioned in the sentence 'He paused, his magical eye on the corner where Harry was standing'."
    },
    {
      "entity_1": "moody",
      "entity_2": "hagrid",
      "relationship_type": "communicating",
      "description": "Moody is communicating with Hagrid by tapping him on the back and muttering something to him, as mentioned in the sentence 'He tapped Hagrid in the small of the back (being unable to reach his shoulder), muttered something to him...'."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "hermione",
      "relationship_type": "greeting",
      "description": "Hagrid is greeting Hermione by saying 'All right, Hermione?' as mentioned in the sentence '“All right, Hermione?” said Hagrid loudly'."
    }
  ]
}