{
  "entities": [
    {
      "name": "voldemort",
      "entity_type": "character",
      "singular": true,
      "description": "The main antagonist of the story, described as having red eyes and fighting to break a thread of light connecting his wand with Harry's. (Excerpt: 'Harry saw his red eyes wide with astonishment at what was happening...')"
    },
    {
      "name": "death eaters",
      "entity_type": "group",
      "singular": false,
      "description": "A group of followers of Voldemort, described as circling like jackals and having their cries muffled. (Excerpt: 'cage of light, beyond which the Death Eaters circled like jackals...')"
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "The main protagonist of the story, described as holding onto Voldemort's wand tightly and feeling a sense of hope when he hears the phoenix song. (Excerpts: 'Harry held onto his wand more tightly...'; 'He felt as though')"
    },
    {
      "name": "phoenix",
      "entity_type": "mythical creature",
      "singular": true,
      "description": "A creature that is associated with a beautiful and welcome sound, described as the phoenix song. (Excerpt: 'It was the sound of hope to Harry...the most beautiful and welcome thing he had ever heard in his life.')"
    }
  ],
  "relationships": [
    {
      "entity_1": "voldemort",
      "entity_2": "death eaters",
      "relationship_type": "command",
      "description": "Voldemort is commanding the Death Eaters not to do anything unless he commands them. (Excerpt: '“Do nothing!” Voldemort shrieked to the Death Eaters...')"
    },
    {
      "entity_1": "voldemort",
      "entity_2": "harry",
      "relationship_type": "connection",
      "description": "Voldemort's wand is connected to Harry's through a thread of light, which Harry holds onto tightly. (Excerpt: 'Harry held onto his wand more tightly...')"
    },
    {
      "entity_1": "voldemort",
      "entity_2": "phoenix",
      "relationship_type": "association",
      "description": "The phoenix song is associated with Voldemort, as it is a sound that fills the air when the threads of light are vibrating around him and Harry. (Excerpt: 'It was coming from every thread of the light-spun web vibrating around Harry and Voldemort...')"
    }
  ]
}