{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is introduced as a person who has been injured and is now sitting at the end of the table, waving at Harry, Ron, and Hermione with a heavily bandaged hand. (\"He slid into his seat at the end and waved at Harry, Ron, and Hermione with a very heavily bandaged hand.\")"
    },
    {
      "name": "skrewts",
      "entity_type": "animal",
      "singular": false,
      "description": "Skrewts are mentioned as being healthy and thriving. (\"‘Thrivin’,\" Hagrid ca lled back happily.\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is introduced as a person who is sitting at the table with Harry and Hermione. He makes a comment about Hagrid's fingers being eaten by Skrewts. (\"Yeah, I’ll just bet they are,\" said Ron quietly.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as a person who is sitting at the table with Ron and Hermione. He calls out to Hagrid and asks about Skrewts. (\"‘Skrewts doing all right, Hagrid?’ Harry called.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is introduced as a person who is sitting at the table with Ron and Harry. She is not mentioned by name in this passage but is referred to as \"they\". (\"Looks like they’ve finally found a food they like, doesn’t it? Hagrid’s fingers.\")"
    },
    {
      "name": "beauxbatons",
      "entity_type": "school",
      "singular": false,
      "description": "Beauxbatons is introduced as a school that the girl from Beauxbatons attends. (\"It was the girl from Beauxbatons who had laughed during Dumbledore’s speech.\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as having given a speech at which the girl from Beauxbatons laughed. (\"It was the girl from Beauxbatons who had laughed during Dumbledore’s speech.\")"
    },
    {
      "name": "girl",
      "entity_type": "person",
      "singular": true,
      "description": "The girl from Beauxbatons is introduced as a person with silvery-blonde hair and deep blue eyes. She is the one who asks about the bouillabaisse. (\"It was the girl from Beauxbatons who had laughed during Dumbledore’s speech.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "girl",
      "relationship_type": "blushes_at",
      "description": "Ron blushes at the sight of the girl. (\"Ron went purple.\")"
    },
    {
      "entity_1": "hagrid",
      "entity_2": "skrewts",
      "relationship_type": "caring_for",
      "description": "Hagrid is caring for Skrewts, which are thriving under his care. (\"‘Thrivin’,\" Hagrid ca lled back happily.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "girl",
      "relationship_type": "talks_to",
      "description": "Harry talks to the girl and orders the bouillabaisse for her. (\"‘Yeah, have it,’ said Harry, pu shing the dish toward the girl.\")"
    }
  ]
}