{
  "entities": [
    {
      "name": "ludo",
      "entity_type": "person",
      "singular": true,
      "description": "Ludo is mentioned as the one Crouch is talking to, indicating he is a person present in the scene."
    },
    {
      "name": "crouch",
      "entity_type": "person",
      "singular": true,
      "description": "Crouch is mentioned as having impatience and speaking to Ludo, indicating he is a person present in the scene."
    },
    {
      "name": "professor karkaroff",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Karkaroff is mentioned as being beckoned by Dumbledore, indicating he is a person present in the scene."
    },
    {
      "name": "madame maxime",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Maxime is mentioned as putting her arm around Fleur's shoulders and leading her out of the room, indicating she is a person present in the scene."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as speaking to Harry and Cedric, indicating he is a person present in the scene."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is mentioned as being led out of the room by Madame Maxime, indicating she is a person present in the scene."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as leaving with Cedric and being spoken to by Dumbledore, indicating he is a person present in the scene."
    },
    {
      "name": "cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric is mentioned as leaving with Harry and being spoken to by Dumbledore, indicating he is a person present in the scene."
    },
    {
      "name": "krum",
      "entity_type": "person",
      "singular": true,
      "description": "Krum is mentioned as being beckoned by Professor Karkaroff, indicating he is a person present in the scene."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "professor karkaroff",
      "relationship_type": "beckon",
      "description": "Dumbledore beckons to Professor Karkaroff, indicating a relationship of command or invitation."
    },
    {
      "entity_1": "madame maxime",
      "entity_2": "fleur",
      "relationship_type": "lead",
      "description": "Madame Maxime leads Fleur out of the room, indicating a relationship of care or guidance."
    },
    {
      "entity_1": "professor karkaroff",
      "entity_2": "krum",
      "relationship_type": "beckon",
      "description": "Professor Karkaroff beckons to Krum, indicating a relationship of command or invitation."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "speak_to",
      "description": "Dumbledore speaks to Harry, indicating a relationship of authority or guidance."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "cedric",
      "relationship_type": "speak_to",
      "description": "Dumbledore speaks to Cedric, indicating a relationship of authority or guidance."
    }
  ]
}