{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as a person who is hurrying out into the pitch-darkness with Harry. He is described as quickening his pace and taking longer strides."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a person who is hurrying along beside Dumbledore. He is concerned about Mr. Crouch's behavior and mentions that he left him with Viktor Krum."
    },
    {
      "name": "viktor krum",
      "entity_type": "person",
      "singular": true,
      "description": "Viktor Krum is mentioned as a person who Harry left Mr. Crouch with. Dumbledore asks if anybody else saw Mr. Crouch."
    },
    {
      "name": "mr. crouch",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Crouch is mentioned as a person who is acting strangely and doesn't seem to know where he is. Harry mentions that he left him with Viktor Krum."
    },
    {
      "name": "percy weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Percy Weasley is mentioned as someone Mr. Crouch thinks is there, but it's actually Dumbledore."
    },
    {
      "name": "mr. bagman",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Bagman is mentioned as a person who had just finished telling Harry and Viktor Krum about the third task."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "dumbledore",
      "relationship_type": "accompanying",
      "description": "Harry is accompanying Dumbledore through the darkness."
    },
    {
      "entity_1": "harry",
      "entity_2": "viktor krum",
      "relationship_type": "talking_to",
      "description": "Harry was talking to Viktor Krum when they saw Mr. Crouch coming out of the forest."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "mr. crouch",
      "relationship_type": "concerned_about",
      "description": "Dumbledore is concerned about Mr. Crouch's behavior and asks if anybody else saw him."
    },
    {
      "entity_1": "harry",
      "entity_2": "mr. crouch",
      "relationship_type": "left_with",
      "description": "Harry left Mr. Crouch with Viktor Krum."
    }
  ]
}