{
  "entities": [
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is the main protagonist of the story. He is described as leaning against the window of the carriage, looking out at Hogwarts coming nearer."
    },
    {
      "name": "ron",
      "entity_type": "character",
      "singular": true,
      "description": "Ron is one of Harry's friends and a student at Hogwarts. He is mentioned as saying 'Blimey' when they arrive at the castle."
    },
    {
      "name": "hermione",
      "entity_type": "character",
      "singular": true,
      "description": "Hermione is another one of Harry's friends and a student at Hogwarts. She is mentioned alongside Ron and Neville as jumping down from their carriage."
    },
    {
      "name": "neville",
      "entity_type": "character",
      "singular": true,
      "description": "Neville is a friend of Harry's and a student at Hogwarts. He is mentioned alongside Ron and Hermione as jumping down from their carriage."
    },
    {
      "name": "hogwarts",
      "entity_type": "school",
      "singular": true,
      "description": "Hogwarts is the school that Harry, Ron, Hermione, and Neville attend. It is described as coming nearer through the gates, with its many lighted windows blurred behind a thick curtain of rain."
    },
    {
      "name": "triwizard tournament",
      "entity_type": "event",
      "singular": true,
      "description": "The Triwizard Tournament is an event that is mentioned in the chapter title and is likely to be taking place at Hogwarts."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hogwarts",
      "relationship_type": "location",
      "description": "Harry is located near Hogwarts, as he can see it coming nearer through the gates."
    },
    {
      "entity_1": "ron",
      "entity_2": "hogwarts",
      "relationship_type": "location",
      "description": "Ron is also located near Hogwarts, as he is with Harry and they are both looking at the castle."
    },
    {
      "entity_1": "hermione",
      "entity_2": "hogwarts",
      "relationship_type": "location",
      "description": "Hermione is located near Hogwarts, as she is with Ron and Harry and they are all looking at the castle."
    },
    {
      "entity_1": "neville",
      "entity_2": "hogwarts",
      "relationship_type": "location",
      "description": "Neville is also located near Hogwarts, as he is with Ron, Hermione, and Harry and they are all looking at the castle."
    }
  ]
}