{
  "entities": [
    {
      "name": "padfoot",
      "entity_type": "character",
      "singular": true,
      "description": "Padfoot is mentioned as a character with the ability to control people, making them do terrible things without being able to stop themselves. (Excerpt: 'you know he can control people so that they do terrible things without being able to stop themselves.')"
    },
    {
      "name": "voldemort",
      "entity_type": "character",
      "singular": true,
      "description": "Voldemort is mentioned as the supporter of harsh measures against his supporters. (Excerpt: 'he started ordering very harsh measures against Voldemort's supporters.')"
    },
    {
      "name": "crouch",
      "entity_type": "character",
      "singular": true,
      "description": "Crouch is mentioned as a character who rose quickly through the Ministry and ordered harsh measures against Voldemort's supporters. (Excerpt: 'He rose quickly through the Ministry, and he started ordering very harsh measures against Voldemort's supporters.')"
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is mentioned as being in disarray due to the rise of terror. (Excerpt: 'the Ministry of Magic's in disarray, they don't know what to do')"
    },
    {
      "name": "aurors",
      "entity_type": "group",
      "singular": false,
      "description": "The Aurors are mentioned as being given new powers to kill rather than capture. (Excerpt: 'The Aurors were given new powers — powers to kill rather than capture, for instance')"
    },
    {
      "name": "muggles",
      "entity_type": "group",
      "singular": false,
      "description": "Muggles are mentioned as being affected by the rise of terror. (Excerpt: 'but meanwhile, Muggles are dying too')"
    }
  ],
  "relationships": [
    {
      "entity_1": "padfoot",
      "entity_2": "voldemort",
      "relationship_type": "supporter_of",
      "description": "Padfoot is mentioned as being able to control people who support Voldemort. (Excerpt: 'you know he can control people so that they do terrible things without being able to stop themselves')"
    },
    {
      "entity_1": "crouch",
      "entity_2": "voldemort",
      "relationship_type": "opponent_of",
      "description": "Crouch is mentioned as ordering harsh measures against Voldemort's supporters. (Excerpt: 'he started ordering very harsh measures against Voldemort's supporters')"
    },
    {
      "entity_1": "aurors",
      "entity_2": "ministry of magic",
      "relationship_type": "affiliated_with",
      "description": "The Aurors are mentioned as being given new powers by the Ministry. (Excerpt: 'The Aurors were given new powers — powers to kill rather than capture, for instance')"
    }
  ]
}