{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is described as waltzing with Madame Maxime. He is dwarfed by her, but she moves graciously for a woman of her size."
    },
    {
      "name": "madame maxime",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Maxime is described as waltzing with Dumbledore. She is large and moves graciously, but her size makes it difficult for Dumbledore to reach the top of his hat."
    },
    {
      "name": "mad-eye moody",
      "entity_type": "person",
      "singular": true,
      "description": "Mad-Eye Moody is described as doing an extremely ungainly two-step with Professor Sinistra. He has a wooden leg and his magical eye stares through Harry's robes."
    },
    {
      "name": "professor sinistra",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Sinistra is described as nervously avoiding Mad-Eye Moody's wooden leg while they dance the two-step."
    },
    {
      "name": "dobby",
      "entity_type": "house_elf",
      "singular": true,
      "description": "Dobby is mentioned as having knitted socks for Harry. He is described as creepy by Parvati."
    },
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is described as whispering to Harry about Mad-Eye Moody's magical eye and Dobby being creepy. She is excited about the music and wants to stay."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as wearing socks knitted by Dobby. He grins when talking to Mad-Eye Moody and lets go of Parvati during the music."
    },
    {
      "name": "the weird sisters",
      "entity_type": "band",
      "singular": false,
      "description": "The Weird Sisters are described as playing bagpipes and then striking up a new song. They fill the hall with applause and music."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "madame maxime",
      "relationship_type": "dance_with",
      "description": "Dumbledore is described as waltzing with Madame Maxime. This relationship is mentioned in the first sentence of the chapter."
    },
    {
      "entity_1": "mad-eye moody",
      "entity_2": "professor sinistra",
      "relationship_type": "dance_with",
      "description": "Mad-Eye Moody is described as doing an extremely ungainly two-step with Professor Sinistra. This relationship is mentioned in the second sentence of the chapter."
    },
    {
      "entity_1": "mad-eye moody",
      "entity_2": "harry potter",
      "relationship_type": "talk_to",
      "description": "Mad-Eye Moody passes by Harry and says 'Nice socks, Potter' while staring through his robes with his magical eye. This relationship is mentioned in the third sentence of the chapter."
    },
    {
      "entity_1": "parvati",
      "entity_2": "mad-eye moody",
      "relationship_type": "express_disapproval",
      "description": "Parvati whispers to Harry about Mad-Eye Moody's magical eye and Dobby being creepy. This relationship is mentioned in the fourth sentence of the chapter."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "parvati",
      "relationship_type": "hold",
      "description": "Harry lets go of Parvati during the music. This relationship is mentioned in the sixth sentence of the chapter."
    }
  ]
}