{
  "entities": [
    {
      "name": "cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric is mentioned as one of the students beside the judges' table, watching Harry. (\"Cedric, Fleur, and Krum were beside the judges' table, watching Harry sprint toward them.\")"
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is mentioned as one of the students beside the judges' table, watching Harry. (\"Cedric, Fleur, and Krum were beside the judges' table, watching Harry sprint toward them.\")"
    },
    {
      "name": "krum",
      "entity_type": "person",
      "singular": true,
      "description": "Krum is mentioned as one of the students beside the judges' table, watching Harry. (\"Cedric, Fleur, and Krum were beside the judges' table, watching Harry sprint toward them.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who has been absent and is now arriving at the scene. (\"I'm . . . here . . .\" Harry panted, skidding to a halt in the mud and accidentally splattering Fleur's robes.)"
    },
    {
      "name": "percy weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Percy Weasley is mentioned as one of the judges who is scolding Harry for being late. (\"Where have you been?\" said a bossy, disapproving voice. \"The task's about to start!\")"
    },
    {
      "name": "mr. crouch",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Crouch is mentioned as the one who failed to turn up again. (\"Harry looked around. Percy Weasley was sitting at the judges' table — Mr. Crouch had failed to turn up again.\")"
    },
    {
      "name": "ludo bagman",
      "entity_type": "person",
      "singular": true,
      "description": "Ludo Bagman is mentioned as one of the judges who is relieved to see Harry. (\"Now, now, Percy!\" said Ludo Bagman, who was looking intensely relieved to see Harry.)"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as one of the judges who smiles at Harry. (\"Dumbledore smiled at Harry, but Karkaroff and Madame Maxime didn't look at all pleased to see him.\")"
    },
    {
      "name": "karkaroff",
      "entity_type": "person",
      "singular": true,
      "description": "Karkaroff is mentioned as one of the judges who does not look pleased to see Harry. (\"Dumbledore smiled at Harry, but Karkaroff and Madame Maxime didn't look at all pleased to see him.\")"
    },
    {
      "name": "madame maxime",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Maxime is mentioned as one of the judges who does not look pleased to see Harry. (\"Dumbledore smiled at Harry, but Karkaroff and Madame Maxime didn't look at all pleased to see him.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "fleur",
      "relationship_type": "splattered",
      "description": "Harry accidentally splatters Fleur's robes. (\"I'm . . . here . . .\" Harry panted, skidding to a halt in the mud and accidentally splattering Fleur's robes.)"
    },
    {
      "entity_1": "harry",
      "entity_2": "percy weasley",
      "relationship_type": "scolded",
      "description": "Percy Weasley scolds Harry for being late. (\"Where have you been?\" said a bossy, disapproving voice. \"The task's about to start!\")"
    },
    {
      "entity_1": "ludo bagman",
      "entity_2": "harry",
      "relationship_type": "relieved",
      "description": "Ludo Bagman is relieved to see Harry. (\"Now, now, Percy!\" said Ludo Bagman, who was looking intensely relieved to see Harry.)"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "smiled_at",
      "description": "Dumbledore smiles at Harry. (\"Dumbledore smiled at Harry, but Karkaroff and Madame Maxime didn't look at all pleased to see him.\")"
    },
    {
      "entity_1": "karkaroff",
      "entity_2": "harry",
      "relationship_type": "displeased",
      "description": "Karkaroff does not look pleased to see Harry. (\"Dumbledore smiled at Harry, but Karkaroff and Madame Maxime didn't look at all pleased to see him.\")"
    },
    {
      "entity_1": "madame maxime",
      "entity_2": "harry",
      "relationship_type": "displeased",
      "description": "Madame Maxime does not look pleased to see Harry. (\"Dumbledore smiled at Harry, but Karkaroff and Madame Maxime didn't look at all pleased to see him.\")"
    }
  ]
}