{
  "entities": [
    {
      "name": "professor karkaroff",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Karkaroff swept his students away with him. This indicates that he is a person who has the ability to transport or move people."
    },
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "Moody watched him until he was out of sight, his magical eye fixed upon his back... This indicates that Moody is a person who has a unique ability or characteristic."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry, Ron, and Hermione were not alone in rising much earlier than they usually did on weekends. This indicates that Harry is a person who has a routine or schedule."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Harry, Ron, and Hermione were not alone in rising much earlier than they usually did on weekends. This indicates that Ron is a person who has a routine or schedule."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Harry, Ron, and Hermione were not alone in rising much earlier than they usually did on weekends. This indicates that Hermione is a person who has a routine or schedule."
    },
    {
      "name": "goblet of fire",
      "entity_type": "object",
      "singular": true,
      "description": "The Goblet of Fire had been placed in the center of the entrance hall. This indicates that it is an object that has been moved or placed somewhere."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor karkaroff",
      "entity_2": "students",
      "relationship_type": "swept away with",
      "description": "Professor Karkaroff swept his students away with him. This indicates that Professor Karkaroff has a relationship with his students, where he is moving or transporting them."
    },
    {
      "entity_1": "moody",
      "entity_2": "professor karkaroff",
      "relationship_type": "watched",
      "description": "Moody watched him until he was out of sight... This indicates that Moody has a relationship with Professor Karkaroff, where Moody is observing or monitoring him."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron and hermione",
      "relationship_type": "together",
      "description": "Harry, Ron, and Hermione were not alone in rising much earlier than they usually did on weekends. This indicates that Harry has a relationship with Ron and Hermione, where they are together or associated with each other."
    },
    {
      "entity_1": "harry",
      "entity_2": "goblet of fire",
      "relationship_type": "examining",
      "description": "When they went down into the entrance hall, they saw about twenty people milling around it, some of them eating toast, all examining the Goblet of Fire. This indicates that Harry has a relationship with the Goblet of Fire, where he is observing or examining it."
    }
  ]
}