{
  "entities": [
    {
      "name": "thomas",
      "entity_type": "person",
      "singular": true,
      "description": "Thomas is mentioned as a student in the class who has not managed to turn a hedgehog into a satisfactory pincushion. (\"Miss Granger remains the only person in this class who has managed to turn a hedgehog into a satisfactory pincushion. I might remind you that your pincushion, Thomas, still curls up in fright if anyone approaches it with a pin!\")"
    },
    {
      "name": "miss granger",
      "entity_type": "person",
      "singular": true,
      "description": "Miss Granger is mentioned as the only person in the class who has managed to turn a hedgehog into a satisfactory pincushion. (\"Miss Granger remains the only person in this class who has managed to turn a hedgehog into a satisfactory pincushion.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who had turned rather pink again and seemed to be trying not to look too pleased with herself. (\"Hermione, who had turned rather pink again, seemed to be trying not to look too pleased with herself.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who received top marks for their homework in Divination class. (\"Harry and Ron were deeply amused when Professor Trelawney told them that they had received top marks for their homework in their next Divination class.\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who received top marks for their homework in Divination class. (\"Harry and Ron were deeply amused when Professor Trelawney told them that they had received top marks for their homework in their next Divination class.\")"
    },
    {
      "name": "professor trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Trelawney is mentioned as the teacher who told Harry and Ron that they had received top marks for their homework in Divination class. (\"Harry and Ron were deeply amused when Professor Trelawney told them that they had received top marks for their homework in their next Divination class.\")"
    },
    {
      "name": "hedgehog",
      "entity_type": "animal",
      "singular": true,
      "description": "A hedgehog is mentioned as an object that Miss Granger has managed to turn into a satisfactory pincushion. (\"Miss Granger remains the only person in this class who has managed to turn a hedgehog into a satisfactory pincushion.\")"
    },
    {
      "name": "pincushion",
      "entity_type": "object",
      "singular": true,
      "description": "A pincushion is mentioned as an object that Miss Granger has managed to turn from a hedgehog. (\"Miss Granger remains the only person in this class who has managed to turn a hedgehog into a satisfactory pincushion.\")"
    },
    {
      "name": "divination",
      "entity_type": "subject",
      "singular": true,
      "description": "Divination is mentioned as a subject for which Harry and Ron received top marks for their homework. (\"Harry and Ron were deeply amused when Professor Trelawney told them that they had received top marks for their homework in their next Divination class.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "miss granger",
      "entity_2": "hedgehog",
      "relationship_type": "transformed_into",
      "description": "Miss Granger has managed to transform a hedgehog into a satisfactory pincushion. (\"Miss Granger remains the only person in this class who has managed to turn a hedgehog into a satisfactory pincushion.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "divination",
      "relationship_type": "received_marks_in",
      "description": "Harry received top marks for their homework in Divination class. (\"Harry and Ron were deeply amused when Professor Trelawney told them that they had received top marks for their homework in their next Divination class.\")"
    },
    {
      "entity_1": "ron",
      "entity_2": "divination",
      "relationship_type": "received_marks_in",
      "description": "Ron received top marks for their homework in Divination class. (\"Harry and Ron were deeply amused when Professor Trelawney told them that they had received top marks for their homework in their next Divination class.\")"
    }
  ]
}