{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as a person who is with Harry, shaking his head and saying 'Barking mad'. He is trying to get Harry to leave the tent."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a person who has just finished a task, feeling elated and picking up his golden egg and Firebolt. He is being congratulated by Ron."
    },
    {
      "name": "cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric is mentioned as a person who did a weird thing during the task, Transfiguring a rock into a dog to distract the dragon. He got burned but managed to get away with the egg."
    },
    {
      "name": "dragon",
      "entity_type": "animal",
      "singular": true,
      "description": "The dragon is mentioned as an animal that was part of the task, which Cedric tried to distract by Transfiguring a rock into a dog. It changed its mind and went for Cedric instead."
    },
    {
      "name": "labrador",
      "entity_type": "animal",
      "singular": true,
      "description": "The Labrador is mentioned as an animal that the dragon was initially interested in, but then decided to go for Cedric instead."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "accompanying",
      "description": "Ron is accompanying Harry as they leave the tent, with Ron talking fast and trying to get Harry to move."
    },
    {
      "entity_1": "cedric",
      "entity_2": "dragon",
      "relationship_type": "interacting_with",
      "description": "Cedric interacted with the dragon during the task, trying to distract it by Transfiguring a rock into a dog. The dragon changed its mind and went for Cedric instead."
    },
    {
      "entity_1": "dragon",
      "entity_2": "labrador",
      "relationship_type": "interested_in",
      "description": "The dragon was initially interested in the Labrador, but then decided to go for Cedric instead."
    }
  ]
}