{
  "entities": [
    {
      "name": "giants",
      "entity_type": "giant",
      "singular": true,
      "description": "Giants are mentioned as being subject to prejudice and bigotry, similar to werewolves. (\"They can’t all be horrible... It’s the same sort of prejudice that people have toward werewolves.\")"
    },
    {
      "name": "werewolves",
      "entity_type": "werewolf",
      "singular": true,
      "description": "Werewolves are mentioned as being subject to prejudice and bigotry. (\"It’s the same sort of prejudice that people have toward werewolves.\")"
    },
    {
      "name": "harry",
      "entity_type": "student",
      "singular": true,
      "description": "Harry is a student who is feeling nervous about an upcoming event on February 24th. (\"He still hadn’t done anything about working out the clue inside the golden egg.\")"
    },
    {
      "name": "hermione",
      "entity_type": "student",
      "singular": true,
      "description": "Hermione is a student who is not looking at Ron when he shakes his head disbelievingly. (\"Hermione wasn’t looking.\")"
    },
    {
      "name": "ron",
      "entity_type": "student",
      "singular": true,
      "description": "Ron is a student who is shaking his head disbelievingly but does not want to have another argument. (\"Ron looked as though he would have liked to reply scathingly... He contented himself with shaking his head disbelievingly while Hermione wasn’t looking.\")"
    },
    {
      "name": "christmas",
      "entity_type": "holiday",
      "singular": true,
      "description": "Christmas is a holiday that has passed and everyone seems to be feeling flat now. (\"Everybody seemed to be feeling rather flat now that Christmas was over.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "golden egg",
      "relationship_type": "has",
      "description": "Harry has a golden egg in his trunk. (\"He therefore started taking the egg out of his trunk every time he went up.\")"
    },
    {
      "entity_1": "ron",
      "entity_2": "hysteria",
      "relationship_type": "causes",
      "description": "Ron's reaction to the hysteria about giants is disbelieving, but he does not want to have another argument. (\"Ron looked as though he would have liked to reply scathingly... He contented himself with shaking his head disbelievingly while Hermione wasn’t looking.\")"
    }
  ]
}