{
  "entities": [
    {
      "name": "madame maxime",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Maxime is mentioned as the owner of huge horses that are snorting and stamping. (\"Madame Maxime's huge horses snorting and stamping.\")"
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as the one who suddenly says 'Can you hear somethin g?' (\"said Ron suddenly.\")"
    },
    {
      "name": "lee jordan",
      "entity_type": "person",
      "singular": true,
      "description": "Lee Jordan is mentioned as the one who yells 'The lake!' and points down at it. (\"yelled Lee Jordan, po inting down at it.\")"
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who listens to the noise and hears a loud and oddly eerie sound. (\"Harry listened; a loud and oddly eerie noise was drifting toward them from out of the darkness.\")"
    },
    {
      "name": "the lake",
      "entity_type": "location",
      "singular": true,
      "description": "The lake is mentioned as the location where the disturbance is taking place. (\"From their position at the top of the la wns overlooking the grounds, they had a clear view of  the smooth black surface of the water — except that the surface was suddenly not smooth at all.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "ron weasley",
      "entity_2": "harry potter",
      "relationship_type": "heard_sound",
      "description": "Ron says 'Can you hear somethin g?' and Harry listens to the noise. (\"said Ron suddenly.\" \"Harry listened; a loud and oddly eerie noise was drifting toward them from out of the darkness.\")"
    },
    {
      "entity_1": "lee jordan",
      "entity_2": "the lake",
      "relationship_type": "pointed_at",
      "description": "Lee Jordan yells 'The lake!' and points down at it. (\"yelled Lee Jordan, po inting down at it.\")"
    },
    {
      "entity_1": "harry potter",
      "entity_2": "the lake",
      "relationship_type": "observed_disturbance",
      "description": "Harry observes the disturbance taking place in the lake. (\"From their position at the top of the la wns overlooking the grounds, they had a clear view of  the smooth black surface of the water — except that the surface was suddenly not smooth at all.\")"
    }
  ]
}