{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story, a student at Hogwarts. He is described as sitting down with other Gryffindors and wondering about Professor Karkaroff's whereabouts."
    },
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "A teacher at Hogwarts who has a fear of attack due to his ten-month imprisonment in his own trunk. He is mentioned as being bound to have had an increased fear of attack."
    },
    {
      "name": "karkaroff",
      "entity_type": "person",
      "singular": true,
      "description": "A professor at Hogwarts whose chair was empty. Harry wonders where he is and whether Voldemort has caught up with him."
    },
    {
      "name": "madame maxime",
      "entity_type": "person",
      "singular": true,
      "description": "A teacher at Hogwarts who is still present and sitting next to Hagrid. She is mentioned as talking quietly together with him."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "A gamekeeper at Hogwarts who is sitting next to Madame Maxime and talking quietly with her."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "A teacher at Hogwarts whose eyes lingered on Harry for a moment. His expression was difficult to read."
    },
    {
      "name": "volde-mort",
      "entity_type": "villain",
      "singular": true,
      "description": "The main antagonist of the story who is mentioned as having returned and possibly caught up with Professor Karkaroff."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "A professor at Hogwarts whose orders Snape followed on the night Voldemort returned. His name is mentioned in relation to Snape's actions."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "watching",
      "description": "Harry continued to watch Snape, long after he had looked away."
    },
    {
      "entity_1": "volde-mort",
      "entity_2": "karkaroff",
      "relationship_type": "caught_up_with",
      "description": "Harry wonders whether Voldemort has caught up with Professor Karkaroff."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "snape",
      "relationship_type": "ordered",
      "description": "Snape followed Dumbledore's orders on the night Voldemort returned."
    }
  ]
}