{
  "entities": [
    {
      "name": "professor grubbly-plank",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Grubbly-Plank is introduced as the temporary Care of Magical Creatures teacher. She has closely cropped gray hair and a prominent chin."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid's absence is mentioned, with Professor Grubbly-Plank stating that he is indisposed."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is introduced as one of the students who is struggling through the snow to reach Professor Grubbly-Plank's front door."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is introduced as one of the students who is struggling through the snow to reach Professor Grubbly-Plank's front door. He asks where Hagrid is."
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Draco Malfoy and the rest of the Slytherins are introduced as they join the class, looking gleeful and unsurprised to see Professor Grubbly-Plank."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor grubbly-plank",
      "entity_2": "hagrid",
      "relationship_type": "teaches",
      "description": "Professor Grubbly-Plank is the temporary Care of Magical Creatures teacher, implying that she teaches Hagrid's class."
    },
    {
      "entity_1": "professor grubbly-plank",
      "entity_2": "ron weasley",
      "relationship_type": "teaches",
      "description": "Professor Grubbly-Plank is teaching Ron Weasley and the rest of the students in her class."
    },
    {
      "entity_1": "professor grubbly-plank",
      "entity_2": "harry potter",
      "relationship_type": "teaches",
      "description": "Professor Grubbly-Plank is teaching Harry Potter and the rest of the students in her class."
    },
    {
      "entity_1": "professor grubbly-plank",
      "entity_2": "draco malfoy",
      "relationship_type": "teaches",
      "description": "Professor Grubbly-Plank is teaching Draco Malfoy and the rest of the Slytherins in her class."
    }
  ]
}