{
  "entities": [
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is a teacher at Hogwarts and is mentioned as being present in the hospital wing. She is yelling at Harry for bringing something inside the castle."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is the headmaster of Hogwarts and is mentioned as coming into the hospital wing. He is looking for information about what has happened."
    },
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is a minister who comes into the hospital wing with Professor McGonagall and Snape. He is demanding to know where Dumbledore is."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is a teacher at Hogwarts and is mentioned as being present in the hospital wing with Fudge and Professor McGonagall."
    },
    {
      "name": "barty crouch",
      "entity_type": "person",
      "singular": true,
      "description": "Barty Crouch is a person who is being guarded by Professor McGonagall. Dumbledore mentions that there is no need to stand guard over him anymore."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character and is lying in bed in the hospital wing. He hears the door open and sees people coming in."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "barty crouch",
      "relationship_type": "guarding",
      "description": "Dumbledore mentions that he asked Professor McGonagall to stand guard over Barty Crouch."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "dumbledore",
      "relationship_type": "disobedience",
      "description": "Professor McGonagall is being scolded by Dumbledore for not following his instructions and standing guard over Barty Crouch."
    }
  ]
}