{
  "entities": [
    {
      "name": "yule ball",
      "entity_type": "event",
      "singular": true,
      "description": "The Yule Ball is mentioned as an event where Harry and Ron attended. It is described as a social gathering where students from Hogwarts and Durmstrang interacted."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as the main character who attended the Yule Ball. He was happy to go to bed after the event, indicating that he did not enjoy it."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is mentioned as Harry's friend who attended the Yule Ball. He seemed bad-tempered and continued to climb the stairs after Cedric spoke to Harry."
    },
    {
      "name": "hermione granger",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione Granger is mentioned as a student who said goodnight to Krum before going up the staircase. She gave Ron a cold look and did not speak to him."
    },
    {
      "name": "krum",
      "entity_type": "person",
      "singular": true,
      "description": "Krum is mentioned as a Durmstrang student who was saying goodnight to Hermione before going back to his ship."
    },
    {
      "name": "durmstrang ship",
      "entity_type": "location",
      "singular": false,
      "description": "The Durmstrang ship is mentioned as the vessel that Krum returned to after saying goodnight to Hermione."
    },
    {
      "name": "cedric diggory",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric Diggory is mentioned as a student who called out to Harry on the staircase. He seemed hesitant to speak in front of Ron and lowered his voice when speaking to Harry."
    },
    {
      "name": "cho chang",
      "entity_type": "person",
      "singular": true,
      "description": "Cho Chang is mentioned as a student who was waiting for Harry in the entrance hall below. She is not described further in this passage."
    },
    {
      "name": "golden egg",
      "entity_type": "object",
      "singular": true,
      "description": "The golden egg is mentioned as an object that Cedric asked Harry about. It seems to be related to a task or challenge that the students are working on."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "yule ball",
      "relationship_type": "attended",
      "description": "Harry Potter attended the Yule Ball, as mentioned in the passage. He was happy to go to bed after the event."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "yule ball",
      "relationship_type": "attended",
      "description": "Ron Weasley also attended the Yule Ball, as mentioned in the passage. He seemed bad-tempered and continued to climb the stairs after Cedric spoke to Harry."
    },
    {
      "entity_1": "hermione granger",
      "entity_2": "krum",
      "relationship_type": "said_goodnight_to",
      "description": "Hermione Granger said goodnight to Krum before going up the staircase, as mentioned in the passage."
    },
    {
      "entity_1": "cedric diggory",
      "entity_2": "harry potter",
      "relationship_type": "spoke_to",
      "description": "Cedric Diggory spoke to Harry on the staircase, as mentioned in the passage. He seemed hesitant to speak in front of Ron and lowered his voice when speaking to Harry."
    },
    {
      "entity_1": "cedric diggory",
      "entity_2": "golden egg",
      "relationship_type": "asked_about",
      "description": "Cedric Diggory asked Harry about the golden egg, as mentioned in the passage. It seems to be related to a task or challenge that the students are working on."
    }
  ]
}