{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a person who is speaking to his uncle, Uncle Vernon. He is described as wearing clothes provided by Petunia and his uncle, but he mentions that they were previously worn by Dudley."
    },
    {
      "name": "uncle vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Uncle Vernon is mentioned as a person who is reacting with anger to Harry's mention of 'owl post'. He is described as looking outraged and shooting nervous glances through the window."
    },
    {
      "name": "petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Petunia is mentioned as a person who, along with her husband Uncle Vernon, has provided clothes for Harry to wear. She is not described in detail but is mentioned as someone who is involved in the household."
    },
    {
      "name": "dudley",
      "entity_type": "person",
      "singular": true,
      "description": "Dudley is mentioned as a person who previously wore the clothes that Harry is now wearing. He is not described in detail but is mentioned as someone who is part of the household."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "uncle vernon",
      "relationship_type": "angrily_reacts_to",
      "description": "Uncle Vernon reacts with anger to Harry's mention of 'owl post'. This is described in the text as Uncle Vernon looking outraged and shooting nervous glances through the window."
    },
    {
      "entity_1": "harry",
      "entity_2": "petunia",
      "relationship_type": "wears_clothes_provided_by",
      "description": "Harry is wearing clothes provided by Petunia. This is described in the text as Harry mentioning that he was given clothes to wear by his aunt and uncle."
    },
    {
      "entity_1": "harry",
      "entity_2": "dudley",
      "relationship_type": "previously_wore_clothes_of",
      "description": "Harry is wearing clothes previously worn by Dudley. This is described in the text as Harry mentioning that he was given clothes to wear by his aunt and uncle, but they were previously worn by Dudley."
    }
  ]
}