{
  "entities": [
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is a person who is giving instructions to the champions. She is described as saying 'We are going to be patrolling the outside of the maze'."
    },
    {
      "name": "champions",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "The champions are a group of people who are being addressed by Professor McGonagall. They are described as nodding in response to her instructions."
    },
    {
      "name": "bagman",
      "entity_type": "person",
      "singular": true,
      "description": "Bagman is a person who is giving encouragement and instructions to the four patrollers. He is described as saying 'Off you go, then!'"
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a person who is wishing Harry good luck. He is described as whispering 'Good luck, Harry'."
    },
    {
      "name": "four patrollers",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "The four patrollers are a group of people who are being sent to station themselves around the maze. They are described as walking away in different directions."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who is being wished good luck by Hagrid. He is not explicitly mentioned as doing anything else in this passage."
    },
    {
      "name": "maze",
      "entity_type": "location",
      "singular": true,
      "description": "The maze is a location where the champions will be patrolling and where the four patrollers will be stationed."
    },
    {
      "name": "stands",
      "entity_type": "location",
      "singular": true,
      "description": "The stands are a location where Bagman's voice can be heard. They are described as being filled with people who are listening to his announcement."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "champions",
      "relationship_type": "addressed_by",
      "description": "Professor McGonagall is addressing the champions, giving them instructions on how to patrol the maze."
    },
    {
      "entity_1": "bagman",
      "entity_2": "four patrollers",
      "relationship_type": "sent_to_task",
      "description": "Bagman is sending the four patrollers to station themselves around the maze."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "harry",
      "relationship_type": "wished_good_luck_by",
      "description": "Hagrid is wishing Harry good luck as he sends him off to patrol the maze."
    }
  ]
}