{
  "entities": [
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "One of the participants in the competition, described as 'he' and 'him'. The text mentions Harry's reactions to the events unfolding."
    },
    {
      "name": "Cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Another participant in the competition, who has successfully captured the golden egg. The text describes Cedric's achievement as 'very good indeed'."
    },
    {
      "name": "Bagman",
      "entity_type": "person",
      "singular": true,
      "description": "A judge or official in the competition, described as shouting and giving instructions to the participants."
    },
    {
      "name": "Miss Delacour",
      "entity_type": "person",
      "singular": true,
      "description": "A participant in the competition, who is about to take her turn. The text describes Fleur's trembling and her determination to perform well."
    },
    {
      "name": "Fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Another name for Miss Delacour, used by Harry when describing her actions."
    },
    {
      "name": "Krum",
      "entity_type": "person",
      "singular": true,
      "description": "A participant in the competition, who is left alone with Harry after Fleur's turn. The text describes Krum as someone Harry and he are avoiding each other's gaze."
    },
    {
      "name": "dragon",
      "entity_type": "animal",
      "singular": true,
      "description": "An obstacle that Cedric has overcome to capture the golden egg."
    },
    {
      "name": "golden egg",
      "entity_type": "object",
      "singular": true,
      "description": "The object of the competition, which is being captured by the participants. The text describes it as something that can be 'gotten past' and 'captured'."
    }
  ],
  "relationships": [
    {
      "entity_1": "Cedric",
      "entity_2": "golden egg",
      "relationship_type": "capture",
      "description": "The text states that Cedric has gotten past his dragon and captured the golden egg."
    },
    {
      "entity_1": "Bagman",
      "entity_2": "judges",
      "relationship_type": "communication",
      "description": "The text describes Bagman as shouting to the judges, who are holding up marks for the participants."
    }
  ]
}