{
  "entities": [
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is introduced as the head of Harry's haddock and is described as having an angry look. She is also mentioned as ignoring Lavender Brown and Parvati Patil when they giggle."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as the owner of the haddock that Ron's parrot severs. He is also mentioned as being told off by Professor McGonagall along with Ron."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is introduced as having a parrot that severs the head of Harry's haddock. He is also mentioned as being told off by Professor McGonagall along with Harry."
    },
    {
      "name": "lavender brown",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender Brown is introduced as giggling at the mention of the Yule Ball. She is also mentioned as being nudged by Parvati Patil."
    },
    {
      "name": "parvati patil",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati Patil is introduced as nudging Lavender Brown and fighting not to giggle at the mention of the Yule Ball."
    },
    {
      "name": "yule ball",
      "entity_type": "event",
      "singular": true,
      "description": "The Yule Ball is introduced as a traditional part of the Tri-wizard Tournament and an opportunity for students to socialize with their foreign guests."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "harry",
      "relationship_type": "told_off",
      "description": "Professor McGonagall tells off Harry along with Ron for their behavior."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "ron",
      "relationship_type": "told_off",
      "description": "Professor McGonagall tells off Ron along with Harry for their behavior."
    },
    {
      "entity_1": "parvati patil",
      "entity_2": "lavender brown",
      "relationship_type": "nudged",
      "description": "Parvati Patil nudges Lavender Brown to stop her from giggling."
    }
  ]
}