{
  "entities": [
    {
      "name": "wormtail",
      "entity_type": "person",
      "singular": true,
      "description": "Wormtail is a person mentioned in the text as having a mark on his arm. The text states that Voldemort pressed his fingers to Wormtail's mark, causing pain and a change in color."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is a person mentioned in the text as having red gleaming eyes. He is described as removing his fingers from Wormtail's mark and causing it to turn jet black."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person mentioned in the text as having a scar on his forehead. The text states that when Voldemort pressed his fingers to Wormtail's mark, Harry felt pain and saw the mark change color."
    }
  ],
  "relationships": [
    {
      "entity_1": "voldemort",
      "entity_2": "wormtail",
      "relationship_type": "causes_pain",
      "description": "Voldemort causes Wormtail to feel pain when he presses his fingers to Wormtail's mark. This is described in the text as 'The scar on Harry's forehead seared with a sharp pain again'."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "wormtail",
      "relationship_type": "causes_color_change",
      "description": "Voldemort causes Wormtail's mark to change color when he presses his fingers to it. This is described in the text as 'Harry saw that it had turned jet black'."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "harry",
      "relationship_type": "causes_pain",
      "description": "Voldemort causes Harry to feel pain when he presses his fingers to Wormtail's mark. This is described in the text as 'The scar on Harry's forehead seared with a sharp pain again'."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "harry",
      "relationship_type": "causes_emotional_response",
      "description": "Voldemort causes Harry to feel emotional distress when he presses his fingers to Wormtail's mark. This is described in the text as 'Harry saw that it had turned jet black'."
    }
  ]
}