{
  "entities": [
    {
      "name": "Professor Binns",
      "entity_type": "professor",
      "singular": true,
      "description": "The ghost who taught History of Magic. He is mentioned as assigning weekly essays on the goblin rebellions of the eighteenth century."
    },
    {
      "name": "Professor Snape",
      "entity_type": "professor",
      "singular": true,
      "description": "He is forcing students to research antidotes, hinting that he might be poisoning one of them before Christmas to see if their antidote worked."
    },
    {
      "name": "Professor Flitwick",
      "entity_type": "professor",
      "singular": true,
      "description": "He asked students to read three extra books in preparation for their lesson on Summoning Charms."
    },
    {
      "name": "Hagrid",
      "entity_type": "gamekeeper",
      "singular": true,
      "description": "He is adding to the workload of students, delighted with the growth of Blast-Ended Skrewts and suggesting that they come down to his hut as part of their project."
    },
    {
      "name": "Blast-Ended Skrewts",
      "entity_type": "creature",
      "singular": false,
      "description": "They are growing at a remarkable pace, but nobody has yet discovered what they eat."
    }
  ],
  "relationships": [
    {
      "entity_1": "Professor Binns",
      "entity_2": "goblin rebellions of the eighteenth century",
      "relationship_type": "taught_about",
      "description": "Professor Binns taught students about the goblin rebellions of the eighteenth century."
    },
    {
      "entity_1": "Professor Snape",
      "entity_2": "antidotes",
      "relationship_type": "forcing_to_research",
      "description": "Professor Snape is forcing students to research antidotes, hinting that he might be poisoning one of them before Christmas to see if their antidote worked."
    },
    {
      "entity_1": "Professor Flitwick",
      "entity_2": "Summoning Charms",
      "relationship_type": "assigning_reading_material",
      "description": "Professor Flitwick asked students to read three extra books in preparation for their lesson on Summoning Charms."
    },
    {
      "entity_1": "Hagrid",
      "entity_2": "Blast-Ended Skrewts",
      "relationship_type": "monitoring_growth",
      "description": "Hagrid is delighted with the growth of Blast-Ended Skrewts and suggested that students come down to his hut as part of their project."
    }
  ]
}