{
  "entities": [
    {
      "name": "mad-eye moody",
      "entity_type": "person",
      "singular": true,
      "description": "Mentioned as the one who will benefit from the collected pus. (\"This'll keep Madam Pomfrey happy\")"
    },
    {
      "name": "professor sprout",
      "entity_type": "person",
      "singular": true,
      "description": "The teacher who is instructing the students on how to collect bubotuber pus. (\"Pus, Finnigan, pus,\" said Professor Sprout)"
    },
    {
      "name": "seamus finnigan",
      "entity_type": "person",
      "singular": true,
      "description": "A student who is revolted by the task of collecting bubotuber pus. (\"The what?\" said Seamus Finnig an, sounding revolted.)"
    },
    {
      "name": "madam pomfrey",
      "entity_type": "person",
      "singular": true,
      "description": "Mentioned as someone who will benefit from the collected pus. (\"This'll keep Madam Pomfrey happy\")"
    },
    {
      "name": "hannah abbott",
      "entity_type": "person",
      "singular": true,
      "description": "A Hufflepuff student who mentions Eloise Midgeon. (\"Like poor Eloise Mi dgen,\" said Hannah Abbott)"
    },
    {
      "name": "eloise midegon",
      "entity_type": "person",
      "singular": true,
      "description": "Mentioned as someone who has resorted to desperate measures to get rid of pimples. (\"Like poor Eloise Mi dgen\")"
    },
    {
      "name": "bubotuber pus",
      "entity_type": "substance",
      "singular": false,
      "description": "A valuable substance that is collected from the bubotubers. (\"Pus, Finnigan, pus,\" said Professor Sprout, \"and it's extremely valuable, so don't waste it.)"
    }
  ],
  "relationships": [
    {
      "entity_1": "madam pomfrey",
      "entity_2": "bubotuber pus",
      "relationship_type": "benefits_from",
      "description": "Madam Pomfrey will benefit from the collected bubotuber pus. (\"This'll keep Madam Pomfrey happy\")"
    },
    {
      "entity_1": "professor sprout",
      "entity_2": "bubotuber pus",
      "relationship_type": "teaches_about",
      "description": "Professor Sprout is teaching about bubotuber pus and how to collect it. (\"Pus, Finnigan, pus,\" said Professor Sprout)"
    },
    {
      "entity_1": "seamus finnigan",
      "entity_2": "bubotuber pus",
      "relationship_type": "is_disgusted_by",
      "description": "Seamus Finnigan is revolted by the task of collecting bubotuber pus. (\"The what?\" said Seamus Finnig an, sounding revolted.)"
    },
    {
      "entity_1": "hannah abbott",
      "entity_2": "eloise midegon",
      "relationship_type": "mentions",
      "description": "Hannah Abbott mentions Eloise Midgeon in the context of desperate measures to get rid of pimples. (\"Like poor Eloise Mi dgen\")"
    }
  ]
}