{
  "entities": [
    {
      "name": "rita skeeter",
      "entity_type": "person",
      "singular": true,
      "description": "Rita Skeeter is introduced as the one who is speaking to Harry. She is described as perching herself precariously upon an upturned bucket and pushing Harry down onto a cardbo ard box (\"Come along, dear — that’s right — lovely,\" said Rita Skeeter again...)."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as the one who is being spoken to by Rita Skeeter. He is described as being pushed down onto a cardbo ard box (\"Come along, dear — that’s right — lovely,\" said Rita Skeeter again...)."
    },
    {
      "name": "crocodile-skin handbag",
      "entity_type": "object",
      "singular": true,
      "description": "Rita Skeeter's crocodile-skin handbag is introduced as the one from which she pulls out a handful of candles (\"She unsnapped her crocodile-skin handbag and pulled out a handful of candles...\".)"
    },
    {
      "name": "candles",
      "entity_type": "object",
      "singular": false,
      "description": "Rita Skeeter pulls out a handful of candles from her crocodile-skin handbag (\"She unsnapped her crocodile-skin handbag and pulled out a handful of candles...\".)"
    },
    {
      "name": "quick-quotes quill",
      "entity_type": "object",
      "singular": true,
      "description": "Rita Skeeter mentions using a Quick-Quotes Quill to leave her free to talk to Harry normally (\"You won’t mind, Harry, if I use a Quick-Quotes Quill? It leaves me free to talk to you normally. . . .\")."
    },
    {
      "name": "parc hment",
      "entity_type": "object",
      "singular": true,
      "description": "Rita Skeeter pulls out a roll of parc hment from her crocodile-skin handbag (\"She reached again into her crocodile bag and drew out a long acid-green quill and a roll of parc hment...\".)"
    },
    {
      "name": "crate",
      "entity_type": "object",
      "singular": true,
      "description": "Rita Skeeter stretches the parc hment between them on a crate (\"She stretched out the parc hment between them on a crate of Mrs.  Skower’s All-Purpose Magical Mess Remover...\".)"
    },
    {
      "name": "mrs. skower's all-purpose magical mess remover",
      "entity_type": "object",
      "singular": true,
      "description": "A crate of Mrs.  Skower’s All-Purpose Magical Mess Remover is mentioned as the one on which Rita Skeeter stretches the parc hment (\"She stretched out the parc hment between them on a crate of Mrs.  Skower’s All-Purpose Magical Mess Remover...\".)"
    },
    {
      "name": "wands",
      "entity_type": "object",
      "singular": false,
      "description": "Rita Skeeter uses her wand to light the candles (\"She lit with a wave of her wand and magicked into midair...\".)"
    },
    {
      "name": "gold teeth",
      "entity_type": "attribute",
      "singular": true,
      "description": "Harry counts three gold teeth on Rita Skeeter's smile (\"Rita Skeeter’s smile widened. Harry counted thre e gold teeth.\")."
    }
  ],
  "relationships": [
    {
      "entity_1": "rita skeeter",
      "entity_2": "harry",
      "relationship_type": "speaks_to",
      "description": "Rita Skeeter speaks to Harry (\"Come along, dear — that’s right — lovely,\" said Rita Skeeter again...)."
    },
    {
      "entity_1": "rita skeeter",
      "entity_2": "quick-quotes quill",
      "relationship_type": "uses",
      "description": "Rita Skeeter mentions using a Quick-Quotes Quill (\"You won’t mind, Harry, if I use a Quick-Quotes Quill? It leaves me free to talk to you normally. . . .\")."
    },
    {
      "entity_1": "rita skeeter",
      "entity_2": "candles",
      "relationship_type": "pulls_out",
      "description": "Rita Skeeter pulls out candles from her crocodile-skin handbag (\"She unsnapped her crocodile-skin handbag and pulled out a handful of candles...\".)"
    },
    {
      "entity_1": "rita skeeter",
      "entity_2": "parc hment",
      "relationship_type": "pulls_out",
      "description": "Rita Skeeter pulls out parc hment from her crocodile-skin handbag (\"She reached again into her crocodile bag and drew out a long acid-green quill and a roll of parc hment...\".)"
    },
    {
      "entity_1": "rita skeeter",
      "entity_2": "crate",
      "relationship_type": "stretches_parc_hment_on",
      "description": "Rita Skeeter stretches the parc hment between them on a crate (\"She stretched out the parc hment between them on a crate of Mrs.  Skower’s All-Purpose Magical Mess Remover...\".)"
    },
    {
      "entity_1": "rita skeeter",
      "entity_2": "wands",
      "relationship_type": "uses",
      "description": "Rita Skeeter uses her wand to light the candles (\"She lit with a wave of her wand and magicked into midair...\".)"
    },
    {
      "entity_1": "harry",
      "entity_2": "gold teeth",
      "relationship_type": "counts",
      "description": "Harry counts three gold teeth on Rita Skeeter's smile (\"Rita Skeeter’s smile widened. Harry counted thre e gold teeth.\")."
    }
  ]
}