{
  "entities": [
    {
      "name": "yule ball",
      "entity_type": "event",
      "singular": true,
      "description": "The Yule Ball is mentioned as the main event of the tournament, where students are supposed to get to know foreign wizards and make friends with them."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a student who is participating in the Yule Ball. She is mentioned as being hot-tempered and having a problem with Ron's behavior."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a student who is also participating in the Yule Ball. He is mentioned as being competitive and ignoring Harry's attempts to reason with him."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a student who is participating in the Yule Ball. He is mentioned as trying to reason with Ron and calm him down."
    },
    {
      "name": "krum",
      "entity_type": "person",
      "singular": true,
      "description": "Krum is a foreign wizard who is participating in the Yule Ball. Hermione is mentioned as going with him, which causes tension between her and Ron."
    },
    {
      "name": "vicky",
      "entity_type": "person",
      "singular": true,
      "description": "Vicky is another name for Viktor Krum, a foreign wizard participating in the Yule Ball. Ron is scolded by Hermione for calling him Vicky instead of his proper name."
    },
    {
      "name": "padma",
      "entity_type": "person",
      "singular": true,
      "description": "Padma is a student who is participating in the Yule Ball. She asks Ron to dance, but he refuses and gets angry with Hermione instead."
    },
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is a student who is participating in the Yule Ball. She joins Padma and the Beauxbatons boy, along with another friend conjured up by him."
    },
    {
      "name": "beauxbatons boy",
      "entity_type": "person",
      "singular": true,
      "description": "The Beauxbatons boy is a foreign wizard participating in the Yule Ball. He conjures up one of his friends to join Parvati and Padma."
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "krum",
      "relationship_type": "accompanies",
      "description": "Hermione is going with Krum at the Yule Ball, which causes tension between her and Ron."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "conflict",
      "description": "Ron is in conflict with Hermione due to her decision to go with Krum at the Yule Ball."
    },
    {
      "entity_1": "padma",
      "entity_2": "ron",
      "relationship_type": "asks_to_dance",
      "description": "Padma asks Ron to dance, but he refuses and gets angry with Hermione instead."
    }
  ]
}