{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is one of the main characters in the story, a student at Hogwarts. He is mentioned as setting off to find seats on the train with Ron and Hermione."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is another main character in the story, a student at Hogwarts. He is mentioned as setting off to find seats on the train with Harry and Hermione."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is another main character in the story, a student at Hogwarts. She is mentioned as setting off to find seats on the train with Harry and Ron."
    },
    {
      "name": "pigwidgeon",
      "entity_type": "animal",
      "singular": true,
      "description": "Pigwidgeon is a pet owl of one of the characters, but it's not specified which character. It is mentioned as becoming noisier in response to the hooting of many owls through the mist."
    },
    {
      "name": "charlie",
      "entity_type": "person",
      "singular": true,
      "description": "Charlie is a member of the Weasley family and is mentioned as saying goodbye to Ginny. He hints that he might be seeing his friends sooner than they think, but doesn't explain why."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is a member of the Weasley family and is mentioned as asking Charlie why he thinks he might be seeing his friends sooner than they think."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is a member of the Weasley family and is mentioned as someone that Charlie doesn't want to tell about his classified information."
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is a member of the Weasley family and is mentioned as saying goodbye to Harry, Ron, and Hermione on the platform."
    },
    {
      "name": "mrs. weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is a member of the Weasley family and is mentioned as saying goodbye to Harry, Ron, and Hermione on the platform."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is a member of the Weasley family and is mentioned as being hugged goodbye by Charlie."
    }
  ],
  "relationships": [
    {
      "entity_1": "charlie",
      "entity_2": "ginny",
      "relationship_type": "hugged",
      "description": "Charlie hugs Ginny goodbye before leaving the platform."
    },
    {
      "entity_1": "charlie",
      "entity_2": "fred",
      "relationship_type": "mentioned_to",
      "description": "Charlie mentions to Fred that he might be seeing his friends sooner than they think, but doesn't explain why."
    }
  ]
}