{
  "entities": [
    {
      "name": "triwizard tournament",
      "entity_type": "event",
      "singular": true,
      "description": "The Triwizard Tournament is mentioned in the text as an event, but it's not clear what year or details about it. It's only mentioned in the title of the section."
    },
    {
      "name": "slytherin",
      "entity_type": "house",
      "singular": true,
      "description": "Slytherin is one of the four houses at Hogwarts School, described as 'shrewd' and valuing ambition. It's mentioned in the text that it loved those of great ambition."
    },
    {
      "name": "gryffindor",
      "entity_type": "house",
      "singular": true,
      "description": "Gryffindor is one of the four houses at Hogwarts School, described as valuing bravery. It's mentioned in the text that it prized the bravest students far beyond the rest."
    },
    {
      "name": "ravenclaw",
      "entity_type": "house",
      "singular": true,
      "description": "Ravenclaw is one of the four houses at Hogwarts School, described as valuing cleverness. It's mentioned in the text that it would always be the best for those who were the cleverest."
    },
    {
      "name": "hufflepuff",
      "entity_type": "house",
      "singular": true,
      "description": "Hufflepuff is one of the four houses at Hogwarts School, described as valuing hard work. It's mentioned in the text that it would be most worthy of admission for those who were hard workers."
    },
    {
      "name": "hogwarts school",
      "entity_type": "school",
      "singular": true,
      "description": "Hogwarts School is mentioned in the text as being founded by the four founders. It's described as a place where young sorcerers are educated."
    }
  ],
  "relationships": [
    {
      "entity_1": "gryffindor",
      "entity_2": "triwizard tournament",
      "relationship_type": "associated_with",
      "description": "Gryffindor is associated with the Triwizard Tournament, as it's mentioned that Gryffindor found a way to pick the worthy students for the tournament."
    },
    {
      "entity_1": "slytherin",
      "entity_2": "hogwarts school",
      "relationship_type": "founded",
      "description": "Slytherin was one of the four founders of Hogwarts School, as mentioned in the text."
    },
    {
      "entity_1": "gryffindor",
      "entity_2": "hogwarts school",
      "relationship_type": "founded",
      "description": "Gryffindor was one of the four founders of Hogwarts School, as mentioned in the text."
    },
    {
      "entity_1": "ravenclaw",
      "entity_2": "hogwarts school",
      "relationship_type": "founded",
      "description": "Ravenclaw was one of the four founders of Hogwarts School, as mentioned in the text."
    },
    {
      "entity_1": "hufflepuff",
      "entity_2": "hogwarts school",
      "relationship_type": "founded",
      "description": "Hufflepuff was one of the four founders of Hogwarts School, as mentioned in the text."
    }
  ]
}