{
  "entities": [
    {
      "name": "padfoot",
      "entity_type": "character",
      "singular": true,
      "description": "The final lesson of the afternoon is taught by Padfoot, also known as Sirius Black. ( 511 )"
    },
    {
      "name": "malfoy",
      "entity_type": "character",
      "singular": true,
      "description": "Malfoy is standing outside the classroom door with Crabbe and Goyle. (Malfoy, Crabbe, and Goyle were standing in a huddle outside the classroom door)"
    },
    {
      "name": "crabbe",
      "entity_type": "character",
      "singular": true,
      "description": "Crabbe is standing outside the classroom door with Malfoy and Goyle. (Malfoy, Crabbe, and Goyle were standing in a huddle outside the classroom door)"
    },
    {
      "name": "goyle",
      "entity_type": "character",
      "singular": true,
      "description": "Goyle is standing outside the classroom door with Malfoy and Crabbe. (Malfoy, Crabbe, and Goyle were standing in a huddle outside the classroom door)"
    },
    {
      "name": "pansy parkinson",
      "entity_type": "character",
      "singular": true,
      "description": "Pansy is standing outside the classroom door with her gang of Slytherin girls. (Malfoy, Crabbe, and Goyle were standing in a huddle outside the classroom door with Pansy Parkin son’s gang of Sl ytherin girls)"
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is approaching the classroom door with Ron and Hermione. (Pansy’s pug-like face peer ed excitedly around Goyle’s broad back as Harry, Ron, and Hermione approached)"
    },
    {
      "name": "ron",
      "entity_type": "character",
      "singular": true,
      "description": "Ron is approaching the classroom door with Harry and Hermione. (Pansy’s pug-like face peer ed excitedly around Goyle’s broad back as Harry, Ron, and Hermione approached)"
    },
    {
      "name": "hermione",
      "entity_type": "character",
      "singular": true,
      "description": "Hermione is approaching the classroom door with Harry and Ron. (Pansy’s pug-like face peer ed excitedly around Goyle’s broad back as Harry, Ron, and Hermione approached)"
    },
    {
      "name": "witch weekly",
      "entity_type": "magazine",
      "singular": true,
      "description": "The magazine is being held by Pansy. (Harry saw that Pansy had a magazine in her hands — Witch Weekly)"
    }
  ],
  "relationships": [
    {
      "entity_1": "pansy parkinson",
      "entity_2": "witch weekly",
      "relationship_type": "holding",
      "description": "Pansy is holding the Witch Weekly magazine. (Harry saw that Pansy had a magazine in her hands — Witch Weekly)"
    },
    {
      "entity_1": "pansy parkinson",
      "entity_2": "malfoy",
      "relationship_type": "standing_with",
      "description": "Pansy is standing with Malfoy outside the classroom door. (Malfoy, Crabbe, and Goyle were standing in a huddle outside the classroom door with Pansy Parkin son’s gang of Sl ytherin girls)"
    },
    {
      "entity_1": "pansy parkinson",
      "entity_2": "crabbe",
      "relationship_type": "standing_with",
      "description": "Pansy is standing with Crabbe outside the classroom door. (Malfoy, Crabbe, and Goyle were standing in a huddle outside the classroom door with Pansy Parkin son’s gang of Sl ytherin girls)"
    },
    {
      "entity_1": "pansy parkinson",
      "entity_2": "goyle",
      "relationship_type": "standing_with",
      "description": "Pansy is standing with Goyle outside the classroom door. (Malfoy, Crabbe, and Goyle were standing in a huddle outside the classroom door with Pansy Parkin son’s gang of Sl ytherin girls)"
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "approaching_with",
      "description": "Harry is approaching the classroom door with Ron. (Pansy’s pug-like face peer ed excitedly around Goyle’s broad back as Harry, Ron, and Hermione approached)"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "approaching_with",
      "description": "Harry is approaching the classroom door with Hermione. (Pansy’s pug-like face peer ed excitedly around Goyle’s broad back as Harry, Ron, and Hermione approached)"
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "approaching_with",
      "description": "Ron is approaching the classroom door with Hermione. (Pansy’s pug-like face peer ed excitedly around Goyle’s broad back as Harry, Ron, and Hermione approached)"
    }
  ]
}