{
  "entities": [
    {
      "name": "goblins",
      "entity_type": "group_of_beings",
      "singular": false,
      "description": "The goblins are described as watching Harry and Bagman in silence through their dark, slanting eyes. They are also mentioned to be speaking in a language called Gobbledegook."
    },
    {
      "name": "bagma n",
      "entity_type": "person",
      "singular": true,
      "description": "Bagman is described as noticing Harry watching the goblins and making a comment about their English not being good. He also mentions that he knows one word of Gobbledegook, which means 'pickax'."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as watching the goblins and noticing how they are still watching Bagman very closely. He also asks Bagman what the goblins want."
    },
    {
      "name": "barry crouch",
      "entity_type": "person",
      "singular": true,
      "description": "Barry Crouch is mentioned by Bagman as being the person that the goblins are looking for."
    },
    {
      "name": "quidditch world cup",
      "entity_type": "event",
      "singular": false,
      "description": "The Quid-ditch World Cup is mentioned by Bagman as a comparison to the current situation with the goblins."
    },
    {
      "name": "ministry in london",
      "entity_type": "location",
      "singular": true,
      "description": "The Ministry in London is mentioned by Harry as being where Barry Crouch is currently located."
    }
  ],
  "relationships": [
    {
      "entity_1": "goblins",
      "entity_2": "bagma n",
      "relationship_type": "watching",
      "description": "The goblins are watching Bagman very closely, as described in the text: 'how the goblins were still watching Bagman very closely'."
    },
    {
      "entity_1": "bagma n",
      "entity_2": "goblins",
      "relationship_type": "speaking_to",
      "description": "Bagman is speaking to the goblins, as described in the text: 'said Bagman, noticing Harry watching the goblins too.'"
    },
    {
      "entity_1": "harry",
      "entity_2": "bagma n",
      "relationship_type": "asking",
      "description": "Harry is asking Bagman what the goblins want, as described in the text: '“What do they want?” Harry said, noticing how the goblins were still watching Bagman very closely.'"
    },
    {
      "entity_1": "goblins",
      "entity_2": "barry crouch",
      "relationship_type": "looking_for",
      "description": "The goblins are looking for Barry Crouch, as described in the text: 'They . . . er . . . they’re looking for Barry Crouch.'"
    }
  ]
}