{
  "entities": [
    {
      "name": "dobby",
      "entity_type": "character",
      "singular": true,
      "description": "Dobby is a house-elf who will be missed by Harry Potter. He says goodbye to Harry as he leaves the Great Hall."
    },
    {
      "name": "harry potter",
      "entity_type": "character",
      "singular": true,
      "description": "Harry Potter is a student at Hogwarts School of Witchcraft and Wizardry who is participating in the second task. He is running towards the judges to complete his task."
    },
    {
      "name": "colin creevey",
      "entity_type": "character",
      "singular": true,
      "description": "Colin Creevey is a student at Hogwarts School of Witchcraft and Wizardry who is watching Harry Potter's second task. He gets sent flying by Harry as he runs past."
    },
    {
      "name": "denis creevey",
      "entity_type": "character",
      "singular": true,
      "description": "Denis Creevey is a student at Hogwarts School of Witchcraft and Wizardry who is watching Harry Potter's second task. He gets sent flying by Harry as he runs past."
    },
    {
      "name": "great hall",
      "entity_type": "location",
      "singular": true,
      "description": "The Great Hall is a large dining hall at Hogwarts School of Witchcraft and Wizardry where students have breakfast before the second task."
    },
    {
      "name": "second task",
      "entity_type": "event",
      "singular": true,
      "description": "The second task is an event in which Harry Potter must complete a challenge to progress in the Triwizard Tournament."
    },
    {
      "name": "dragons' enclosure",
      "entity_type": "location",
      "singular": true,
      "description": "The dragons' enclosure is a location where dragons are kept. It was previously surrounded by seats, but now they are on the opposite bank of the lake."
    },
    {
      "name": "lake",
      "entity_type": "location",
      "singular": true,
      "description": "The lake is a body of water at Hogwarts School of Witchcraft and Wizardry where students can watch the second task from the stands."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "dobby",
      "relationship_type": "said_goodbye_to",
      "description": "Harry Potter says goodbye to Dobby as he leaves the Great Hall."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "colin creevey",
      "relationship_type": "sent_flying_by",
      "description": "Harry Potter sends Colin Creevey flying as he runs past him in the corridor."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "denis creevey",
      "relationship_type": "sent_flying_by",
      "description": "Harry Potter sends Denis Creevey flying as he runs past him in the corridor."
    }
  ]
}