{
  "entities": [
    {
      "name": "mayhem",
      "entity_type": "event",
      "singular": true,
      "description": "Mayhem is mentioned as occurring at the Ministry. (\"MAYHEM AT THE MINISTRY\")"
    },
    {
      "name": "ministry",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is a government organization that is being criticized for its blunders and lax security. (\"Ministry blunders . . . culprits not apprehended  . . . lax security\")"
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill Weasley is a member of the Weasley family who hands his father the newspaper. (\"Bill handed his father the newspaper.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a member of the group who helps make tea for Mrs. Weasley. (\"When they were all crammed into the tiny kitchen, and Hermione had made Mrs. Weasley a cup of very strong tea\")"
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is a member of the group who receives tea from Hermione. (\"When they were all crammed into the tiny kitchen, and Hermione had made Mrs. Weasley a cup of very strong tea\")"
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is a member of the Weasley family who reads the newspaper and criticizes the Ministry. (\"Mr. Weasley scanned the front page while Percy looked over his shoulder.\")"
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy Weasley is a member of the Weasley family who looks over his father's shoulder and criticizes Rita Skeeter. (\"Percy furiously. . . . That woman’s got it in for the Ministry of Magic!\")"
    },
    {
      "name": "rita skeeter",
      "entity_type": "person",
      "singular": true,
      "description": "Rita Skeeter is a journalist who writes articles criticizing the Ministry. (\"Who wrote this? Ah . . . of course . . . Rita Skeeter.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "mr weasley",
      "entity_2": "ministry",
      "relationship_type": "criticizes",
      "description": "Mr. Weasley criticizes the Ministry for its blunders and lax security. (\"I knew it,” said Mr. Weasley heavily. “Ministry blunders . . . culprits not apprehended  . . . lax security\")"
    },
    {
      "entity_1": "percy",
      "entity_2": "rita skeeter",
      "relationship_type": "criticizes",
      "description": "Percy criticizes Rita Skeeter for her biased reporting. (\"That woman’s got it in for the Ministry of Magic!\")"
    }
  ]
}