{
  "entities": [
    {
      "name": "beauxbatons",
      "entity_type": "school",
      "singular": true,
      "description": "Beauxbatons is mentioned as one of the schools that Harry notices passing by in the ship's portholes. It is described as being built along the lines of Crabbe and Goyle, but later revealed to be wearing cloaks made of shaggy, matted fur."
    },
    {
      "name": "durmstrang",
      "entity_type": "school",
      "singular": true,
      "description": "Durmstrang is mentioned as one of the schools that Harry notices passing by in the ship's portholes. It is described as being built along the lines of Crabbe and Goyle, but later revealed to be wearing cloaks made of shaggy, matted fur."
    },
    {
      "name": "crabbe",
      "entity_type": "student",
      "singular": true,
      "description": "Crabbe is mentioned as one of the students that Harry notices passing by in the ship's portholes. He is described as being built along the lines of Durmstrang and Beauxbatons."
    },
    {
      "name": "goyle",
      "entity_type": "student",
      "singular": true,
      "description": "Goyle is mentioned as one of the students that Harry notices passing by in the ship's portholes. He is described as being built along the lines of Durmstrang and Beauxbatons."
    },
    {
      "name": "dumbledore",
      "entity_type": "teacher",
      "singular": true,
      "description": "Dumbledore is mentioned as one of the teachers at Hogwarts, greeted by Professor Karkaroff. He is described as being tall and thin with white hair."
    },
    {
      "name": "karkaroff",
      "entity_type": "teacher",
      "singular": true,
      "description": "Karkaroff is mentioned as one of the teachers at Hogwarts, greeting Dumbledore. He is described as being tall and thin like Dumbledore, but with short white hair and a goatee."
    }
  ],
  "relationships": [
    {
      "entity_1": "karkaroff",
      "entity_2": "dumbledore",
      "relationship_type": "greeted_by",
      "description": "Karkaroff greets Dumbledore as he walks up the slope to the castle."
    },
    {
      "entity_1": "crabbe",
      "entity_2": "durmstrang",
      "relationship_type": "part_of",
      "description": "Crabbe is part of Durmstrang, one of the schools that Harry notices passing by in the ship's portholes."
    },
    {
      "entity_1": "goyle",
      "entity_2": "durmstrang",
      "relationship_type": "part_of",
      "description": "Goyle is part of Durmstrang, one of the schools that Harry notices passing by in the ship's portholes."
    },
    {
      "entity_1": "beauxbatons",
      "entity_2": "karkaroff",
      "relationship_type": "led_by",
      "description": "Beauxbatons is led by Karkaroff, one of the teachers at Hogwarts."
    }
  ]
}