{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character of the story. He is described as getting dressed inattentively and trying to put his hat on his foot instead of his sock."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a friend of Harry's. She is eating breakfast with Ginny at the Gryffindor table in the Great Hall when Harry finds her."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is a friend of Harry's and Hermione's. She is eating breakfast with Hermione at the Gryffindor table in the Great Hall when Harry finds them."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is a character who has warned Harry about Karkaroff. He is mentioned as having said something to Harry, but his exact words are not specified."
    },
    {
      "name": "karkaroff",
      "entity_type": "person",
      "singular": true,
      "description": "Karkaroff is a character who has been warned about by Sirius. He is mentioned as being a problem that Harry and Hermione will worry about later."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry finds Hermione eating breakfast with Ginny at the Gryffindor table in the Great Hall and drags her out onto the grounds to talk about the dragons."
    },
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "advice",
      "description": "Harry talks to Hermione about something Sirius said, but it is not specified what exactly Sirius said."
    },
    {
      "entity_1": "hermione",
      "entity_2": "karkaroff",
      "relationship_type": "concern",
      "description": "Hermione is alarmed by Sirius's warnings about Karkaroff and thinks that the dragons are a more pressing problem."
    }
  ]
}