{
  "entities": [
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is described as the one who cast a spell on Hermione, making her teeth grow at an alarming rate. (\"Densaugeo!\" screamed Malfoy.)"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as the one who cast a spell on Goyle, hitting him in the face with his wand. (Jets of light shot from both wands, hit each other in midair, and ricocheted off at angles — Harry’s hit Goyle in the face...)"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as the one who was affected by Malfoy's spell, making her teeth grow at an alarming rate. (Hermione’s front teeth — already larger than average — were now growing at an alarming rate; she was looking more and more like a beaver...)"
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is described as the one who was hit in the face by Harry's wand. (Jets of light shot from both wands, hit each other in midair, and ricocheted off at angles — Harry’s hit Goyle in the face...)"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as the one who hurried forward to see what was wrong with Hermione. (‘Hermione!’ Ron had hurried forward to see what was wrong with her; Harry turned and saw Ron dragging Hermione’s hand away from her face.)"
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is described as the one who arrived on the scene, asking what all the noise was about. (‘And what is all this noise about?’ said a soft, deadly voice. Snape had arrived.)"
    }
  ],
  "relationships": [
    {
      "entity_1": "malfoy",
      "entity_2": "hermione",
      "relationship_type": "affected_by_spell",
      "description": "Malfoy cast a spell on Hermione, making her teeth grow at an alarming rate. (‘Densaugeo!’ screamed Malfoy.)"
    },
    {
      "entity_1": "harry",
      "entity_2": "goyle",
      "relationship_type": "hit_with_wand",
      "description": "Harry cast a spell on Goyle, hitting him in the face with his wand. (Jets of light shot from both wands, hit each other in midair, and ricocheted off at angles — Harry’s hit Goyle in the face...)"
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "helped",
      "description": "Ron hurried forward to see what was wrong with Hermione and dragged her hand away from her face. (‘Hermione!’ Ron had hurried forward to see what was wrong with her; Harry turned and saw Ron dragging Hermione’s hand away from her face.)"
    },
    {
      "entity_1": "snape",
      "entity_2": "scene",
      "relationship_type": "arrived_at",
      "description": "Snape arrived on the scene, asking what all the noise was about. (‘And what is all this noise about?’ said a soft, deadly voice. Snape had arrived.)"
    }
  ]
}