{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a person who has a scar on his forehead and is able to sense the presence of Lord Voldemort. He is also described as being sane despite having the scar."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as a person who has Stunned young Crouch and is defending Harry's sanity. He is also described as being able to see Voldemort come back."
    },
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is mentioned as a person who is stubborn and skeptical of Dumbledore's claims. He is also described as being visibly affronted when Harry mentions the names of Death Eaters."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is mentioned as a person who has come back and is causing harm to Harry. He is also described as being close by, which hurts Harry's scar."
    },
    {
      "name": "lucius malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Lucius Malfoy is mentioned as a person who has been cleared and is now working for the Ministry. He is also described as being part of an old family with donations to excellent causes."
    },
    {
      "name": "macnair",
      "entity_type": "person",
      "singular": true,
      "description": "Macnair is mentioned as a person who has been cleared and is now working for the Ministry. He is also described as being part of the Death Eaters."
    },
    {
      "name": "avery",
      "entity_type": "person",
      "singular": true,
      "description": "Avery is mentioned as a person who has been cleared and is now working for the Ministry. He is also described as being part of the Death Eaters."
    },
    {
      "name": "nott",
      "entity_type": "person",
      "singular": true,
      "description": "Nott is mentioned as a person who has been cleared and is now working for the Ministry. He is also described as being part of the Death Eaters."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is mentioned as a person who has been cleared and is now working for the Ministry. He is also described as being part of the Death Eaters."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is mentioned as a person who has been cleared and is now working for the Ministry. He is also described as being part of the Death Eaters."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "voldemort",
      "relationship_type": "is_hurt_by",
      "description": "Harry's scar hurts him when Voldemort is close by or feeling particularly murderous. This relationship is described in the text as 'I believe it hurts him when Lord Voldemort is close by, or feeling particularly murderous'."
    },
    {
      "entity_1": "harry",
      "entity_2": "dumbledore",
      "relationship_type": "is_defended_by",
      "description": "Dumbledore defends Harry's sanity and claims that he is as sane as anyone else. This relationship is described in the text as 'Harry is as sane as you or I'."
    },
    {
      "entity_1": "fudge",
      "entity_2": "lucius malfoy",
      "relationship_type": "has_connection_to",
      "description": "Fudge has a connection to Lucius Malfoy, who has been cleared and is now working for the Ministry. This relationship is described in the text as 'Malfoy was cleared! Now working for the Ministry!'"
    },
    {
      "entity_1": "fudge",
      "entity_2": "macnair",
      "relationship_type": "has_connection_to",
      "description": "Fudge has a connection to Macnair, who has been cleared and is now working for the Ministry. This relationship is described in the text as 'Also cleared! Now working for the Ministry!'"
    },
    {
      "entity_1": "fudge",
      "entity_2": "avery",
      "relationship_type": "has_connection_to",
      "description": "Fudge has a connection to Avery, who has been cleared and is now working for the Ministry. This relationship is described in the text as 'Also cleared! Now working for the Ministry!'"
    },
    {
      "entity_1": "fudge",
      "entity_2": "nott",
      "relationship_type": "has_connection_to",
      "description": "Fudge has a connection to Nott, who has been cleared and is now working for the Ministry. This relationship is described in the text as 'Also cleared! Now working for the Ministry!'"
    },
    {
      "entity_1": "fudge",
      "entity_2": "crabbe",
      "relationship_type": "has_connection_to",
      "description": "Fudge has a connection to Crabbe, who has been cleared and is now working for the Ministry. This relationship is described in the text as 'Also cleared! Now working for the Ministry!'"
    },
    {
      "entity_1": "fudge",
      "entity_2": "goyle",
      "relationship_type": "has_connection_to",
      "description": "Fudge has a connection to Goyle, who has been cleared and is now working for the Ministry. This relationship is described in the text as 'Also cleared! Now working for the Ministry!'"
    }
  ]
}