{
  "entities": [
    {
      "name": "hogsmeade",
      "entity_type": "location",
      "singular": true,
      "description": "Hogsmeade is a location mentioned in the text as the setting for a weekend trip. It is described as a place where students go to have fun."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person mentioned in the text as one of Harry's friends. He is quoted as saying 'What's he want to know ab out the next Hogsmeade weekend for?'"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person mentioned in the text as one of Ron's friends. He is quoted as saying 'Dunno' and is described as having momentary happiness at the sight of an owl."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a person mentioned in the text as a teacher who has been continuing Professor Grubbly-Plank's lessons on unicorns. He is described as trying to prove he can do anything that Professor Grubbly-Plank could."
    },
    {
      "name": "blast-ended skrewts",
      "entity_type": "creature",
      "singular": false,
      "description": "Blast-Ended Skrewts are creatures mentioned in the text as being taught by Hagrid. They are described as having only two left."
    },
    {
      "name": "unicorns",
      "entity_type": "creature",
      "singular": true,
      "description": "Unicorns are creatures mentioned in the text as being taught by Hagrid. They are described as having no poisonous fangs, which is disappointing to Hagrid."
    },
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is a person mentioned in the text as one of Harry's friends. She and Lavender go into transports of delight at the sight of two unicorn foals."
    },
    {
      "name": "lavender",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender is a person mentioned in the text as one of Harry's friends. She and Parvati go into transports of delight at the sight of two unicorn foals."
    },
    {
      "name": "pansy",
      "entity_type": "person",
      "singular": true,
      "description": "Pansy is a person mentioned in the text as one of Harry's friends. She is described as going into transports of delight at the sight of two unicorn foals."
    },
    {
      "name": "professor grubbly-plank",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Grubbly-Plank is a person mentioned in the text as having taught lessons on unicorns. Hagrid continues her lessons after she leaves."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "professor grubbly-plank",
      "relationship_type": "continues_work_of",
      "description": "Hagrid continues the work of Professor Grubbly-Plank by continuing her lessons on unicorns."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "unicorns",
      "relationship_type": "teaches",
      "description": "Hagrid teaches lessons on unicorns, which he continues from Professor Grubbly-Plank's work."
    },
    {
      "entity_1": "parvati",
      "entity_2": "unicorn foals",
      "relationship_type": "delighted_by",
      "description": "Parvati is delighted by the sight of two unicorn foals, which are pure gold and unlike full-grown unicorns."
    },
    {
      "entity_1": "lavender",
      "entity_2": "unicorn foals",
      "relationship_type": "delighted_by",
      "description": "Lavender is delighted by the sight of two unicorn foals, which are pure gold and unlike full-grown unicorns."
    },
    {
      "entity_1": "pansy",
      "entity_2": "unicorn foals",
      "relationship_type": "delighted_by",
      "description": "Pansy is delighted by the sight of two unicorn foals, which are pure gold and unlike full-grown unicorns."
    }
  ]
}