{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "character",
      "singular": true,
      "description": "Hermione is mentioned looking at her watch and expressing shock that they haven't practiced the Impediment Curse. She tells Harry to get some sleep."
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is mentioned as needing to practice the Impediment Curse with Hermione and Ron. He also thinks about Neville's situation and feels anger towards those who tortured his parents."
    },
    {
      "name": "ron",
      "entity_type": "character",
      "singular": true,
      "description": "Ron is mentioned going up to their dormitory with Harry and Hermione."
    },
    {
      "name": "neville",
      "entity_type": "character",
      "singular": true,
      "description": "Neville's situation is discussed by Harry, who feels sympathy for him. His parents are also mentioned as being tortured."
    },
    {
      "name": "dumbledore",
      "entity_type": "character",
      "singular": true,
      "description": "Dumbledore is mentioned in the context of Neville keeping a secret from Ron and Hermione."
    },
    {
      "name": "crouch",
      "entity_type": "character",
      "singular": true,
      "description": "Crouch's son is mentioned as being part of a crowd that jeered at Harry."
    },
    {
      "name": "mr. longbottom",
      "entity_type": "character",
      "singular": true,
      "description": "Mr. Longbottom is mentioned as being tortured by the people who also tortured Neville's parents."
    },
    {
      "name": "mrs. longbottom",
      "entity_type": "character",
      "singular": true,
      "description": "Mrs. Longbottom is mentioned as being tortured by the people who also tortured Neville's parents."
    },
    {
      "name": "impediment curse",
      "entity_type": "spell",
      "singular": false,
      "description": "The Impediment Curse is mentioned as something that Harry, Ron, and Hermione are supposed to practice."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry and Hermione are friends who are practicing the Impediment Curse together."
    },
    {
      "entity_1": "harry",
      "entity_2": "neville",
      "relationship_type": "sympathy",
      "description": "Harry feels sympathy for Neville's situation, where his parents are still alive but unable to recognize him."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Ron and Hermione are friends who are practicing the Impediment Curse with Harry."
    },
    {
      "entity_1": "harry",
      "entity_2": "crouch's son",
      "relationship_type": "enmity",
      "description": "Harry feels anger towards Crouch's son, who was part of a crowd that jeered at him."
    },
    {
      "entity_1": "people who tortured mr. and mrs. longbottom",
      "entity_2": "neville",
      "relationship_type": "victimhood",
      "description": "The people who tortured Neville's parents are also responsible for torturing Mr. and Mrs. Longbottom."
    },
    {
      "entity_1": "harry",
      "entity_2": "mr. and mrs. longbottom",
      "relationship_type": "sympathy",
      "description": "Harry feels sympathy for Mr. and Mrs. Longbottom, who were tortured by the people who also tortured Neville's parents."
    }
  ]
}