{
  "entities": [
    {
      "name": "krum",
      "entity_type": "person",
      "singular": true,
      "description": "Krum is a person mentioned in the text as having returned with Hermione. He is described as being from Durmstrang and having a scowl on his face when mentioning Karkaroff."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person mentioned in the text as returning with Krum. She is described as being impassive when Ron stares at her."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person mentioned in the text as staring at Hermione and later asking for Krum's autograph."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person mentioned in the text as talking to Krum about Diggory and having his hand shaken by Krum."
    },
    {
      "name": "diggory",
      "entity_type": "person",
      "singular": true,
      "description": "Diggory is a person mentioned in the text as being liked by Krum. He is described as being polite to Krum even though he was from Durmstrang."
    },
    {
      "name": "karkaroff",
      "entity_type": "person",
      "singular": true,
      "description": "Karkaroff is a person mentioned in the text as being associated with Durmstrang and causing Krum to scowl."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is a person mentioned in the text as having shaken Harry's hand in a similar manner to how Krum shook his hand."
    }
  ],
  "relationships": [
    {
      "entity_1": "krum",
      "entity_2": "diggory",
      "relationship_type": "liked",
      "description": "Krum liked Diggory, who was polite to him even though he was from Durmstrang."
    },
    {
      "entity_1": "krum",
      "entity_2": "karkaroff",
      "relationship_type": "dislike",
      "description": "Krum scowled when mentioning Karkaroff, indicating that he dislikes him."
    },
    {
      "entity_1": "harry",
      "entity_2": "krum",
      "relationship_type": "shook_hands_with",
      "description": "Harry shook hands with Krum in a similar manner to how Fleur had done."
    },
    {
      "entity_1": "ron",
      "entity_2": "krum",
      "relationship_type": "asked_for_autograph",
      "description": "Ron asked Krum for his autograph, indicating that he is interested in meeting him."
    }
  ]
}