{
  "entities": [
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is described as a teacher who snapped at Harry after the lesson. He is also mentioned as looking angry."
    },
    {
      "name": "karkaroff",
      "entity_type": "person",
      "singular": true,
      "description": "Karkaroff is described as looking extremely worried and hovering behind Snape's desk for the rest of the double period. He seemed intent on preventing Snape from slipping away at the end of class."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as sneaking a sidelong glance at the pair of them, deliberately knocking over his bottle of armadillo bile to duck out early and hear what Karkaroff wanted to say."
    },
    {
      "name": "armadillo bile",
      "entity_type": "substance",
      "singular": true,
      "description": "Armadillo bile is mentioned as a substance that Harry poured, and later knocked over with two minutes to go to the bell."
    }
  ],
  "relationships": [
    {
      "entity_1": "snape",
      "entity_2": "karkaroff",
      "relationship_type": "interaction",
      "description": "Snape and Karkaroff are described as interacting with each other, with Snape looking angry and Karkaroff looking worried and trying to prevent Snape from slipping away."
    },
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "interaction",
      "description": "Harry is described as interacting with Snape, sneaking a sidelong glance at him and deliberately knocking over his bottle of armadillo bile to duck out early."
    },
    {
      "entity_1": "harry",
      "entity_2": "karkaroff",
      "relationship_type": "interaction",
      "description": "Harry is described as interacting with Karkaroff, deliberately knocking over his bottle of armadillo bile to hear what Karkaroff wanted to say."
    },
    {
      "entity_1": "snape",
      "entity_2": "armadillo bile",
      "relationship_type": "possession",
      "description": "Snape is described as holding up a measuring cup containing armadillo bile, indicating that he has possession of it."
    }
  ]
}