{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as a character who is being addressed by Harry. He is described as someone who would probably turn them in to Percy if they told him about the detention for blackmail."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is mentioned as someone that Ron would probably turn in if he knew about the detention. He is described as someone who would do a Crouch and turn them in."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as having an owl that departed through a window. He is not further described in this context."
    },
    {
      "name": "georges",
      "entity_type": "person",
      "singular": true,
      "description": "Georges is mentioned as having an owl that departed with Fred's. He is not further described in this context."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a character who is addressing Ron and Hermione. He suggests that they should give Professor Moody till break before going to see him."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who is tired and wants to go see Professor Moody. She suggests it might be too early to do so."
    },
    {
      "name": "professor moody",
      "entity_type": "teacher",
      "singular": true,
      "description": "Professor Moody is mentioned as a teacher who would probably blast them through the door if they woke him up at dawn."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "percy",
      "relationship_type": "would_turn_in",
      "description": "Ron would probably turn them in to Percy if he knew about the detention."
    },
    {
      "entity_1": "harry",
      "entity_2": "professor moody",
      "relationship_type": "suggests_to_visit",
      "description": "Harry suggests that they should give Professor Moody till break before going to see him."
    },
    {
      "entity_1": "hermione",
      "entity_2": "professor moody",
      "relationship_type": "wants_to_visit",
      "description": "Hermione wants to go see Professor Moody, but thinks it might be too early to do so."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "is_being_addressed_by",
      "description": "Harry is addressing Ron in the conversation."
    }
  ]
}