{
  "entities": [
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is described as the one who had fled, indicating that he was a significant figure in the story. (\"his life almost extinguished, Vold emort had fled\")"
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as having become famous and being known by everyone in the hidden wizarding world. (\"Voldemort’s followers had disbanded, and Harry Potter had become famous.\")"
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is described as having discovered that he was a wizard on his eleventh birthday. (\"It had been enough of a shock for Harry to discover, on his eleventh birthday, that he was a wizard;\")"
    },
    {
      "name": "hogwarts",
      "entity_type": "school",
      "singular": true,
      "description": "Hogwarts is mentioned as the place where Harry would be starting his fourth year. (\"At the end of this summer, he would be starting his fourth year at Hogwarts,\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "voldemort",
      "entity_2": "harry potter",
      "relationship_type": "fled_from",
      "description": "Voldemort fled from Harry Potter. (\"his life almost extinguished, Vold emort had fled;\")"
    },
    {
      "entity_1": "voldemort",
      "entity_2": "harry potter",
      "relationship_type": "opponent",
      "description": "Voldemort's followers disbanded after he was defeated by Harry Potter. (\"Voldemort’s followers had disbanded, and Harry Potter had become famous.\")"
    },
    {
      "entity_1": "everyone in the hidden wizarding world",
      "entity_2": "harry potter",
      "relationship_type": "knows",
      "description": "Everyone in the hidden wizarding world knew Harry's name. (\"it had been even more dis-concerting to find out that everyone in the hidden wizarding world knew his name.\")"
    },
    {
      "entity_1": "heads of students at hogwarts",
      "entity_2": "harry potter",
      "relationship_type": "turn_to",
      "description": "When Harry arrived at Hogwarts, heads turned and whispers followed him. (\"Harry had arrived at  Hogwarts to find that heads turned and whispers followed him wherever he went.\")"
    }
  ]
}