{
  "entities": [
    {
      "name": "cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric is mentioned as someone who has caught Harry up on points and is being talked about by others. He is described as having been angry since Rita Skeeter's article."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character and is being talked about by Cedric and Amos Diggory. He is mentioned as being the only Hogwarts champion in Rita Skeeter's article."
    },
    {
      "name": "rita skeeter",
      "entity_type": "journalist",
      "singular": true,
      "description": "Rita Skeeter is a journalist who wrote an article about the Triwizard Tournament that made Harry out to be the only Hogwarts champion. She is described as causing trouble."
    },
    {
      "name": "amos diggory",
      "entity_type": "person",
      "singular": true,
      "description": "Amos Diggory is mentioned as someone who is talking about Cedric and Harry. He is described as working at the Ministry."
    },
    {
      "name": "bill weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Bill Weasley is mentioned as walking out of the door with Mrs. Weasley."
    },
    {
      "name": "mrs. weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is mentioned as talking about Rita Skeeter and laying a hand on her husband's arm to calm him down."
    }
  ],
  "relationships": [
    {
      "entity_1": "cedric",
      "entity_2": "harry",
      "relationship_type": "caught_up_on_points",
      "description": "Cedric caught Harry up on points, as mentioned by others in the conversation."
    },
    {
      "entity_1": "amos diggory",
      "entity_2": "rita skeeter",
      "relationship_type": "criticized_journalist",
      "description": "Amos Diggory criticized Rita Skeeter for causing trouble with her article."
    },
    {
      "entity_1": "harry",
      "entity_2": "cedric",
      "relationship_type": "beaten_before",
      "description": "Harry was mentioned to have beaten Cedric before, as said by Amos Diggory."
    }
  ]
}