{
  "entities": [
    {
      "name": "uncle vernon",
      "entity_type": "family_member",
      "singular": true,
      "description": "Uncle Vernon is described as maintaining an opinion about his son. He says he doesn't want a 'swotty little nancy boy' for a son. (Excerpt: '“he didn’t want some swotty little nancy boy for a son anyway.”')"
    },
    {
      "name": "aunt petunia",
      "entity_type": "family_member",
      "singular": true,
      "description": "Aunt Petunia is described as tearfully defending her nephew. She says he's 'boisterous' but wouldn't hurt a fly. (Excerpt: ‘“He’s a boisterous little boy, but he wouldn’t hurt a fly!”')"
    },
    {
      "name": "dudley",
      "entity_type": "family_member",
      "singular": true,
      "description": "Dudley is described as being big-boned and needing plenty of food. However, the school nurse's comments suggest that this may not be the case. (Excerpt: 'Aunt Petunia had said tearfully... but the fact remained that the school outfitters didn’t stock knickerbockers big enough for him anymore.')"
    },
    {
      "name": "school nurse",
      "entity_type": "professional",
      "singular": true,
      "description": "The school nurse is described as making comments about Dudley's weight. Her comments are not explained away by Uncle Vernon and Aunt Petunia. (Excerpt: 'No matter how much Aunt Petunia wailed that Dudl ey was big-boned... the fact remained that the school outfitters didn’t stock knickerbockers bi g enough for him anymore.')"
    }
  ],
  "relationships": [
    {
      "entity_1": "uncle vernon",
      "entity_2": "dudley",
      "relationship_type": "disapproval",
      "description": "Uncle Vernon disapproves of Dudley. He says he doesn't want a 'swotty little nancy boy' for a son. (Excerpt: ‘“he didn’t want some swotty little nancy boy for a son anyway.”')"
    },
    {
      "entity_1": "aunt petunia",
      "entity_2": "dudley",
      "relationship_type": "defence",
      "description": "Aunt Petunia defends Dudley. She says he's 'boisterous' but wouldn't hurt a fly. (Excerpt: ‘“He’s a boisterous little boy, but he wouldn’t hurt a fly!”')"
    },
    {
      "entity_1": "school nurse",
      "entity_2": "dudley",
      "relationship_type": "observation",
      "description": "The school nurse observes Dudley's weight and makes comments about it. Her comments are not explained away by Uncle Vernon and Aunt Petunia. (Excerpt: 'No matter how much Aunt Petunia wailed that Dudl ey was big-boned... the fact remained that the school outfitters didn’t stock knickerbockers bi g enough for him anymore.')"
    }
  ]
}