{
  "entities": [
    {
      "name": "madame maxime",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Maxime is mentioned as someone that Dumbledore does not suspect, introduced in the context of a discussion about who might be prejudiced."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as someone that Dumbledore does not suspect, introduced in the context of a discussion about who might be prejudiced."
    },
    {
      "name": "dumblodore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is the one having the conversation and making accusations, introduced as the main character in the dialogue."
    },
    {
      "name": "cornelius",
      "entity_type": "person",
      "singular": true,
      "description": "Cornelius is mentioned as someone who might be prejudiced, introduced in the context of Dumbledore's accusation."
    },
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "Moody is mentioned as interrupting the conversation and wanting to move it outside, introduced as someone who has a connection with Potter."
    },
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is mentioned as impatiently agreeing to move the discussion outside, introduced as someone who is present in the conversation."
    },
    {
      "name": "potter",
      "entity_type": "person",
      "singular": true,
      "description": "Potter is mentioned as wanting a word with Dumbledore, introduced as someone who has a connection with Moody."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumblodore",
      "entity_2": "madame maxime",
      "relationship_type": "suspect",
      "description": "Dumbledore does not suspect Madame Maxime, introduced in the context of a discussion about who might be prejudiced."
    },
    {
      "entity_1": "dumblodore",
      "entity_2": "hagrid",
      "relationship_type": "suspect",
      "description": "Dumbledore does not suspect Hagrid, introduced in the context of a discussion about who might be prejudiced."
    },
    {
      "entity_1": "moody",
      "entity_2": "potter",
      "relationship_type": "connection",
      "description": "Moody has a connection with Potter, introduced as someone who wants to move the conversation outside and mentions Potter's name."
    }
  ]
}