{
  "entities": [
    {
      "name": "dobby",
      "entity_type": "character",
      "singular": true,
      "description": "Dobby is a house-elf who is scared and trying to avoid being involved in the situation. (\"Miss will please keep Dobby out of this\")"
    },
    {
      "name": "hermione",
      "entity_type": "character",
      "singular": true,
      "description": "Hermione is seen as mad and dangerous by the house-elves. (\"They were suddenly looking at Hermione as though she were mad and dangerous.\")"
    },
    {
      "name": "winky",
      "entity_type": "character",
      "singular": true,
      "description": "Winky is a house-elf who is standing next to Dobby near the hearth. (\"Dobby called miserably from the hearth, where he was standing next to the lumpy tablecloth that was Winky.\")"
    },
    {
      "name": "harry potter",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is receiving food from the house-elves. (\"We has your extra food!\")"
    },
    {
      "name": "ron",
      "entity_type": "character",
      "singular": true,
      "description": "Ron is angry with Hermione for speaking out of turn. (\"You couldn’t keep your mouth shut, could you, Hermione?\")"
    },
    {
      "name": "mr crouch",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Crouch is mentioned as the subject of Winky's knowledge. (\"We could’ve tried to get more stuff out of Winky about Crouch!\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "dobby",
      "entity_2": "hermione",
      "relationship_type": "looks_at",
      "description": "The house-elves are looking at Hermione as though she were mad and dangerous. (\"They were suddenly looking at Hermione as though she were mad and dangerous.\")"
    },
    {
      "entity_1": "dobby",
      "entity_2": "winky",
      "relationship_type": "stands_next_to",
      "description": "Dobby is standing next to Winky near the hearth. (\"Dobby called miserably from the hearth, where he was standing next to the lumpy tablecloth that was Winky.\")"
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "angrily_speaks_to",
      "description": "Ron is angry with Hermione for speaking out of turn. (\"You couldn’t keep your mouth shut, could you, Hermione?\")"
    }
  ]
}