{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is described as standing beaming at Harry and Ron from the bank. He is trying to pull Harry upright."
    },
    {
      "name": "ludo bagman",
      "entity_type": "person",
      "singular": true,
      "description": "Ludo Bagman is described as standing beaming at Harry and Ron from the bank, alongside Dumbledore."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as being exhausted and trying to tell Fleur that Gabrielle is fine. He is also being pulled upright by Dumbledore and Bagman."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as being dragged back to the bank by Percy."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is described as looking white and much younger than usual, and dragging Ron back to the bank."
    },
    {
      "name": "madame maxime",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Maxime is trying to restrain Fleur Delacour from returning to the water."
    },
    {
      "name": "fleur delacour",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur Delacour is described as being hysterical and fighting tooth and nail to return to the water. She is also hugging her sister Gabrielle."
    },
    {
      "name": "gabrielle",
      "entity_type": "person",
      "singular": true,
      "description": "Gabrielle is mentioned as Fleur's sister, whom she is hugging and trying to comfort."
    },
    {
      "name": "madam pomfrey",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Pomfrey is described as seizing Harry and pulling him over to Hermione and the others."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "helped",
      "description": "Dumbledore is trying to pull Harry upright, indicating that he is helping him."
    },
    {
      "entity_1": "ludo bagman",
      "entity_2": "harry",
      "relationship_type": "helped",
      "description": "Ludo Bagman is also trying to pull Harry upright, indicating that he is helping him."
    },
    {
      "entity_1": "percy",
      "entity_2": "ron",
      "relationship_type": "dragged",
      "description": "Percy is dragging Ron back to the bank, indicating a forceful relationship between them."
    },
    {
      "entity_1": "madame maxime",
      "entity_2": "fleur delacour",
      "relationship_type": "restrained",
      "description": "Madame Maxime is trying to restrain Fleur Delacour from returning to the water, indicating a controlling relationship between them."
    },
    {
      "entity_1": "madam pomfrey",
      "entity_2": "harry",
      "relationship_type": "cared_for",
      "description": "Madam Pomfrey is pulling Harry over to Hermione and the others, indicating that she is caring for him."
    }
  ]
}