{
  "entities": [
    {
      "name": "granger",
      "entity_type": "person",
      "singular": true,
      "description": "Granger is mentioned as a person who is being addressed by Malfoy. The text states 'Very clever, Granger,' which indicates that Granger has done something impressive."
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is the main antagonist and a Slytherin student who is known for his arrogance and menacing behavior. He is mentioned as saying 'Very clever, Granger,' which shows that he is acknowledging Granger's achievement."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is a Slytherin student who is standing behind Malfoy. He is mentioned as looking pleased with himself and menacing towards Harry."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is a Slytherin student who is standing behind Malfoy. He is mentioned as looking pleased with himself and menacing towards Harry."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is the main protagonist of the story. He is mentioned as being addressed by Malfoy and feeling threatened by him."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is a wise and powerful wizard who is mentioned as having a favorite student in Harry Potter."
    },
    {
      "name": "cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric is a Hufflepuff student who was killed by Wormtail on the orders of Lord Voldemort. He is mentioned as being discussed during Dumbledore's speech."
    },
    {
      "name": "potter",
      "entity_type": "person",
      "singular": true,
      "description": "Potter refers to Harry Potter and is used as a nickname for him in the text."
    },
    {
      "name": "wormtail",
      "entity_type": "person",
      "singular": true,
      "description": "Wormtail is a Death Eater who killed Cedric on the orders of Lord Voldemort. He is mentioned as being involved in Cedric's death."
    },
    {
      "name": "lord voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Lord Voldemort is the main antagonist of the story and is mentioned as having ordered Wormtail to kill Cedric."
    }
  ],
  "relationships": [
    {
      "entity_1": "malfoy",
      "entity_2": "granger",
      "relationship_type": "addressed",
      "description": "Malfoy addresses Granger with a compliment, showing that he acknowledges her achievement."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "dumbledore",
      "relationship_type": "favorite_of",
      "description": "Dumbledore is mentioned as having Harry Potter as his favorite student."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "crabbe",
      "relationship_type": "accomplice",
      "description": "Malfoy and Crabbe are standing together, showing that they are accomplices in their menacing behavior towards Harry."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "goyle",
      "relationship_type": "accomplice",
      "description": "Malfoy and Goyle are standing together, showing that they are accomplices in their menacing behavior towards Harry."
    }
  ]
}