{
  "entities": [
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "Moody is described as raising his wand and muttering a spell to shrink the spider back to its proper size. He is also mentioned as saying 'Pain' and explaining that thumbscrews or knives are not needed to torture someone if one can perform the Cruciatus Curse."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as looking around at his classmates after Moody asks for other curses. He is also mentioned as having a look on his face that suggests he is wondering what will happen to the last spider."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as raising her hand into the air for the third time and whispering 'Avada Kedavra'. She is also mentioned as having a shaking hand."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as looking uneasily around at Hermione after she whispers 'Avada Kedavra'."
    },
    {
      "name": "spider",
      "entity_type": "animal",
      "singular": true,
      "description": "The spider is described as having its legs relaxed but continuing to twitch. It is also mentioned as being put back into a jar by Moody."
    },
    {
      "name": "cruciatus curse",
      "entity_type": "curse",
      "singular": true,
      "description": "The Cruciatus Curse is mentioned as being very popular once and used for torture without the need for thumbscrews or knives."
    },
    {
      "name": "avada kedavra",
      "entity_type": "curse",
      "singular": true,
      "description": "Avada Kedavra is mentioned as a curse that Hermione whispers."
    }
  ],
  "relationships": [
    {
      "entity_1": "moody",
      "entity_2": "spider",
      "relationship_type": "shrinks",
      "description": "Moody shrinks the spider back to its proper size using the spell 'Reducio'."
    },
    {
      "entity_1": "hermione",
      "entity_2": "avada kedavra",
      "relationship_type": "utters",
      "description": "Hermione utters the curse 'Avada Kedavra'."
    },
    {
      "entity_1": "moody",
      "entity_2": "cruciatus curse",
      "relationship_type": "explains",
      "description": "Moody explains that thumbscrews or knives are not needed to torture someone if one can perform the Cruciatus Curse."
    }
  ]
}