{
  "entities": [
    {
      "name": "the pensieve",
      "entity_type": "object",
      "singular": true,
      "description": "A magical device used to store and recall memories. (The Pensieve is mentioned as a place where Harry's memories are stored.)"
    },
    {
      "name": "lord voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "The main antagonist of the story, a dark wizard who has taken over the wizarding world. (Lord Voldemort's downfall is mentioned in the context of Karkaroff's past actions.)"
    },
    {
      "name": "karkaroff",
      "entity_type": "person",
      "singular": true,
      "description": "A Death Eater who has turned spy for Harry and Dumbledore. (Karkaroff is being questioned by Mr. Crouch in the context of his past actions as a Death Eater.)"
    },
    {
      "name": "mad-eye moody",
      "entity_type": "person",
      "singular": true,
      "description": "A wizard who is skeptical of Karkaroff's intentions. (Mad-Eye Moody is shown to be looking at Karkaroff with deep skepticism behind Dumbledore's back.)"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "The headmaster of Hogwarts School of Witchcraft and Wizardry. (Dumbledore is mentioned in the context of his relationship with Mad-Eye Moody and Karkaroff.)"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main protagonist of the story, a young wizard who is being questioned by Mr. Crouch. (Harry is shown to be looking around in confusion as the dungeon dissolves and reappears.)"
    },
    {
      "name": "mr crouch",
      "entity_type": "person",
      "singular": true,
      "description": "A Ministry of Magic official who is questioning Karkaroff. (Mr. Crouch is shown to be coldly reviewing Karkaroff's case.)"
    },
    {
      "name": "azkaban",
      "entity_type": "place",
      "singular": true,
      "description": "A maximum-security prison for wizards and witches. (Karkaroff is told that he will return to Azkaban in the meantime.)"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "the pensieve",
      "relationship_type": "has_memory",
      "description": "Harry's memories are stored in the Pensieve. (The text mentions that Harry's memories are stored in the Pensieve, implying a relationship between Harry and the device.)"
    },
    {
      "entity_1": "karkaroff",
      "entity_2": "lord voldemort",
      "relationship_type": "was_death_eater_of",
      "description": "Karkaroff was a Death Eater of Lord Voldemort. (The text mentions that Karkaroff turned spy for Harry and Dumbledore after Lord Voldemort's downfall, implying a past relationship between Karkaroff and Voldemort.)"
    },
    {
      "entity_1": "karkaroff",
      "entity_2": "mad-eye moody",
      "relationship_type": "is_suspected_by",
      "description": "Mad-Eye Moody is skeptical of Karkaroff's intentions. (The text shows Mad-Eye Moody looking at Karkaroff with deep skepticism, implying a relationship between the two.)"
    },
    {
      "entity_1": "karkaroff",
      "entity_2": "dumbledore",
      "relationship_type": "is_spied_for_by",
      "description": "Karkaroff is spying for Dumbledore. (The text mentions that Karkaroff turned spy for Harry and Dumbledore, implying a relationship between Karkaroff and Dumbledore.)"
    },
    {
      "entity_1": "karkaroff",
      "entity_2": "harry",
      "relationship_type": "is_spied_for_by",
      "description": "Karkaroff is spying for Harry. (The text mentions that Karkaroff turned spy for Harry and Dumbledore, implying a relationship between Karkaroff and Harry.)"
    },
    {
      "entity_1": "mr crouch",
      "entity_2": "karkaroff",
      "relationship_type": "is_being_questioned_by",
      "description": "Mr. Crouch is questioning Karkaroff. (The text shows Mr. Crouch coldly reviewing Karkaroff's case, implying a relationship between the two.)"
    },
    {
      "entity_1": "karkaroff",
      "entity_2": "azkaban",
      "relationship_type": "will_return_to",
      "description": "Karkaroff will return to Azkaban. (The text mentions that Karkaroff is being told he will return to Azkaban, implying a relationship between Karkaroff and the prison.)"
    }
  ]
}