{
  "entities": [
    {
      "name": "cruciatus curse",
      "entity_type": "curse",
      "singular": true,
      "description": "The Cruciatus Curse is a type of curse that causes intense pain. It is mentioned in the text as being used by Voldemort on Harry."
    },
    {
      "name": "voldemort",
      "entity_type": "character",
      "singular": true,
      "description": "Voldemort is the main antagonist of the story, who uses the Cruciatus Curse on Harry. He is described as having slit-like nostrils and red eyes."
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is the protagonist of the story, who is subjected to the Cruciatus Curse by Voldemort. He is described as screaming loudly and shaking uncontrollably."
    },
    {
      "name": "wormtail",
      "entity_type": "character",
      "singular": true,
      "description": "Wormtail is a character mentioned in the text, who had his hand cut off. Harry compares himself to Wormtail after being subjected to the Cruciatus Curse."
    },
    {
      "name": "cedric",
      "entity_type": "character",
      "singular": true,
      "description": "Cedric is a character mentioned in the text, who died at the hands of Voldemort. Harry fears that he will die like Cedric after being subjected to the Cruciatus Curse."
    }
  ],
  "relationships": [
    {
      "entity_1": "voldemort",
      "entity_2": "harry",
      "relationship_type": "uses_curse_on",
      "description": "Voldemort uses the Cruciatus Curse on Harry, causing him intense pain. This is described in the text as 'a little break' and 'a little pause'."
    },
    {
      "entity_1": "harry",
      "entity_2": "wormtail",
      "relationship_type": "compared_to",
      "description": "Harry compares himself to Wormtail after being subjected to the Cruciatus Curse, describing himself as shaking uncontrollably like Wormtail did when his hand was cut off."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "cedric",
      "relationship_type": "killed",
      "description": "Voldemort killed Cedric, and Harry fears that he will die like Cedric after being subjected to the Cruciatus Curse."
    }
  ]
}