{
  "entities": [
    {
      "name": "creevey brothers",
      "entity_type": "people",
      "singular": false,
      "description": "The Creevey brothers are mentioned as trying to bewitch the badges to make them say Support Harry Potter! instead of Support Cedric Diggory!. They are described as having managed to get the badges stuck on POTTER STINKS."
    },
    {
      "name": "cedric diggory",
      "entity_type": "people",
      "singular": true,
      "description": "Cedric Diggory is mentioned in the context of the Support Cedric Diggory! badges that the Creevey brothers are trying to bewitch."
    },
    {
      "name": "harry potter",
      "entity_type": "people",
      "singular": true,
      "description": "Harry Potter is mentioned as the one whose name the Creevey brothers are trying to replace on the badges. He is also the main character of the story and is described as creeping past the Creevey brothers."
    },
    {
      "name": "hermione",
      "entity_type": "people",
      "singular": true,
      "description": "Hermione is mentioned as opening the Fat Lady for Harry from outside as they had planned."
    },
    {
      "name": "fat lady",
      "entity_type": "object",
      "singular": true,
      "description": "The Fat Lady is a portrait that Hermione opens for Harry to pass through."
    },
    {
      "name": "hagrid",
      "entity_type": "people",
      "singular": true,
      "description": "Hagrid is mentioned as having a cabin in the grounds where Harry walks down the lawn towards the lights shining."
    },
    {
      "name": "madame maxime",
      "entity_type": "people",
      "singular": true,
      "description": "Madame Maxime is mentioned as talking inside the Beauxbatons carriage."
    },
    {
      "name": "beauxbatons carriage",
      "entity_type": "object",
      "singular": true,
      "description": "The Beauxbatons carriage is described as being lit up and having Madame Maxime talking inside it."
    }
  ],
  "relationships": [
    {
      "entity_1": "creevey brothers",
      "entity_2": "harry potter",
      "relationship_type": "trying_to_replace_name_on_badges",
      "description": "The Creevey brothers are trying to replace Harry Potter's name on the badges with Cedric Diggory's name."
    },
    {
      "entity_1": "hermione",
      "entity_2": "fat lady",
      "relationship_type": "opening_portrait_for_harry",
      "description": "Hermione opens the Fat Lady for Harry to pass through."
    }
  ]
}