{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a gamekeeper and Care of Magical Creatures teacher at Hogwarts School of Witchcraft and Wizardry. He is wearing a large, red, luminous star on the back of his moleskin vest."
    },
    {
      "name": "professor moody",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Moody is an Auror and Defense Against the Dark Arts teacher at Hogwarts School of Witchcraft and Wizardry. He is wearing a large, red, luminous star on his hat."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is the Transfiguration teacher at Hogwarts School of Witchcraft and Wizardry. She is wearing a large, red, luminous star on her hat."
    },
    {
      "name": "professor flitwick",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Flitwick is the Charms teacher at Hogwarts School of Witchcraft and Wizardry. He is wearing a large, red, luminous star on his hat."
    },
    {
      "name": "bagman",
      "entity_type": "person",
      "singular": true,
      "description": "Bagman is a wizard who is involved in the Triwizard Tournament. He is standing near Hagrid and the champions."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "bagman",
      "relationship_type": "near",
      "description": "Hagrid and Bagman are standing near each other in the stadium."
    },
    {
      "entity_1": "professor moody",
      "entity_2": "bagman",
      "relationship_type": "near",
      "description": "Professor Moody and Bagman are standing near each other in the stadium."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "bagman",
      "relationship_type": "near",
      "description": "Professor McGonagall and Bagman are standing near each other in the stadium."
    },
    {
      "entity_1": "professor flitwick",
      "entity_2": "bagman",
      "relationship_type": "near",
      "description": "Professor Flitwick and Bagman are standing near each other in the stadium."
    }
  ]
}