{
  "entities": [
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is described as looking very pretty indeed, wearing robes of shocking pink and gold bracelets. She is waiting for Harry at the foot of the stairs."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is relieved to see Parvati isn't giggling, and he's described as looking awkward when talking to her. He's waiting for someone in the entrance hall."
    },
    {
      "name": "padma",
      "entity_type": "person",
      "singular": true,
      "description": "Padma is mentioned as going to meet Harry in the entrance hall, but she's not physically present at this moment."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is looking around and asking about Hermione. He's waiting for someone in the entrance hall."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as missing, but her presence is expected in the entrance hall."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is described as winking at Harry as he passes him on the way out of the portrait hole."
    }
  ],
  "relationships": [
    {
      "entity_1": "parvati",
      "entity_2": "harry",
      "relationship_type": "waiting_for",
      "description": "Parvati is waiting for Harry at the foot of the stairs. This relationship is described as Parvati looking very pretty indeed, and Harry being relieved to see her."
    },
    {
      "entity_1": "padma",
      "entity_2": "harry",
      "relationship_type": "meeting",
      "description": "Padma is going to meet Harry in the entrance hall. This relationship is described as Padma's action of meeting Harry, and it's mentioned by Parvati."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "looking_for",
      "description": "Ron is looking for Hermione in the entrance hall. This relationship is described as Ron asking about Hermione, and it's mentioned by Parvati."
    },
    {
      "entity_1": "fred",
      "entity_2": "harry",
      "relationship_type": "winking_at",
      "description": "Fred winks at Harry as he passes him on the way out of the portrait hole. This relationship is described as Fred's action of winking, and it's mentioned by the narrator."
    }
  ]
}