{
  "entities": [
    {
      "name": "viktor krum",
      "entity_type": "person",
      "singular": true,
      "description": "Viktor Krum is mentioned as a Durmstrang student who has settled at the Slytherin table. He is described as someone who gets people fawning over him all the time."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as one of Harry's classmates who looks smug about Durmstrang students settling at their table. He is described as someone who tries to 'smarm up' to Viktor Krum."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is mentioned as one of Harry's classmates who looks smug about Durmstrang students settling at their table."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is mentioned as one of Harry's classmates who looks smug about Durmstrang students settling at their table."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who suggests offering Viktor Krum a space in their dormitory and giving up his bed for him."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who watches Malfoy try to talk to Viktor Krum and is suggested by Ron to offer Viktor Krum a space in their dormitory."
    },
    {
      "name": "durmstrang students",
      "entity_type": "group",
      "singular": false,
      "description": "Durmstrang students are mentioned as people who have settled at the Slytherin table. They include Viktor Krum."
    },
    {
      "name": "slytherin table",
      "entity_type": "location",
      "singular": true,
      "description": "The Slytherin table is mentioned as a place where Durmstrang students have settled."
    },
    {
      "name": "dormitory",
      "entity_type": "location",
      "singular": true,
      "description": "Ron suggests offering Viktor Krum a space in their dormitory."
    }
  ],
  "relationships": [
    {
      "entity_1": "malfoy",
      "entity_2": "viktor krum",
      "relationship_type": "tries to flatter",
      "description": "Malfoy tries to 'smarm up' to Viktor Krum, suggesting that he is trying to get on his good side."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "suggests",
      "description": "Ron suggests offering Viktor Krum a space in their dormitory and giving up his bed for him."
    }
  ]
}