{
  "entities": [
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as Harry's godfather and the reason for his absence from Harry's life until two months ago. He was in Azkaban prison and later found to be innocent of the murders for which he was convicted."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as Sirius' godson who had just found out that Sirius was his father. He had come face-to-face with Wormtail and knew that Sirius was innocent of the murders for which he was convicted."
    },
    {
      "name": "azkaban",
      "entity_type": "location",
      "singular": true,
      "description": "Azkaban is mentioned as a wizard jail guarded by dementors where Sirius was imprisoned."
    },
    {
      "name": "dementors",
      "entity_type": "creature",
      "singular": false,
      "description": "Dementors are mentioned as creatures that guard Azkaban prison and suck the souls of wizards."
    },
    {
      "name": "wormtail",
      "entity_type": "person",
      "singular": true,
      "description": "Wormtail is mentioned as Voldemort's supporter who committed the murders for which Sirius was convicted. Harry and his friends knew that Wormtail was alive."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is mentioned as the one whose supporter Wormtail committed the murders for which Sirius was convicted."
    },
    {
      "name": "harry's dursleys",
      "entity_type": "family",
      "singular": false,
      "description": "Harry's Dursleys are mentioned as the ones Harry had to leave behind when he went to live with Sirius."
    },
    {
      "name": "professor dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Dumbledore is mentioned as the one who believed Harry and his friends' story about Wormtail being alive."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "godson",
      "description": "Harry is Sirius's godson. This relationship is mentioned as the reason for Harry's excitement and hope of leaving his Dursleys behind."
    },
    {
      "entity_1": "sirius",
      "entity_2": "azkaban",
      "relationship_type": "imprisonment",
      "description": "Sirius was imprisoned in Azkaban. This relationship is mentioned as the reason for Sirius's absence from Harry's life until two months ago."
    },
    {
      "entity_1": "sirius",
      "entity_2": "wormtail",
      "relationship_type": "innocence",
      "description": "Sirius was innocent of the murders committed by Wormtail. This relationship is mentioned as a fact that Harry and his friends knew, but others did not."
    },
    {
      "entity_1": "harry",
      "entity_2": "wormtail",
      "relationship_type": "encounter",
      "description": "Harry had come face-to-face with Wormtail the previous year. This relationship is mentioned as a fact that Harry and his friends knew, but others did not."
    },
    {
      "entity_1": "harry",
      "entity_2": "professor dumbledore",
      "relationship_type": "believer",
      "description": "Professor Dumbledore believed Harry's story about Wormtail being alive. This relationship is mentioned as a fact that highlights the difference in opinions between Professor Dumbledore and others."
    }
  ]
}