{
  "entities": [
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is a person who is speaking to Harry. He says he wasn't telling something and that Hermione just told him to shut up and get on with transforming his raccoon."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person who is thinking about the tasks. He wonders what they are going to be and suggests that Harry could do them."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is a person who is correcting Ron's suggestion. He says that Harry hasn't done dangerous stuff in front of judges before."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who is being talked to by George, Ron, and Fred. He asks about the judges and wonders what the tasks are going to be."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who provides information about the judges. She explains that the Heads of participating schools are always on the panel because they were injured during the Tournament of 1792."
    },
    {
      "name": "mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "McGonagall is a person who is mentioned as saying that champions get awarded points according to how well they've done the tasks."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "george",
      "relationship_type": "speaks_to",
      "description": "George is speaking to Harry, saying that he wasn't telling something and that Hermione just told him to shut up and get on with transforming his raccoon."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "suggests_to",
      "description": "Ron is suggesting to Harry that he could do the tasks. He wonders what they are going to be and thinks that Harry could handle them."
    },
    {
      "entity_1": "fred",
      "entity_2": "harry",
      "relationship_type": "corrects",
      "description": "Fred is correcting Ron's suggestion, saying that Harry hasn't done dangerous stuff in front of judges before."
    },
    {
      "entity_1": "hermione",
      "entity_2": "everyone",
      "relationship_type": "informs",
      "description": "Hermione is providing information to everyone about the judges. She explains that the Heads of participating schools are always on the panel because they were injured during the Tournament of 1792."
    },
    {
      "entity_1": "mcgonagall",
      "entity_2": "champions",
      "relationship_type": "awards_points_to",
      "description": "McGonagall is awarding points to champions according to how well they've done the tasks. This is mentioned by Hermione as a reason why the Heads of participating schools are on the panel."
    }
  ]
}