{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character, Harry, is mentioned as having a heart rate return to normal and being woken up by his friends. He is also described as wearing glasses and having a bedside table."
    },
    {
      "name": "dobby",
      "entity_type": "house-elf",
      "singular": true,
      "description": "Dobby, the house-elf, is mentioned as being next to Harry's bed and looking worried. He has a Christmas bauble tied to his tea cozy."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is one of Harry's friends who is woken up by Harry's yell and decides to open presents with the others."
    },
    {
      "name": "seamus",
      "entity_type": "person",
      "singular": true,
      "description": "Seamus is another friend of Harry's who is woken up by Harry's yell and spots the pile of presents at the foot of his bed."
    },
    {
      "name": "dean",
      "entity_type": "person",
      "singular": true,
      "description": "Dean is a friend of Harry's who is woken up by Harry's yell and decides to open presents with the others."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is a friend of Harry's who is woken up by Harry's yell and decides to open presents with the others."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "dobby",
      "relationship_type": "interaction",
      "description": "Harry interacts with Dobby, who is standing next to his bed and looking worried. Harry tells Dobby not to bend over him like that in the future."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "friendship",
      "description": "Harry wakes up Ron, who is one of his friends and decides to open presents with the others."
    },
    {
      "entity_1": "harry",
      "entity_2": "seamus",
      "relationship_type": "friendship",
      "description": "Harry wakes up Seamus, who is another friend and spots the pile of presents at the foot of his bed."
    },
    {
      "entity_1": "harry",
      "entity_2": "dean",
      "relationship_type": "friendship",
      "description": "Harry wakes up Dean, who is a friend and decides to open presents with the others."
    },
    {
      "entity_1": "harry",
      "entity_2": "neville",
      "relationship_type": "friendship",
      "description": "Harry wakes up Neville, who is a friend and decides to open presents with the others."
    }
  ]
}