{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as a person who is being dragged back down by Harry. He is compared to a 'potato-filled sack' indicating that he is heavy and difficult for Harry to swim with."
    },
    {
      "name": "fleur's sister",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur's sister is described as a person who is being dragged back down by Harry. She is also compared to a 'potato-filled sack' indicating that she is heavy and difficult for Harry to swim with."
    },
    {
      "name": "merpeople",
      "entity_type": "creature",
      "singular": false,
      "description": "Merpeople are described as creatures that are rising with Harry in the water. They are watching him struggle through the water."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as a person who is struggling to swim and keep Ron and Fleur's sister from being pulled back down by the merpeople."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "dragging",
      "description": "Harry is dragging Ron through the water, but Ron is heavy and difficult to swim with."
    },
    {
      "entity_1": "harry",
      "entity_2": "fleur's sister",
      "relationship_type": "dragging",
      "description": "Harry is also dragging Fleur's sister through the water, but she is just as heavy and difficult to swim with as Ron."
    },
    {
      "entity_1": "merpeople",
      "entity_2": "harry",
      "relationship_type": "watching",
      "description": "The merpeople are watching Harry struggle through the water."
    },
    {
      "entity_1": "merpeople",
      "entity_2": "ron",
      "relationship_type": "watching",
      "description": "The merpeople are also watching Ron as he is being dragged back down by Harry."
    },
    {
      "entity_1": "merpeople",
      "entity_2": "fleur's sister",
      "relationship_type": "watching",
      "description": "The merpeople are watching Fleur's sister as she is being dragged back down by Harry."
    }
  ]
}