{
  "entities": [
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as someone who has died. He is referred to in the past tense and his death is a significant event that has affected Harry."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who is talking to Harry about Sirius's girlfriend. He is described as being 'forceful' in his opinion."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character and is having a conversation with Ron about Sirius's girlfriend. He shrugs off Ron's advice."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who is present in the conversation between Harry and Ron. She is asked by Ron for information about Sirius's girlfriend."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as someone who has broken up with Michael Corner. She is described as being 'resolute' in her decision to end the relationship."
    },
    {
      "name": "michael corner",
      "entity_type": "person",
      "singular": true,
      "description": "Michael Corner is mentioned as Ginny's ex-boyfriend. He is described as being 'sulky' and having run off to comfort Cho after breaking up with Ginny."
    },
    {
      "name": "cho",
      "entity_type": "person",
      "singular": true,
      "description": "Cho is mentioned as someone who Michael Corner has gone to comfort after breaking up with Ginny."
    },
    {
      "name": "the quibbler",
      "entity_type": "magazine",
      "singular": false,
      "description": "The Quibbler is a magazine that Ginny is reading. It is turned upside down by her."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "conversation",
      "description": "Ron and Harry are having a conversation about Sirius's girlfriend."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "questioning",
      "description": "Ron asks Hermione for information about Sirius's girlfriend."
    },
    {
      "entity_1": "ginny",
      "entity_2": "michael corner",
      "relationship_type": "ex-romantic_partner",
      "description": "Ginny has broken up with Michael Corner."
    },
    {
      "entity_1": "michael corner",
      "entity_2": "cho",
      "relationship_type": "comforting",
      "description": "Michael Corner has gone to comfort Cho after breaking up with Ginny."
    }
  ]
}