{
  "entities": [
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is mentioned as someone who suspects Harry's dad and has a Muggle obsession. He wants Percy in his office to spy on the family and Dumbledore."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone Fudge wants to spy on, and he is also described as being friendly with Harry's dad."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is mentioned as someone who has been struggling against his family's reputation since joining the Ministry. He is also described as saying terrible things about his dad and Dumbledore."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being confused and in disbelief when Percy says terrible things about his dad."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as laughing at Percy's outburst and describing how bad it was."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as making a noise like an angry cat when Percy says terrible things about his dad."
    },
    {
      "name": "dad",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's dad is mentioned as being suspected by Fudge and having a Muggle obsession. He is also described as not having ambition and being an idiot for running around with Dumbledore."
    }
  ],
  "relationships": [
    {
      "entity_1": "fudge",
      "entity_2": "dad",
      "relationship_type": "suspects",
      "description": "Fudge suspects Harry's dad because of his Muggle obsession."
    },
    {
      "entity_1": "fudge",
      "entity_2": "dumbledore",
      "relationship_type": "wants_to_spy_on",
      "description": "Fudge wants to use Percy to spy on Dumbledore."
    },
    {
      "entity_1": "percy",
      "entity_2": "dad",
      "relationship_type": "criticizes",
      "description": "Percy says terrible things about his dad, including that he has no ambition and is an idiot for running around with Dumbledore."
    },
    {
      "entity_1": "percy",
      "entity_2": "dumbledore",
      "relationship_type": "criticizes",
      "description": "Percy also criticizes Dumbledore, saying that Harry's dad is an idiot for running around with him."
    }
  ]
}