{
  "entities": [
    {
      "name": "vol",
      "entity_type": "person",
      "singular": true,
      "description": "Vol is mentioned as part of a question, indicating that someone named Vol is being referred to. (\"what's Vol — ?\")"
    },
    {
      "name": "dedalus diggle",
      "entity_type": "person",
      "singular": true,
      "description": "Dedalus Diggle dropped his hat again, indicating that he is present in the scene and has a physical presence."
    },
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "Moody growled and spoke to Harry, indicating that he is present in the scene and interacting with others."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry was spoken to by Moody and responded to him, indicating that he is present in the scene and interacting with others."
    },
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks spoke conversationally to Moody, indicating that she is present in the scene and interacting with others."
    }
  ],
  "relationships": [
    {
      "entity_1": "moody",
      "entity_2": "harry",
      "relationship_type": "spoke_to",
      "description": "Moody spoke to Harry, as indicated by their conversation. (\"What?” said Harry.\n“We’re not discussing anything he re, it’s too risky,” said Moody, turning his normal eye on Harry; his  magical eye remained pointing up at the ceiling.)"
    },
    {
      "entity_1": "moody",
      "entity_2": "tonks",
      "relationship_type": "spoke_to",
      "description": "Moody was spoken to by Tonks, as indicated by her conversation. (\"Mad-Eye, you do know that’s disgusting, don’t you?” said Tonks conversationally.)"
    },
    {
      "entity_1": "moody",
      "entity_2": "vol",
      "relationship_type": "mentioned",
      "description": "Moody mentioned Vol in a question, indicating that he is aware of or has knowledge about someone named Vol. (\"what’s Vol — ?\")"
    }
  ]
}