{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is introduced as a character who has gone to see an applicant for the post of Divination teacher. He is described as having a certain inclination against allowing the subject of Divination to continue."
    },
    {
      "name": "hog's head inn",
      "entity_type": "location",
      "singular": true,
      "description": "The Hog's Head Inn is mentioned as the location where Dumbledore met the applicant for the post of Divination teacher. It is described as being above a bar."
    },
    {
      "name": "divination",
      "entity_type": "subject",
      "singular": true,
      "description": "Divination is introduced as a subject that Dumbledore has an inclination against allowing to continue at Hogwarts."
    },
    {
      "name": "fawkes's perch",
      "entity_type": "location",
      "singular": true,
      "description": "Fawkes's perch is mentioned as the location where Dumbledore retrieved the Pensieve from a black cabinet."
    },
    {
      "name": "pensieve",
      "entity_type": "object",
      "singular": true,
      "description": "The Pensieve is introduced as an object that Dumbledore retrieves from a black cabinet. It is described as being used to store memories."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as the person who had been tormenting Harry's father with the Pensieve in the past."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "hog's head inn",
      "relationship_type": "visited",
      "description": "Dumbledore visited the Hog's Head Inn to meet an applicant for the post of Divination teacher."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "divination",
      "relationship_type": "opposed",
      "description": "Dumbledore has an inclination against allowing the subject of Divination to continue at Hogwarts."
    },
    {
      "entity_1": "snape",
      "entity_2": "pensieve",
      "relationship_type": "used",
      "description": "Snape had been using the Pensieve to torment Harry's father in the past."
    }
  ]
}