{
  "entities": [
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is described as trying to push Harry out of the way and snarling at him. He is also looking towards the door with his wand pointing into Snape's face."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is described as saying 'Why, yes, I suppose I am' (a coward) and having his wand pointed at Sirius."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as not budging when Sirius tries to push him out of the way and trying to force Snape and Sirius apart with his hands."
    },
    {
      "name": "weasley family",
      "entity_type": "family",
      "singular": false,
      "description": "The Weasley family is described as coming inside the kitchen, all looking very happy, with Mr. Weasley walking proudly in their midst dressed in a pair of striped pajamas covered by a mackintosh."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as coming inside the kitchen with the rest of the Weasley family."
    }
  ],
  "relationships": [
    {
      "entity_1": "sirius",
      "entity_2": "snape",
      "relationship_type": "confrontation",
      "description": "Sirius and Snape are looking towards each other with their wands pointed at each other's faces, indicating a confrontation between them."
    },
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "obstruction",
      "description": "Harry is standing immobile between Sirius and Snape, trying to force them apart with his hands."
    },
    {
      "entity_1": "snape",
      "entity_2": "sirius",
      "relationship_type": "confrontation",
      "description": "Snape and Sirius are looking towards each other with their wands pointed at each other's faces, indicating a confrontation between them."
    },
    {
      "entity_1": "weasley family",
      "entity_2": "kitchen",
      "relationship_type": "entry",
      "description": "The Weasley family is described as coming inside the kitchen."
    },
    {
      "entity_1": "mr. weasley",
      "entity_2": "hermione",
      "relationship_type": "accompaniment",
      "description": "Mr. Weasley and Hermione are described as coming inside the kitchen together."
    }
  ]
}