{
  "entities": [
    {
      "name": "centaur",
      "entity_type": "noun",
      "singular": true,
      "description": "The centaur is mentioned as part of a phrase 'THE CENTAUR AND THE SNEAK', indicating it's a specific entity being referred to."
    },
    {
      "name": "fudge",
      "entity_type": "proper_noun",
      "singular": true,
      "description": "Fudge is introduced as the one who says 'Enough of this rubbish!' and pulls out his own wand. This indicates he has a significant role in the scene."
    },
    {
      "name": "dawlish",
      "entity_type": "proper_noun",
      "singular": true,
      "description": "Dawlish is mentioned as someone Fudge orders to take Harry, indicating Dawlish's involvement in the action."
    },
    {
      "name": "shacklebolt",
      "entity_type": "proper_noun",
      "singular": true,
      "description": "Shacklebolt is also ordered by Fudge to take Harry, showing his role in the scene."
    },
    {
      "name": "harry",
      "entity_type": "proper_noun",
      "singular": true,
      "description": "Harry is introduced as someone who is being taken by Dawlish and Shacklebolt. He's also mentioned later when he struggles around to see who's half-strangling him."
    },
    {
      "name": "marietta",
      "entity_type": "proper_noun",
      "singular": true,
      "description": "Marietta is mentioned as someone McGonagall forces out of harm's way along with Harry. This indicates Marietta's presence in the scene."
    },
    {
      "name": "mcgonagall",
      "entity_type": "proper_noun",
      "singular": true,
      "description": "McGonagall is introduced as someone who forces both Harry and Marietta out of harm's way. She's also mentioned later when she's crouched beside Harry."
    },
    {
      "name": "fawkes",
      "entity_type": "proper_noun",
      "singular": true,
      "description": "Fawkes is mentioned as screeching in response to the commotion. This indicates Fawkes' presence and reaction to the scene."
    },
    {
      "name": "du st",
      "entity_type": "proper_noun",
      "singular": true,
      "description": "Du st is mentioned as a dark figure that falls to the ground with a crash in front of Harry. This indicates Du st's involvement in the action."
    }
  ],
  "relationships": [
    {
      "entity_1": "fudge",
      "entity_2": "dawlish",
      "relationship_type": "ordered",
      "description": "Fudge orders Dawlish to take Harry, indicating a relationship between Fudge and Dawlish based on authority."
    },
    {
      "entity_1": "fudge",
      "entity_2": "shacklebolt",
      "relationship_type": "ordered",
      "description": "Fudge also orders Shacklebolt to take Harry, showing another relationship between Fudge and Shacklebolt based on authority."
    },
    {
      "entity_1": "mcgonagall",
      "entity_2": "harry",
      "relationship_type": "protected",
      "description": "McGonagall forces Harry out of harm's way, indicating a protective relationship between McGonagall and Harry."
    },
    {
      "entity_1": "mcgonagall",
      "entity_2": "marietta",
      "relationship_type": "protected",
      "description": "McGonagall also forces Marietta out of harm's way, showing another protective relationship between McGonagall and Marietta."
    }
  ]
}