{
  "entities": [
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is mentioned as bouncing up and down on the balls of his feet, indicating he is excited or impatient. (\"Oho! said Fudge, bouncing up and down on the balls of his feet again.\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as being in a conversation with Fudge, and is described as smiling gently. (\"Then he saw, to his astonishment, that Dumbledore was sm iling gently too.\")"
    },
    {
      "name": "potter",
      "entity_type": "person",
      "singular": true,
      "description": "Potter is mentioned as being in trouble, and Fudge suggests that there may be a cock-and-bull story designed to pull him out of it. (\"Yes, do let’s hear the latest cock-and-bull story designed to pull Potter out of trouble!\")"
    },
    {
      "name": "widdershins",
      "entity_type": "person",
      "singular": true,
      "description": "Widdershins is mentioned as someone who was lying, according to Fudge. (\"Or was it Potter’s identical twin in the Hog’s Head that day? Or is there the usual simple explanation involv- ing a reversal of time, a dead man coming back to life, and a couple of invisible dementors? Willy Widdershins was lying, was he?\")"
    },
    {
      "name": "percy weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Percy Weasley is mentioned as letting out a hearty laugh at Fudge's joke. (\"Percy Weasley let ou t a hearty laugh.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being in the conversation with Dumbledore and Fudge, and is described as not denying that he was trying to recruit students. (\"Cornelius, I do not deny — and nor, I am sure, does Harry — that he was in the Hog’s Head that day, nor that he was trying to re- cruit students to a Defense Against the Dark Arts group.\")"
    },
    {
      "name": "dolores",
      "entity_type": "person",
      "singular": true,
      "description": "Dolores is mentioned as suggesting that Dumbledore's group is wrong. (\"I am merely pointing out that Dolores is quite wrong to suggest that such a group\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "fudge",
      "entity_2": "potter",
      "relationship_type": "scoff_at",
      "description": "Fudge is described as scoffing at the idea of Potter's story. (\"Yes, do let’s hear the latest cock-and-bull story designed to pull Potter out of trouble!\")"
    },
    {
      "entity_1": "fudge",
      "entity_2": "widdershins",
      "relationship_type": "accuse_of_lieing",
      "description": "Fudge accuses Widdershins of lying. (\"Or was it Potter’s identical twin in the Hog’s Head that day? Or is there the usual simple explanation involv- ing a reversal of time, a dead man coming back to life, and a couple of invisible dementors? Willy Widdershins was lying, was he?\")"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "defend",
      "description": "Dumbledore defends Harry's actions. (\"Cornelius, I do not deny — and nor, I am sure, does Harry — that he was in the Hog’s Head that day, nor that he was trying to re- cruit students to a Defense Against the Dark Arts group.\")"
    },
    {
      "entity_1": "dolores",
      "entity_2": "dumbledore",
      "relationship_type": "criticize",
      "description": "Dolores is criticized by Dumbledore for suggesting that his group is wrong. (\"I am merely pointing out that Dolores is quite wrong to suggest that such a group\")"
    }
  ]
}