{
  "entities": [
    {
      "name": "daily prophet",
      "entity_type": "news_source",
      "singular": true,
      "description": "The Daily Prophet is mentioned as making snide allusions to Harry for months. It is described as a source of information that makes Harry's situation real to him."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is Harry's friend and godfather's son. He is advising Ron to drop Harry and tell tales on him to Umbridge."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is being advised by Percy to drop Harry."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is the person to whom Percy is advising Ron to tell tales about Harry."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is Harry's godfather and is in a similar situation as Harry. He is the only person who can understand how Harry feels at the moment."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character of the story. He is feeling unbalanced and possibly violent according to Percy."
    }
  ],
  "relationships": [
    {
      "entity_1": "percy",
      "entity_2": "ron",
      "relationship_type": "advises",
      "description": "Percy is advising Ron to drop Harry and tell tales on him to Umbridge. This relationship is described as Percy's actions towards Ron."
    },
    {
      "entity_1": "percy",
      "entity_2": "umbridge",
      "relationship_type": "informs",
      "description": "Percy is informing Umbridge about Harry through Ron. This relationship is described as Percy's actions towards Umbridge."
    },
    {
      "entity_1": "sirius",
      "entity_2": "harry",
      "relationship_type": "understands",
      "description": "Sirius can understand how Harry feels at the moment because he is in a similar situation. This relationship is described as Sirius' ability to empathize with Harry."
    }
  ]
}