{
  "entities": [
    {
      "name": "centaur",
      "entity_type": "animal_type",
      "singular": true,
      "description": "A mythical creature with the upper body of a man and the lower body of a horse. It is mentioned in the context of Kingsley Shacklebolt."
    },
    {
      "name": "sneak",
      "entity_type": "noun",
      "singular": true,
      "description": "Not specified, but used as a noun to refer to something or someone that is sneaky or stealthy. It is mentioned in the context of the Centaur and The Sneak."
    },
    {
      "name": "kingsley shacklebolt",
      "entity_type": "person",
      "singular": true,
      "description": "A towering figure who is a member of the group. He has a deep, slow voice and seems to be aware of something that Harry Potter feels."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "The person who attacked Marietta with her wand. She seems to be trying to cover up what happened."
    },
    {
      "name": "marietta",
      "entity_type": "person",
      "singular": true,
      "description": "A person who was attacked by Umbridge's wand. She is standing exactly where she was released and seems neither perturbed nor relieved."
    },
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "The person who tries to settle something once and for all in the context of a meeting that happened."
    },
    {
      "name": "dolores umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "A person who is being addressed by Fudge. She seems to be trying to cover up what happened."
    },
    {
      "name": "miss edgecombe",
      "entity_type": "person",
      "singular": true,
      "description": "The person who tipped off Dolores Umbridge about the meeting."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "The person who feels something shoot past him and connects it to Kingsley's whisper."
    },
    {
      "name": "seventh floor",
      "entity_type": "location",
      "singular": false,
      "description": "A location where Dolores Umbridge went after being tipped off by Miss Edgecombe."
    }
  ],
  "relationships": [
    {
      "entity_1": "kingsley shacklebolt",
      "entity_2": "harry potter",
      "relationship_type": "awareness",
      "description": "Kingsley Shacklebolt seems to be aware of something that Harry Potter feels. This is mentioned in the context of Kingsley's whisper and the thing he felt shoot past him."
    },
    {
      "entity_1": "umbridge",
      "entity_2": "marietta",
      "relationship_type": "attack",
      "description": "Umbridge attacked Marietta with her wand. This is mentioned in the context of Umbridge's sudden attack."
    },
    {
      "entity_1": "fudge",
      "entity_2": "dolores umbridge",
      "relationship_type": "address",
      "description": "Fudge tries to settle something once and for all by addressing Dolores Umbridge about a meeting that happened."
    },
    {
      "entity_1": "miss edgecombe",
      "entity_2": "dolores umbridge",
      "relationship_type": "tip_off",
      "description": "Miss Edgecombe tipped off Dolores Umbridge about the meeting."
    },
    {
      "entity_1": "dolores umbridge",
      "entity_2": "seventh floor",
      "relationship_type": "location",
      "description": "Dolores Umbridge went to the seventh floor after being tipped off by Miss Edgecombe."
    }
  ]
}