{
  "entities": [
    {
      "name": "o.w.l.s",
      "entity_type": "exam",
      "singular": true,
      "description": "O.W.L.S is mentioned as an exam that Harry, Ron, and Hermione have taken. It is described in the context of Professor Umbridge's conversation with them."
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is mentioned as an organization that will track down Harry, Ron, and Hermione. It is described in the context of Professor Umbridge's conversation with them."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned by Professor Marchbanks as someone who does not want to be found. He is described in the context of Professor Marchbanks' conversation about his past experiences with Dumbledore."
    },
    {
      "name": "professor marchbanks",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Marchbanks is mentioned as a tiny professor who shouts that he doubts the Ministry of Magic will track down Harry, Ron, and Hermione. He is described in the context of his conversation with Professor Umbridge."
    },
    {
      "name": "professor umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Umbridge is mentioned as a person who is trying to show Harry, Ron, and Hermione to the staffroom. She is described in the context of her conversation with them."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a person who is being tracked down by the Ministry of Magic. He is described in the context of Professor Umbridge's conversation with him and his friends."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as a person who is being tracked down by the Ministry of Magic. He is described in the context of Professor Umbridge's conversation with him and his friends."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as a person who is being tracked down by the Ministry of Magic. She is described in the context of Professor Umbridge's conversation with her and her friends."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "ministry of magic",
      "relationship_type": "target_of_search",
      "description": "The Ministry of Magic is searching for Dumbledore, as mentioned by Professor Marchbanks in the context of his past experiences with him."
    },
    {
      "entity_1": "harry",
      "entity_2": "ministry of magic",
      "relationship_type": "target_of_search",
      "description": "The Ministry of Magic is searching for Harry, as mentioned by Professor Umbridge in the context of her conversation with him and his friends."
    },
    {
      "entity_1": "ron",
      "entity_2": "ministry of magic",
      "relationship_type": "target_of_search",
      "description": "The Ministry of Magic is searching for Ron, as mentioned by Professor Umbridge in the context of her conversation with him and his friends."
    },
    {
      "entity_1": "hermione",
      "entity_2": "ministry of magic",
      "relationship_type": "target_of_search",
      "description": "The Ministry of Magic is searching for Hermione, as mentioned by Professor Umbridge in the context of her conversation with her and her friends."
    },
    {
      "entity_1": "professor marchbanks",
      "entity_2": "dumbledore",
      "relationship_type": "examiner",
      "description": "Professor Marchbanks examined Dumbledore personally when he did his N.E.W.T.s, as mentioned in the context of his conversation about his past experiences with him."
    }
  ]
}