{
  "entities": [
    {
      "name": "potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is the main character in the story. He is being discussed by Professor McGonagall and Umbridge about his potential to become an Auror."
    },
    {
      "name": "mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is a teacher at Hogwarts who supports Harry Potter's dream of becoming an Auror. She is described as getting to her feet and speaking in ringing tones."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Umbridge is a teacher at Hogwarts who opposes Harry Potter's dream of becoming an Auror. She is described as having a fussy, simpering demeanor and speaking in a furiously rising voice."
    },
    {
      "name": "auror",
      "entity_type": "job_title",
      "singular": true,
      "description": "An Auror is a magical law enforcement officer who is mentioned as a potential career path for Harry Potter. Professor McGonagall offers to help Potter become an Auror."
    },
    {
      "name": "minister of magic",
      "entity_type": "job_title",
      "singular": true,
      "description": "The Minister of Magic is the head of the magical government, mentioned as a potential employer for Harry Potter. Professor Umbridge mentions that the current Minister will never employ Potter."
    }
  ],
  "relationships": [
    {
      "entity_1": "mcgonagall",
      "entity_2": "potter",
      "relationship_type": "support",
      "description": "Professor McGonagall offers to help Harry Potter become an Auror, showing her support for him."
    },
    {
      "entity_1": "umbridge",
      "entity_2": "potter",
      "relationship_type": "opposition",
      "description": "Professor Umbridge opposes Harry Potter's dream of becoming an Auror and says the Minister will never employ him."
    }
  ]
}