{
  "entities": [
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is introduced as a character who has an opinion and is reacting to Umbridge's statement. She is described as having 'eyes flew open' which suggests she is surprised or upset."
    },
    {
      "name": "dolores",
      "entity_type": "house",
      "singular": true,
      "description": "Dolores is introduced as Professor McGonagall's house, suggesting it is a place of importance to her. It is mentioned in the context of 'what I think that counts, as they are in my House'."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is introduced as a character who has an opinion and is contradicting Professor McGonagall. She is described as 'simpered' which suggests she is being insincere or trying to manipulate others."
    },
    {
      "name": "cornelius",
      "entity_type": "person",
      "singular": true,
      "description": "Cornelius is mentioned as someone who has sent something to Umbridge, but his role in the story is not clear. He may be a minor character or a person of importance."
    },
    {
      "name": "minerva",
      "entity_type": "person",
      "singular": true,
      "description": "Minerva is Professor McGonagall's given name, suggesting that she is a complex character with multiple identities. It is mentioned in the context of Umbridge addressing her."
    },
    {
      "name": "the minister",
      "entity_type": "person",
      "singular": true,
      "description": "The Minister is mentioned as someone who has sent something to Umbridge, but their role in the story is not clear. They may be a minor character or a person of importance."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "dolores",
      "relationship_type": "ownership",
      "description": "Professor McGonagall is described as having 'my House, Dolores' which suggests that she owns or has control over the house."
    },
    {
      "entity_1": "umbridge",
      "entity_2": "cornelius",
      "relationship_type": "recipient",
      "description": "Umbridge receives something from Cornelius, suggesting a relationship of recipient and sender."
    },
    {
      "entity_1": "umbridge",
      "entity_2": "the minister",
      "relationship_type": "sender",
      "description": "The Minister sends something to Umbridge, suggesting a relationship of sender and recipient."
    }
  ]
}