{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who is concerned about Ginny's injury. He says 'Ginny?' and asks 'What happened?' (Excerpt: \"Ginny?\" Harry said fearfully. \"What happened?\")"
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is injured, her ankle is broken. She shakes her head and slides down the wall into a sitting position (Excerpt: But Ginny shook her head and slid down the wall into a sitting po-sition, panting and holding her ankle.)"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is injured, something dark is trickling from the corner of his mouth. He clutches Harry's robes (Excerpt: Ron’s face was very white and some thing dark was trickling from the corner of his mouth.)"
    },
    {
      "name": "luna",
      "entity_type": "person",
      "singular": true,
      "description": "Luna is unhurt, she bends over Ginny to help her (Excerpt: \"I think her ankle’s broken, I heard something crack,\" whispered Luna, who was bending over her and who alone seemed to be unhurt.)"
    },
    {
      "name": "uranus",
      "entity_type": "planet",
      "singular": true,
      "description": "Uranus is a planet that Ron and Ginny saw up close (Excerpt: \"Harry, we saw Uranus up close!\" said Ron, still giggling feebly.)"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ginny",
      "relationship_type": "concerned_about",
      "description": "Harry is concerned about Ginny's injury (Excerpt: Harry said fearfully. \"What happened?\")"
    },
    {
      "entity_1": "luna",
      "entity_2": "ginny",
      "relationship_type": "helping",
      "description": "Luna is helping Ginny, who has a broken ankle (Excerpt: \"I think her ankle’s broken, I heard something crack,\" whispered Luna, who was bending over her and who alone seemed to be unhurt.)"
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "clutching",
      "description": "Ron clutches Harry's robes (Excerpt: Next moment his knees had given way, but he still clutched the front of Harry’s robes, so that Harry was pulled into a kind of bow.)"
    },
    {
      "entity_1": "ron",
      "entity_2": "uranus",
      "relationship_type": "saw_up_close",
      "description": "Ron saw Uranus up close (Excerpt: \"Harry, we saw Uranus up close!\" said Ron, still giggling feebly.)"
    }
  ]
}