{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone who no longer meets Harry's eyes. This suggests that Dumbledore may be aware of or concerned about Harry's connection to Voldemort."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character and is described as having vivid green eyes, which are compared to Voldemort's red eyes. He is also worried that he might be carrying a 'deadly germ' of Voldemort's influence."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is the main antagonist and is described as having a snakelike face. Harry is concerned about being influenced by Voldemort's dark magic."
    },
    {
      "name": "quirrell",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Quirrell is mentioned as someone whose head was taken over by Voldemort in the past."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "voldemort",
      "relationship_type": "influence",
      "description": "Harry feels that he has been influenced by Voldemort's dark magic and is worried about carrying a 'deadly germ' of it."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "concern",
      "description": "Dumbledore seems to be concerned or aware of Harry's connection to Voldemort, which is why he no longer meets Harry's eyes."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "quirrell",
      "relationship_type": "possession",
      "description": "Voldemort took over Professor Quirrell's head in the past, suggesting a relationship of possession or control between Voldemort and Quirrell."
    },
    {
      "entity_1": "harry",
      "entity_2": "voldemort",
      "relationship_type": "identification",
      "description": "Harry identifies with Voldemort to some extent, as he wonders what it would feel like if Voldemort burst out of his skull."
    }
  ]
}