{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as trying to sort out a situation, implying he has power and authority. (\"Dumbledore was trying to sort it all out.\")"
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is mentioned as having power over Dumbledore, implying they have control over him. (\"How much power did Dumbledore have to override the Ministry of Magic?\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being in a situation where he has to make decisions and face challenges. (\"A small shoot of hope burgeoned in Harry’s chest...\")"
    },
    {
      "name": "hogwarts",
      "entity_type": "school",
      "singular": true,
      "description": "Hogwarts is mentioned as a place where Dumbledore might be allowed back to. (\"Was there a chance that he might be allowed back to Hogwarts?\")"
    },
    {
      "name": "azkaban",
      "entity_type": "prison",
      "singular": true,
      "description": "Azkaban is mentioned as a possible consequence of Harry's actions. (\"He’d have to duel with the Ministry representatives, and if he did that, he’d be lucky to escape Azkaban...\")"
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is mentioned as having Harry's best interests at heart. (\"He knew that Mr. Weasley had his best interests at heart.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "ministry of magic",
      "relationship_type": "has_power_over",
      "description": "Dumbledore has power to override the Ministry of Magic, implying he has authority over them. (\"How much power did Dumbledore have to override the Ministry of Magic?\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "dumbledore",
      "relationship_type": "has_hope_in",
      "description": "Harry has hope in Dumbledore's ability to sort out the situation. (\"A small shoot of hope burgeoned in Harry’s chest, almost immediately strangled by panic — how was he supposed to refuse to surrender his wand without doing magic? He’d have to duel with the Ministry representatives, and if he did that, he’d be lucky to escape Azkaban, let alone expulsion.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "mr weasley",
      "relationship_type": "has_trust_in",
      "description": "Harry trusts Mr. Weasley's advice and has faith in his intentions. (\"He knew that Mr. Weasley had his best interests at heart.\")"
    }
  ]
}