{
  "entities": [
    {
      "name": "dumbledore's army",
      "entity_type": "group",
      "singular": false,
      "description": "Dumbledore's Army is mentioned as a group of people who are fighting against Voldemort. It is described as an entity that has been formed to counter the Dark Lord's plans."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is the main antagonist of the story and is mentioned as a person who wants something that he does not have. He is described as having anger towards someone or something."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is one of the main characters in the story and is mentioned as a person who is thinking about Voldemort's plans. He is described as being absorbed in what is going on at Hogwarts."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is a character in the story who is mentioned as someone who is causing injustice and Ministry interference."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is one of the main characters in the story and is mentioned as someone who has gone to bed early."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is one of the main characters in the story and is mentioned as someone who says a phrase that brings Harry back to his senses."
    },
    {
      "name": "mimbulus mimbletonia",
      "entity_type": "thing",
      "singular": true,
      "description": "Mimbulus Mimbletonia is a mysterious thing that Ron mentions. It seems to be some kind of password or code."
    },
    {
      "name": "the ministry",
      "entity_type": "organization",
      "singular": false,
      "description": "The Ministry is an organization that is mentioned as being involved in the story. They are described as causing interference and injustice."
    }
  ],
  "relationships": [
    {
      "entity_1": "voldemort",
      "entity_2": "harry",
      "relationship_type": "target",
      "description": "Voldemort's anger towards Harry makes sense if he is not nearer laying hands on the weapon, whatever it was. This suggests that Voldemort is targeting Harry."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "the ministry",
      "relationship_type": "opponent",
      "description": "The Ministry interference and injustice are mentioned as something that Voldemort's anger would make sense if he was no nearer laying hands on the weapon. This suggests that Voldemort is an opponent of the Ministry."
    },
    {
      "entity_1": "harry",
      "entity_2": "voldemort",
      "relationship_type": "target",
      "description": "Harry is thinking about Voldemort's plans and wondering what Voldemort wants to do. This suggests that Harry is a target of Voldemort's plans."
    },
    {
      "entity_1": "hermione",
      "entity_2": "harry",
      "relationship_type": "friend",
      "description": "Hermione has gone to bed early, leaving Harry alone in the common room. This suggests that Hermione and Harry are friends."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "friend",
      "description": "Ron's voice brings Harry back to his senses, suggesting that Ron and Harry are friends."
    },
    {
      "entity_1": "dumbledore's army",
      "entity_2": "voldemort",
      "relationship_type": "opponent",
      "description": "Dumbledore's Army is mentioned as a group of people who are fighting against Voldemort. This suggests that Dumbledore's Army is an opponent of Voldemort."
    }
  ]
}