{
  "entities": [
    {
      "name": "the dark lord",
      "entity_type": "dark_lord",
      "singular": true,
      "description": "The Dark Lord is mentioned as a powerful figure who has returned, and Harry is aware of his presence. (\"The Dark Lord, walk into the Mini stry of Magic...\", \"But the Dark Lord knows you are not unintell\")"
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is mentioned as a character who is aware of the Dark Lord's return and is interacting with other characters. (\"So he’s got you doing his dirty wo rk for him, has he?\", \"NOW!\")"
    },
    {
      "name": "malfoy",
      "entity_type": "character",
      "singular": true,
      "description": "Malfoy is mentioned as a character who is interacting with Harry. (\"Very good, Potter, very good . . .\")"
    },
    {
      "name": "sturgis",
      "entity_type": "character",
      "singular": true,
      "description": "Sturgis is mentioned as someone the Dark Lord tried to get to steal something. (\"Like he tried to get Sturgis to steal it — and Bode?\")"
    },
    {
      "name": "bode",
      "entity_type": "character",
      "singular": true,
      "description": "Bode is mentioned as someone the Dark Lord tried to get to steal something. (\"Like he tried to get Sturgis to steal it — and Bode?\")"
    },
    {
      "name": "the ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is mentioned as a place where the Dark Lord has walked in. (\"The Dark Lord, walk into the Mini stry of Magic...\")"
    },
    {
      "name": "aurors",
      "entity_type": "organization",
      "singular": false,
      "description": "Aurors are mentioned as people who are wasting their time on Harry's cousin. (\"The Dark  Lord, reveal himself to the Au- rors...\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "the dark lord",
      "entity_2": "harry",
      "relationship_type": "awareness",
      "description": "Harry is aware of the Dark Lord's return. (\"The Dark Lord, walk into the Mini stry of Magic...\", \"But the Dark Lord knows you are not unintell\")"
    },
    {
      "entity_1": "the dark lord",
      "entity_2": "malfoy",
      "relationship_type": "interaction",
      "description": "The Dark Lord and Malfoy interact with each other. (\"Very good, Potter, very good . . .\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "sturgis",
      "relationship_type": "connection",
      "description": "Harry is connected to Sturgis through the Dark Lord's actions. (\"Like he tried to get Sturgis to steal it — and Bode?\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "bode",
      "relationship_type": "connection",
      "description": "Harry is connected to Bode through the Dark Lord's actions. (\"Like he tried to get Sturgis to steal it — and Bode?\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "the ministry of magic",
      "relationship_type": "location",
      "description": "Harry is located in the Ministry of Magic. (\"The Dark Lord, walk into the Mini stry of Magic...\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "aurors",
      "relationship_type": "connection",
      "description": "Harry is connected to Aurors through his cousin's situation. (\"The Dark  Lord, reveal himself to the Au- rors...\")"
    }
  ]
}