{
  "entities": [
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as a teacher who instructs Harry in Occlumency lessons. He is described as someone who Harry has strong feelings of resentment towards."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is mentioned alongside Snape as someone Harry has strong feelings of resentment towards."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who is sleeping next to Harry and whose snores are eventually replaced by deep breathing."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character of the story. He is trying to empty his mind before sleep but finds it difficult due to his feelings towards Snape and Umbridge."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is mentioned as someone who is waltzing with Professor Sprout in Harry's dream."
    },
    {
      "name": "professor sprout",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Sprout is mentioned as someone who is waltzing with Neville in Harry's dream."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as playing the bagpipes in Harry's dream."
    },
    {
      "name": "d.a.",
      "entity_type": "group",
      "singular": false,
      "description": "The D.A. is a group of students that Harry wants to find in his dream."
    },
    {
      "name": "room of requirement",
      "entity_type": "location",
      "singular": true,
      "description": "The Room of Requirement is the location where Neville and Professor Sprout are waltzing in Harry's dream."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "resentment",
      "description": "Harry has strong feelings of resentment towards Snape, which makes it difficult for him to empty his mind before sleep."
    },
    {
      "entity_1": "harry",
      "entity_2": "umbridge",
      "relationship_type": "resentment",
      "description": "Harry also has strong feelings of resentment towards Umbridge, which contributes to his difficulty in falling asleep."
    },
    {
      "entity_1": "neville",
      "entity_2": "professor sprout",
      "relationship_type": "waltzing",
      "description": "Neville and Professor Sprout are waltzing together in Harry's dream."
    }
  ]
}