{
  "entities": [
    {
      "name": "quidditch",
      "entity_type": "team",
      "singular": true,
      "description": "The Quidditch team is mentioned as a goal for Harry and Ron to stay on. The text states \"practice if we want to stay on the Quidditch team\"."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is one of the main characters in the story and is mentioned as playing goalposts for the Quidditch team. The text states \"Yeah, that’s right,\" said Ron in a heartened tone.\""
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is one of the main characters in the story and is mentioned as playing Chaser for the Quidditch team. The text states \"Harry glanced over to his right as they approached the Quidditch pitch\"."
    },
    {
      "name": "forbidden forest",
      "entity_type": "location",
      "singular": true,
      "description": "The Forbidden Forest is a location in the story and is mentioned as being near the Quidditch pitch. The text states \"He glanced over to his right as they approached the Quidditch pitch, to where the trees of the Fo rbidden Forest were swaying darkly\"."
    },
    {
      "name": "owlery tower",
      "entity_type": "location",
      "singular": true,
      "description": "The Owlery Tower is a location in the story and is mentioned as being near the Quidditch pitch. The text states \"the sky was empty but for a few distant owls fluttering around the Owlery  Tower\"."
    },
    {
      "name": "harry's flying horse",
      "entity_type": "object",
      "singular": true,
      "description": "Harry's flying horse is an object in the story and is mentioned as being something Harry has to worry about. The text states \"He had enough to worry about; the flying horse wasn’t doing  him any harm\"."
    },
    {
      "name": "harry's quaffle",
      "entity_type": "object",
      "singular": true,
      "description": "Harry's Quaffle is an object in the story and is mentioned as being something Harry tries to get past Ron. The text states \"Ron guarding the three tall goalposts, Harry playing Chaser and trying to get the Quaf fle past Ron\"."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is one of the main characters in the story and is mentioned as making it clear that she thinks something. The text states \"During which Hermione made  it quite clear that she thought\"."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "quidditch",
      "relationship_type": "member_of",
      "description": "Harry is a member of the Quidditch team. The text states \"practice if we want to stay on the Quidditch team\"."
    },
    {
      "entity_1": "ron",
      "entity_2": "quidditch",
      "relationship_type": "member_of",
      "description": "Ron is a member of the Quidditch team. The text states \"Yeah, that’s right,\" said Ron in a heartened tone.\""
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "friend",
      "description": "Harry and Ron are friends. The text states \"They collected balls from the cupb oard in the changing room\"."
    },
    {
      "entity_1": "harry",
      "entity_2": "quidditch",
      "relationship_type": "player_of",
      "description": "Harry is a player of Quidditch. The text states \"Ron guarding the three tall goalposts, Harry playing Chaser and trying to get the Quaf fle past Ron\"."
    },
    {
      "entity_1": "ron",
      "entity_2": "quidditch",
      "relationship_type": "player_of",
      "description": "Ron is a player of Quidditch. The text states \"Ron guarding the three tall goalposts, Harry playing Chaser and trying to get the Quaf fle past Ron\"."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "competitor_of",
      "description": "Harry and Ron are competitors in a game of Quidditch. The text states \"After a couple of hours they returned to the school, where they ate lunch\"."
    }
  ]
}