{
  "entities": [
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is mentioned as a person who would lose her job at the Ministry if she started speaking out. She is also mentioned as someone who has been convinced to be a spy inside the Ministry."
    },
    {
      "name": "arthur",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur is mentioned as a person who would lose his job at the Ministry if he started speaking out."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as a person who is explaining why it's important to have spies inside the Ministry. He also mentions that Tonks and Arthur would lose their jobs if they spoke out."
    },
    {
      "name": "volde-mort",
      "entity_type": "person",
      "singular": true,
      "description": "Volde-mort is mentioned as someone who will likely have spies inside the Ministry."
    },
    {
      "name": "mr. weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is mentioned as someone who has managed to convince a couple of people to be spies inside the Ministry."
    },
    {
      "name": "kingsley shacklebolt",
      "entity_type": "person",
      "singular": true,
      "description": "Kingsley Shacklebolt is mentioned as someone who has been a real asset and is in charge of the hunt for Sirius. He's also feeding the Ministry information that Sirius is in Tibet."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who is asking questions about why Dumbledore is in trouble."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is mentioned as someone who explains that they're trying to discredit Dumbledore."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone who is in trouble and being discredited."
    }
  ],
  "relationships": [
    {
      "entity_1": "sirius",
      "entity_2": "volde-mort",
      "relationship_type": "has_spies",
      "description": "Sirius mentions that Volde-mort will have spies inside the Ministry."
    },
    {
      "entity_1": "mr. weasley",
      "entity_2": "tonks",
      "relationship_type": "convinced",
      "description": "Mr. Weasley has convinced Tonks to be a spy inside the Ministry."
    },
    {
      "entity_1": "kingsley shacklebolt",
      "entity_2": "sirius",
      "relationship_type": "in_charge_of_hunt",
      "description": "Kingsley Shacklebolt is in charge of the hunt for Sirius and feeding the Ministry information that Sirius is in Tibet."
    },
    {
      "entity_1": "lupin",
      "entity_2": "dumbledore",
      "relationship_type": "trying_to_discredit",
      "description": "Lupin explains that they're trying to discredit Dumbledore."
    }
  ]
}