{
  "entities": [
    {
      "name": "nick",
      "entity_type": "person",
      "singular": true,
      "description": "Nick is a person who is being teased by Ron and Hermione. He is described as someone who is used to students making fun of him, but he takes offense when Ron makes a joke about his death."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who tries to defend Nick from Ron's teasing. She throws a furious look at Ron and tells him that he wasn't really laughing at Nick."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person who teases Nick about his death, but claims he was just asking a simple question. He makes a joke that doesn't seem to be funny to Nick and gets into an argument with Hermione."
    },
    {
      "name": "colin creevey",
      "entity_type": "person",
      "singular": true,
      "description": "Colin Creevey is a person who sits at the same table as Nick. He is mentioned as someone who is sitting next to Nick after he gets up and leaves."
    },
    {
      "name": "dennis creevey",
      "entity_type": "person",
      "singular": true,
      "description": "Dennis Creevey is a person who sits at the same table as Nick. He is mentioned as someone who is sitting next to Colin after Nick gets up and leaves."
    }
  ],
  "relationships": [
    {
      "entity_1": "nick",
      "entity_2": "ron",
      "relationship_type": "teasing",
      "description": "Ron teases Nick about his death, making a joke that doesn't seem to be funny to Nick. This is described as Ron 'poking fu n at my death'."
    },
    {
      "entity_1": "hermione",
      "entity_2": "ron",
      "relationship_type": "defending",
      "description": "Hermione tries to defend Nick from Ron's teasing, telling him that he wasn't really laughing at Nick."
    },
    {
      "entity_1": "nick",
      "entity_2": "colin creevey",
      "relationship_type": "sitting_next_to",
      "description": "After getting up and leaving the table, Nick comes to rest between Colin and Dennis Creevey."
    }
  ]
}