{
  "entities": [
    {
      "name": "dark lord",
      "entity_type": "person",
      "singular": true,
      "description": "The Dark Lord is mentioned as a powerful figure who has been unaware of Harry's connection to him until recently. (\"It appears that the Dark Lord has been unaware of the connection between you and himself until very recently.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who has been experiencing the Dark Lord's emotions and sharing his thoughts without being aware of it. (\"Up till now it seems that you have been experiencing his em otions and sharing his thoughts without his being any the wiser.\")"
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as a person who is speaking to Harry and trying to explain something to him. (\"Do not interrupt me, Potter,\" said Snape in a dangerous voice.)"
    },
    {
      "name": "mr. weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is mentioned as someone who was involved in the vision that Harry had before Christmas. (\"The one with the snake and Mr. Weasley?\")"
    },
    {
      "name": "christmas",
      "entity_type": "event",
      "singular": true,
      "description": "Christmas is mentioned as a time when Harry had a vision that was significant enough to be noticed by the Dark Lord. (\"the vision you had shortly before Christmas —\")"
    },
    {
      "name": "snake",
      "entity_type": "animal",
      "singular": true,
      "description": "The snake is mentioned as an animal that was involved in Harry's vision before Christmas. (\"I saw inside the snake’s head, not his!\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "dark lord",
      "entity_2": "harry",
      "relationship_type": "connection",
      "description": "The Dark Lord and Harry are connected in some way that the Dark Lord was unaware of until recently. (\"It appears that the Dark Lord has been unaware of the connection between you and himself until very recently.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "dark lord",
      "relationship_type": "shared_thoughts",
      "description": "Harry has been sharing his thoughts with the Dark Lord without being aware of it. (\"Up till now it seems that you have been experiencing his em otions and sharing his thoughts without his being any the wiser.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "interaction",
      "description": "Harry is interacting with Snape, who is trying to explain something to him. (\"Do not interrupt me, Potter,\" said Snape in a dangerous voice.)"
    }
  ]
}