{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as looking pale and sweaty, similar to when he accidentally put a slug-vomiting charm on himself. (Excerpt: 'He looked just as pale and sweaty  as he had done then...')"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as trying to encourage Ron with breakfast, and also trying to get him past the Slytherin table quickly. (Excerpts: 'You just need some breakfast,' Harry said bracingly. ... He tried to see what was written on the badges...')"
    },
    {
      "name": "slitherin",
      "entity_type": "house",
      "singular": true,
      "description": "The Slytherin house is described as wearing silver badges in the shape of crowns. (Excerpt: 'As they passed the Slytherin table there was an upsurge of noise; Harry looked around and saw that nearly everyone there was wearing...')"
    },
    {
      "name": "gryffindor",
      "entity_type": "house",
      "singular": true,
      "description": "The Gryffindor house is described as giving a rousing welcome to Ron and Harry. (Excerpt: 'They received a rousing welcome at the Gryffindor table...')"
    },
    {
      "name": "great hall",
      "entity_type": "location",
      "singular": true,
      "description": "The Great Hall is described as filling up with people, talk, and noise. (Excerpt: 'The Great Hall was filling up fa st when they arrived, the talk louder and the mood more exuberant than usual.')"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "encourages",
      "description": "Harry is encouraging Ron to eat breakfast. (Excerpt: 'You just need some breakfast,' Harry said bracingly.)"
    },
    {
      "entity_1": "harry",
      "entity_2": "slitherin",
      "relationship_type": "tries_to_avoid",
      "description": "Harry is trying to get Ron past the Slytherin table quickly. (Excerpt: 'He tried to see what was written on the badges...')"
    },
    {
      "entity_1": "ron",
      "entity_2": "slitherin",
      "relationship_type": "is_welcomed_by",
      "description": "The Slytherin house is welcoming Ron, as evidenced by their waving and laughing. (Excerpt: 'For some  reason many of them waved at Ron, laughing uproariously.')"
    },
    {
      "entity_1": "ron",
      "entity_2": "gryffindor",
      "relationship_type": "is_welcomed_by",
      "description": "The Gryffindor house is welcoming Ron. (Excerpt: 'They received a rousing welcome at the Gryffindor table...')"
    }
  ]
}