{
  "entities": [
    {
      "name": "Arthur",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur is mentioned as someone who needs to be said good-bye to, indicating he is a person of importance."
    },
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as having saved his father's life, indicating he is a person of significance."
    },
    {
      "name": "Mad-Eye",
      "entity_type": "person",
      "singular": true,
      "description": "Mad-Eye is mentioned as going into the ward with Tonks, indicating he is a person present in the scene."
    },
    {
      "name": "Tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is mentioned as going into the ward with Mad-Eye, indicating she is a person present in the scene."
    },
    {
      "name": "Fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as rummaging through his pockets and participating in the plan to eavesdrop on St. Mungo's ward door, indicating he is a person involved in the action."
    },
    {
      "name": "George",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as holding out what looks like a tangle of flesh-colored string and participating in the plan to eavesdrop on St. Mungo's ward door, indicating he is a person involved in the action."
    },
    {
      "name": "St. Mungo's",
      "entity_type": "hospital",
      "singular": true,
      "description": "St. Mungo's is mentioned as having Imperturbable Charms on its ward doors, indicating it is a hospital with specific magical features."
    }
  ],
  "relationships": [
    {
      "entity_1": "Fred",
      "entity_2": "George",
      "relationship_type": "collaboration",
      "description": "Fred and George are working together to eavesdrop on St. Mungo's ward door, as indicated by their joint actions and dialogue."
    },
    {
      "entity_1": "Harry",
      "entity_2": "St. Mungo's",
      "relationship_type": "eavesdropping",
      "description": "Harry is given an Extendable Ear to eavesdrop on his father in St. Mungo's ward, indicating a relationship between Harry and the hospital."
    },
    {
      "entity_1": "Fred",
      "entity_2": "St. Mungo's",
      "relationship_type": "eavesdropping",
      "description": "Fred is participating in the plan to eavesdrop on St. Mungo's ward door, indicating a relationship between Fred and the hospital."
    },
    {
      "entity_1": "George",
      "entity_2": "St. Mungo's",
      "relationship_type": "eavesdropping",
      "description": "George is participating in the plan to eavesdrop on St. Mungo's ward door, indicating a relationship between George and the hospital."
    }
  ]
}