{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as leaving the hospital wing with Hermione. He is described as making hushing noises when Hermione mentions Sirius' name."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as showing signs of wanting to talk about Sirius, but Ron makes hushing noises. She is also described as leaving the hospital wing with Ron."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as not sure whether or not he wants to talk about his godfather, Sirius. He is also described as feeling unhappy and missing Hogwarts when he has to return to Privet Drive."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as Harry's godfather. Hermione wants to talk about him, but Ron makes hushing noises."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Umbridge is mentioned as leaving Hogwarts the day before the end of term. She tries to depart undetected but meets Peeves on the way."
    },
    {
      "name": "peeves",
      "entity_type": "ghost",
      "singular": true,
      "description": "Peeves is mentioned as meeting Professor Umbridge on the way and seizing his last chance to do something."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "left_together",
      "description": "Ron and Hermione left the hospital wing together, three days before the end of term."
    },
    {
      "entity_1": "harry",
      "entity_2": "privet_drive",
      "relationship_type": "will_return_to",
      "description": "Harry will return to Privet Drive in a few days' time when he is back at number four, Privet Drive."
    },
    {
      "entity_1": "umbridge",
      "entity_2": "peeves",
      "relationship_type": "met_on_the_way",
      "description": "Professor Umbridge met Peeves on the way while trying to depart undetected from Hogwarts."
    }
  ]
}