{
  "entities": [
    {
      "name": "minerva mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is introduced as a superior and disdainful character who is also the headmistress. She is mentioned in the conversation with Umbridge, where she says 'You are raving' to Potter."
    },
    {
      "name": "cornelius fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is mentioned as someone who should be replaced by Dumbledore. He is not directly involved in the conversation, but his name is used as a point of comparison."
    },
    {
      "name": "albus dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone who should replace Fudge. He is not directly involved in the conversation, but his name is used as a point of comparison."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Potter is mentioned as someone who has a career consultation with McGonagall. He is also the one who is being addressed by Umbridge in the conversation."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is introduced as a character who is shouting at McGonagall and addressing Potter. She is described as 'still breathing as though she had just run a race'."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who whispers to Harry in the Defense Against the Dark Arts lesson. She is not directly involved in the conversation with McGonagall and Umbridge."
    }
  ],
  "relationships": [
    {
      "entity_1": "umbridge",
      "entity_2": "mcgonagall",
      "relationship_type": "argument",
      "description": "Umbridge and McGonagall are shouting at each other in the corridor. This is described as an argument."
    },
    {
      "entity_1": "umbridge",
      "entity_2": "potter",
      "relationship_type": "address",
      "description": "Umbridge addresses Potter in the conversation, saying 'Harry, I hope you've thought better of what you were planning to do'."
    }
  ]
}