{
  "entities": [
    {
      "name": "ministry",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry is mentioned as an entity that wouldn't want everyone to know a dirty great serpent. (\"the Ministry wouldn’t want everyo ne to know a dirty great serpent\")"
    },
    {
      "name": "arthur",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur Weasley is mentioned as the father of George and Fred. (\"So where were you when it happened, Dad?\" \"That’s my business,\" said Mr. Weasley)"
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George Weasley is mentioned as asking his father about what he was doing. (\"So where were you when it happened, Dad?\")"
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred Weasley is mentioned as interrupting his father and asking a question. (\"When you say you were ‘on duty ,’ “what were you doing?”\")"
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is mentioned as warning Arthur about discussing something in public. (\"Arthur!” said Mrs. Weasley warningly.\")"
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is mentioned as being on duty and reading the Daily Prophet. (\"I was just reading about Willy Widders hins’s arrest when you arrived.\")"
    },
    {
      "name": "willy widdershins",
      "entity_type": "person",
      "singular": true,
      "description": "Willy Widdershins is mentioned as being arrested and having a jinx backfire. (\"You know Willy turned out to be behind those regurgitating toilets last summer?\")"
    },
    {
      "name": "daily prophet",
      "entity_type": "newspaper",
      "singular": true,
      "description": "The Daily Prophet is mentioned as the newspaper that Mr. Weasley was reading. (\"H e  s n a t c h e d  u p  t h e  Daily Prophet,\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "mr weasley",
      "entity_2": "willy widdershins",
      "relationship_type": "arrested_by",
      "description": "Mr. Weasley was reading about Willy Widdershins’s arrest in the Daily Prophet. (\"I was just reading about Willy Widders hins’s arrest when you arrived.\")"
    },
    {
      "entity_1": "willy widdershins",
      "entity_2": "regurgitating toilets",
      "relationship_type": "responsible_for",
      "description": "Willy Widdershins turned out to be behind the regurgitating toilets last summer. (\"You know Willy turned out to be behind those regurgitating toilets last summer?\")"
    }
  ]
}