{
  "entities": [
    {
      "name": "diggory die",
      "entity_type": "person",
      "singular": true,
      "description": "Diggory die is mentioned as someone who has escaped death narrowly, implying they are a person of importance in the story. (\"Diggory die, having escaped death so narrowly yourself . . .\")"
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is mentioned as someone who has returned and tried to kill Harry Potter when he was a child. (\"now Vo ldemort had returned, I must do it soon.\")"
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as someone who has been struggling under burdens and is now ready to receive knowledge from Dumbledore. (\"I knew you have long been ready for the knowledge I have kept from you for so long, because you have proved that I should have placed the burden upon you before this.\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone who has been keeping a secret from Harry Potter and is now hesitant to reveal it. (\"My only defense is this: I have watched you struggling under more burdens than any student who has ever passed through this school, and I could not bring myself to add another — the greatest one of all.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "harry potter",
      "relationship_type": "kept_secret_from",
      "description": "Dumbledore has been keeping a secret from Harry Potter, which he is now hesitant to reveal. (\"I have watched you struggling under more burdens than any student who has ever passed through this school, and I could not bring myself to add another — the greatest one of all.\")"
    },
    {
      "entity_1": "voldemort",
      "entity_2": "harry potter",
      "relationship_type": "tried_to_kill",
      "description": "Voldemort tried to kill Harry Potter when he was a child because of a prophecy made shortly before his birth. (\"He knew the prophecy had been made, though he did not know its full contents. He set out to kill you when you were still a baby, believing he was fulfilling the terms of the prophecy.\")"
    }
  ]
}