{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as having a cabin on the edge of the Forbidden Forest. He is also referred to as 'Professor Grubbly-Plank stood waiting for the class some ten yards from Hagrid's front door'."
    },
    {
      "name": "professor grubbly-plank",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Grubbly-Plank is mentioned as standing waiting for the class, and having a long trestle table laden with twigs."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as walking down the sloping lawn toward Hagrid's cabin, and being the subject of a joke made by Draco Malfoy."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as walking down the sloping lawn toward Hagrid's cabin with Harry."
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Draco Malfoy is mentioned as making a joke about Harry, and being surrounded by his gang of Slytherin cronies."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is mentioned as laughing at Draco Malfoy's joke, and being part of the group of Slytherin students surrounding him."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is mentioned as laughing at Draco Malfoy's joke, and being part of the group of Slytherin students surrounding him."
    },
    {
      "name": "pansy parkinson",
      "entity_type": "person",
      "singular": true,
      "description": "Pansy Parkinson is mentioned as laughing at Draco Malfoy's joke, and being part of the group of Slytherin students surrounding him."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "professor grubbly-plank",
      "relationship_type": "location",
      "description": "Professor Grubbly-Plank is standing near Hagrid's front door."
    },
    {
      "entity_1": "draco malfoy",
      "entity_2": "harry",
      "relationship_type": "target_of_joke",
      "description": "Draco Malfoy makes a joke about Harry, and his gang of Slytherin students laugh at it."
    }
  ]
}