{
  "entities": [
    {
      "name": "death eaters",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "The escaped Death Eaters are the main focus of a poster offering a reward for information leading to their recapture. The text describes them as 'convicts' and mentions that there are ten pictures of them on display."
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is the organization responsible for issuing a reward for information leading to the recapture of the escaped Death Eaters. The text mentions that the poster is 'By Order of the Ministry of Magic'."
    },
    {
      "name": "orde",
      "entity_type": "person",
      "singular": true,
      "description": "Orde is the author of the poster offering a reward for information leading to the recapture of the escaped Death Eaters. The text mentions that the poster is 'By Orde r of the Ministry of Magic'."
    },
    {
      "name": "cho",
      "entity_type": "person",
      "singular": true,
      "description": "Cho is a person who is also gazing at the pictures of the Death Eaters. The text mentions that Cho said 'It's funny, isn't it' in a low voice."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who is also gazing at the pictures of the Death Eaters. The text mentions that Harry said 'Yeah, it is weird' in response to Cho's comment."
    },
    {
      "name": "bellatrix lestrange",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix Lestrange is one of the Death Eaters whose picture is on display. The text mentions that Harry tears his eyes away from her face to glance up and down the High Street."
    },
    {
      "name": "sirius black",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius Black is a person who escaped in the past, and the text mentions that there were dementors all over Hogsmeade looking for him."
    },
    {
      "name": "dementors",
      "entity_type": "group_of_beings",
      "singular": false,
      "description": "Dementors are supernatural beings that are mentioned as being present in Hogsmeade when Sirius Black escaped. The text mentions that there aren't any dementors nearby now."
    }
  ],
  "relationships": [
    {
      "entity_1": "ministry of magic",
      "entity_2": "death eaters",
      "relationship_type": "offered_reward",
      "description": "The Ministry of Magic offered a reward for information leading to the recapture of the escaped Death Eaters. The text mentions that the poster is 'By Order of the Ministry of Magic' and offers a thousand-Galleon reward."
    },
    {
      "entity_1": "cho",
      "entity_2": "death eaters",
      "relationship_type": "gazing_at",
      "description": "Cho was gazing at the pictures of the Death Eaters. The text mentions that Cho said 'It's funny, isn't it' in a low voice."
    },
    {
      "entity_1": "harry",
      "entity_2": "death eaters",
      "relationship_type": "gazing_at",
      "description": "Harry was also gazing at the pictures of the Death Eaters. The text mentions that Harry said 'Yeah, it is weird' in response to Cho's comment."
    },
    {
      "entity_1": "harry",
      "entity_2": "dementors",
      "relationship_type": "absence_of",
      "description": "Harry notes the absence of dementors nearby. The text mentions that there aren't any dementors nearby now."
    }
  ]
}