{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as a student who is waiting for her O.W.L. results. She is described as being agitated and checking her answers multiple times."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as a teacher who informs the students that their O.W.L. results will be sent to them via owl in July."
    },
    {
      "name": "dean thomas",
      "entity_type": "person",
      "singular": true,
      "description": "Dean Thomas is mentioned as a student who comments on not having to worry about the exam results until the holidays."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a student who is waiting for his O.W.L. results and is imagining himself in his bedroom at Privet Drive."
    },
    {
      "name": "privet drive",
      "entity_type": "location",
      "singular": true,
      "description": "Privet Drive is mentioned as Harry's home address where he will be waiting for his O.W.L. results."
    },
    {
      "name": "o.w.l.",
      "entity_type": "exam",
      "singular": true,
      "description": "O.W.L. (Ordinary Wizarding Level) is mentioned as the exam that the students are waiting for their results."
    },
    {
      "name": "theory of charms",
      "entity_type": "subject",
      "singular": true,
      "description": "Theory of Charms is mentioned as one of the subjects that the students will be taking an exam in."
    },
    {
      "name": "achievements in charming",
      "entity_type": "book",
      "singular": true,
      "description": "Achievements in Charming is mentioned as a book that Hermione uses to check her answers."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "privet drive",
      "relationship_type": "location_of",
      "description": "Harry will be waiting for his O.W.L. results at Privet Drive, which is mentioned as his home address."
    },
    {
      "entity_1": "hermione",
      "entity_2": "achievements in charming",
      "relationship_type": "uses",
      "description": "Hermione uses Achievements in Charming to check her answers for the Theory of Charms exam."
    }
  ]
}