{
  "entities": [
    {
      "name": "ginnys",
      "entity_type": "people",
      "singular": true,
      "description": "Ginny is described as giving a gasp of horror when she sees the Death Eaters pointing their wands at Harry's heart. (\"Ginny gave a gasp of horror.\")"
    },
    {
      "name": "lucius malfoy",
      "entity_type": "people",
      "singular": true,
      "description": "Lucius Malfoy is described as holding out his hand and repeating the phrase 'To me' to Harry. (\"To me, Potter,\" repeated the drawling voice of Lucius Malfoy as he held out his hand, palm up.\")"
    },
    {
      "name": "harry potter",
      "entity_type": "people",
      "singular": true,
      "description": "Harry is described as being trapped and outnumbered by the Death Eaters. (\"They were trapped and outnumbered two to one.\")"
    },
    {
      "name": "sirius",
      "entity_type": "people",
      "singular": true,
      "description": "Sirius is mentioned as missing and Harry wants to know where he is. (\"Where's Sirius?\" Harry said.)"
    },
    {
      "name": "death eaters",
      "entity_type": "group",
      "singular": false,
      "description": "The Death Eaters are described as closing in on Harry and his friends. (\"She and her fellow Death Eaters had closed in so that they were...\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "lucius malfoy",
      "entity_2": "harry potter",
      "relationship_type": "command",
      "description": "Lucius Malfoy is commanding Harry to give him the prophecy. (\"Now, give me the prophecy, Potter.\")"
    },
    {
      "entity_1": "death eaters",
      "entity_2": "ginnys",
      "relationship_type": "attack",
      "description": "The Death Eaters are attacking Ginny and her friends. (\"eyes glinted through slits in hoods, a dozen lit wand tips were pointing directly at their hearts.\")"
    },
    {
      "entity_1": "death eaters",
      "entity_2": "harry potter",
      "relationship_type": "attack",
      "description": "The Death Eaters are attacking Harry and his friends. (\"eyes glinted through slits in hoods, a dozen lit wand tips were pointing directly at their hearts.\")"
    },
    {
      "entity_1": "death eaters",
      "entity_2": "sirius",
      "relationship_type": "capture",
      "description": "The Death Eaters have captured Sirius. (\"A harsh female voice from the midst of the shadowy figures to Harry's left said triumphantly, \"The Dark Lord always knows!\"\")"
    },
    {
      "entity_1": "harry potter",
      "entity_2": "sirius",
      "relationship_type": "concern",
      "description": "Harry is concerned about Sirius' whereabouts. (\"Where's Sirius?\" Harry said.)"
    }
  ]
}