{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is described as being worried about his job and putting up a better show than Trelawney in lessons, but also seems to have lost his nerve and is distracted and jumpy. He is more distant with Harry, Ron, and Hermione than before."
    },
    {
      "name": "trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Trelawney is mentioned as someone who Hagrid seems to be putting up a better show than in lessons. No other information about her is provided."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as giving advice to Hagrid, which he seems to be following by showing the class a less frightening creature than usual. No other information about her is provided."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is mentioned as someone that Hagrid glances anxiously at all the time in lessons. No other information about her is provided."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being worried about his job and having to choose between Hagrid and Trelawney if one of them had to be ousted. He also notices that Hagrid seems distracted and jumpy in lessons."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as being more distant with Hagrid than before, but no other information about him is provided."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hagrid",
      "relationship_type": "concerned_about",
      "description": "Harry is concerned about Hagrid's job and notices that he seems distracted and jumpy in lessons."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "trelawney",
      "relationship_type": "better_than",
      "description": "Hagrid seems to be putting up a better show than Trelawney in lessons, but also seems to have lost his nerve."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "hermione",
      "relationship_type": "following_advice",
      "description": "Hagrid is following Hermione's advice by showing the class a less frightening creature than usual."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "umbridge",
      "relationship_type": "anxious_about",
      "description": "Hagrid glances anxiously at Umbridge all the time in lessons."
    }
  ]
}