{
  "entities": [
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is a person who tries to help Bill and sends a candle toppling onto the last piece of parchment. (\"He tried,\" said Tonks, striding over to help Bill and immediately sending a candle toppling onto th e last piece of parchment.)"
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is a person who needs help from Tonks. (\"He tried,\" said Tonks, striding over to help Bill and immediately sending a candle toppling onto th e last piece of parchment.)"
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Weasley is a person who helps repair the parchment with her wand. (\"Here, dear,\" said Mrs. Weasley, sounding exasperated, and she re-paired the parchment with  a wave of her wand)"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who catches a glimpse of the plan of a building in the flash of light caused by Mrs Weasley's charm. (In the flash of light caused by Mrs Weasley’s charm,  Harry caught a glimpse of what looked like the plan of a building.)"
    },
    {
      "name": "mundungus",
      "entity_type": "person",
      "singular": true,
      "description": "Mundungus is a person who has been met by Harry. (\"Sit down, Harry,\" said Sirius. \"You’ve met Mundungus, haven’t you?\")"
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is a person who tells Harry that he has met Mundungus. (\"Sit down, Harry,\" said Sirius. \"You’ve met Mundungus, haven’t you?\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "tonks",
      "entity_2": "bill",
      "relationship_type": "helps",
      "description": "Tonks tries to help Bill. (\"He tried,\" said Tonks, striding over to help Bill and immediately sending a candle toppling onto th e last piece of parchment.)"
    },
    {
      "entity_1": "mrs weasley",
      "entity_2": "parchment",
      "relationship_type": "repaired",
      "description": "Mrs Weasley repairs the parchment with her wand. (\"Here, dear,\" said Mrs. Weasley, sounding exasperated, and she re-paired the parchment with  a wave of her wand)"
    },
    {
      "entity_1": "harry",
      "entity_2": "plan",
      "relationship_type": "saw",
      "description": "Harry catches a glimpse of the plan of a building in the flash of light caused by Mrs Weasley's charm. (In the flash of light caused by Mrs Weasley’s charm,  Harry caught a glimpse of what looked like the plan of a building.)"
    },
    {
      "entity_1": "mrs weasley",
      "entity_2": "dinner plates",
      "relationship_type": "unloaded",
      "description": "Mrs Weasley unloads dinner plates from an ancient dresser. (She snapped before sweep ing off toward an ancient dresser from which she started un loading dinner plates.)"
    },
    {
      "entity_1": "bill",
      "entity_2": "scrolls",
      "relationship_type": "vanished",
      "description": "Bill makes the scrolls vanish with his wand. (Bill took out his wand, muttered “ Evanesco!” and the scrolls vanished.)"
    },
    {
      "entity_1": "sirius",
      "entity_2": "mundungus",
      "relationship_type": "mentioned",
      "description": "Sirius mentions Mundungus to Harry. (\"Sit down, Harry,\" said Sirius. \"You’ve met Mundungus, haven’t you?\")"
    }
  ]
}