{
  "entities": [
    {
      "name": "luna lovegood",
      "entity_type": "person",
      "singular": true,
      "description": "Luna Lovegood is mentioned as watching Neville doing something with the Mimbulus mimbletonia plant. Her popping eyes appeared over the top of her upside-down magazine."
    },
    {
      "name": "nevile",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is mentioned as proudly saying that the Mimbulus mimbletonia has loads of stuff and an amazing defensive mechanism. He held the plant up to his eyes and gave it a sharp prod with the tip of his quill."
    },
    {
      "name": "trevor",
      "entity_type": "toad",
      "singular": true,
      "description": "Trevor is mentioned as being dumped into Harry's lap by Neville."
    },
    {
      "name": "mimbulus mimbletonia",
      "entity_type": "plant",
      "singular": true,
      "description": "The Mimbulus mimbletonia plant is mentioned as having loads of stuff and an amazing defensive mechanism. It was held up to Neville's eyes and given a sharp prod with the tip of his quill."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as flinging her arms up in front of her face just in time to avoid getting hit by the liquid from the plant."
    }
  ],
  "relationships": [
    {
      "entity_1": "nevile",
      "entity_2": "mimbulus mimbletonia",
      "relationship_type": "has_defensive_mechanism",
      "description": "Neville is proud of the Mimbulus mimbletonia's amazing defensive mechanism."
    },
    {
      "entity_1": "nevile",
      "entity_2": "trevor",
      "relationship_type": "held",
      "description": "Neville held Trevor in his hands before dumping him into Harry's lap."
    },
    {
      "entity_1": "luna lovegood",
      "entity_2": "mimbulus mimbletonia",
      "relationship_type": "affected_by",
      "description": "Luna Lovegood was affected by the liquid from the Mimbulus mimbletonia plant, which spattered her magazine."
    },
    {
      "entity_1": "luna lovegood",
      "entity_2": "ginny",
      "relationship_type": "similarly_affectected",
      "description": "Both Luna Lovegood and Ginny were similarly affected by the liquid from the Mimbulus mimbletonia plant, with Luna's magazine being spattered and Ginny looking like she was wearing a slimy green hat."
    },
    {
      "entity_1": "harry",
      "entity_2": "mimbulus mimbletonia",
      "relationship_type": "affected_by",
      "description": "Harry was affected by the liquid from the Mimbulus mimbletonia plant, which hit him in the face."
    }
  ]
}