{
  "entities": [
    {
      "name": "bellatrix lestrange",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix Lestrange is described as a convicted witch who tortured and permanently incapacitated Frank and Alice Longbottom. She is also mentioned to have retained vestiges of great good looks but lost most of her beauty due to Azkaban."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as looking bored and his eyes are drawn to the picture of Bellatrix Lestrange. He also reacts loudly when he reads the headline about a mass breakout from Azkaban."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as someone who retained vestiges of great good looks like Bellatrix Lestrange."
    },
    {
      "name": "frank longbottom",
      "entity_type": "person",
      "singular": true,
      "description": "Frank Longbottom is described as a victim of torture and permanent incapacitation by Bellatrix Lestrange."
    },
    {
      "name": "alice longbottom",
      "entity_type": "person",
      "singular": true,
      "description": "Alice Longbottom is also mentioned to be a victim of torture and permanent incapacitation by Bellatrix Lestrange."
    },
    {
      "name": "azkaban",
      "entity_type": "location",
      "singular": true,
      "description": "Azkaban is described as a place where Sirius was kept which took most of the beauty from Bellatrix Lestrange."
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is mentioned to fear that Black is the rallying point for old death eaters."
    },
    {
      "name": "he-who-must-not-be-named",
      "entity_type": "person",
      "singular": true,
      "description": "He-Who-Must-Not-Be-Named is mentioned as someone who was leaked Ministry of Magic secrets to by Bellatrix Lestrange."
    },
    {
      "name": "black",
      "entity_type": "person",
      "singular": true,
      "description": "Black is mentioned in the headline as a possible rallying point for old death eaters."
    }
  ],
  "relationships": [
    {
      "entity_1": "bellatrix lestrange",
      "entity_2": "he-who-must-not-be-named",
      "relationship_type": "leaked_secrets_to",
      "description": "Bellatrix Lestrange leaked Ministry of Magic secrets to He-Who-Must-Not-Be-Named."
    },
    {
      "entity_1": "bellatrix lestrange",
      "entity_2": "frank longbottom",
      "relationship_type": "tortured",
      "description": "Bellatrix Lestrange tortured Frank Longbottom and permanently incapacitated him."
    },
    {
      "entity_1": "bellatrix lestrange",
      "entity_2": "alice longbottom",
      "relationship_type": "tortured",
      "description": "Bellatrix Lestrange also tortured Alice Longbottom and permanently incapacitated her."
    },
    {
      "entity_1": "bellatrix lestrange",
      "entity_2": "azkaban",
      "relationship_type": "affected_by",
      "description": "Azkaban took most of the beauty from Bellatrix Lestrange."
    },
    {
      "entity_1": "harry",
      "entity_2": "bellatrix lestrange",
      "relationship_type": "interested_in",
      "description": "Harry is interested in the picture of Bellatrix Lestrange and reacts loudly when he reads about a mass breakout from Azkaban."
    }
  ]
}