{
  "entities": [
    {
      "name": "ernie",
      "entity_type": "person",
      "singular": true,
      "description": "Ernie is a person who is part of the group and has signed the list. He is described as looking slightly less anxious when responding to Hermione's question."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who is part of the group and has signed the list. She is described as testily saying that Ernie wouldn't leave the list lying around."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who is part of the group and has seen Cho's friend give her a reproachful look before adding her name to the list."
    },
    {
      "name": "cho",
      "entity_type": "person",
      "singular": true,
      "description": "Cho is a person who is part of the group and has added her name to the list. She is described as making rather a business of fastening the catch on her bag before leaving."
    },
    {
      "name": "zacharias",
      "entity_type": "person",
      "singular": true,
      "description": "Zacharias is a person who is part of the group and has signed the list. He is described as being the last person to sign."
    },
    {
      "name": "fr ed",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is a person who is part of the group and has gotten up from his seat to leave with George and Lee. He is described as being brisk when saying that time's ticking on."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is a person who is part of the group and has gotten up from his seat to leave with Fred and Lee. He is described as having items of a sensitive nature to purchase."
    },
    {
      "name": "lee",
      "entity_type": "person",
      "singular": true,
      "description": "Lee is a person who is part of the group and has gotten up from his seat to leave with Fred and George. He is described as having items of a sensitive nature to purchase."
    },
    {
      "name": "the hog’s head",
      "entity_type": "location",
      "singular": true,
      "description": "The Hog's Head is the location where the group has gathered to sign the list. It is described as being a place where people can gather and have items of a sensitive nature purchased."
    }
  ],
  "relationships": [
    {
      "entity_1": "ernie",
      "entity_2": "hermione",
      "relationship_type": "response_to_question",
      "description": "Ernie responds to Hermione's question about leaving the list lying around. Ernie says no, and that he'll sign."
    },
    {
      "entity_1": "ernie",
      "entity_2": "harry",
      "relationship_type": "seen_by",
      "description": "Harry sees Cho's friend give her a reproachful look before adding her name to the list. This is after Ernie has signed."
    },
    {
      "entity_1": "cho",
      "entity_2": "harry",
      "relationship_type": "seen_by",
      "description": "Harry sees Cho's friend give her a reproachful look before adding her name to the list. This is after Ernie has signed."
    },
    {
      "entity_1": "zacharias",
      "entity_2": "hermione",
      "relationship_type": "signed_list",
      "description": "Zacharias signs the list, which Hermione takes back and slips into her bag. This is after Ernie has signed."
    },
    {
      "entity_1": "fr ed",
      "entity_2": "george",
      "relationship_type": "left_with",
      "description": "Fred gets up from his seat to leave with George and Lee, saying that time's ticking on. They have items of a sensitive nature to purchase."
    },
    {
      "entity_1": "fr ed",
      "entity_2": "lee",
      "relationship_type": "left_with",
      "description": "Fred gets up from his seat to leave with George and Lee, saying that time's ticking on. They have items of a sensitive nature to purchase."
    },
    {
      "entity_1": "cho",
      "entity_2": "the hog’s head",
      "relationship_type": "left_from",
      "description": "Cho makes rather a business of fastening the catch on her bag before leaving The Hog's Head. Her long dark curtain of hair swings forward to hide her face."
    }
  ]
}