{
  "entities": [
    {
      "name": "slytherin",
      "entity_type": "house",
      "singular": true,
      "description": "Slytherin is one of the four houses at Hogwarts, founded by Salazar Slytherin. It takes in students with pure-blood ancestry and great cunning."
    },
    {
      "name": "ravenclaw",
      "entity_type": "house",
      "singular": true,
      "description": "Ravenclaw is one of the four houses at Hogwarts, founded by Rowena Ravenclaw. It takes in students with intelligence and sharp minds."
    },
    {
      "name": "gryffindor",
      "entity_type": "house",
      "singular": true,
      "description": "Gryffindor is one of the four houses at Hogwarts, founded by Godric Gryffindor. It takes in students with brave deeds and boldness."
    },
    {
      "name": "hufflepuff",
      "entity_type": "house",
      "singular": true,
      "description": "Hufflepuff is one of the four houses at Hogwarts, founded by Helga Hufflepuff. It takes in students who are not part of any other house and treats them equally."
    },
    {
      "name": "salazar slytherin",
      "entity_type": "person",
      "singular": true,
      "description": "Salazar Slytherin is one of the four founders of Hogwarts. He founded Slytherin house, which takes in students with pure-blood ancestry and great cunning."
    },
    {
      "name": "rowena ravenclaw",
      "entity_type": "person",
      "singular": true,
      "description": "Rowena Ravenclaw is one of the four founders of Hogwarts. She founded Ravenclaw house, which takes in students with intelligence and sharp minds."
    },
    {
      "name": "godric gryffindor",
      "entity_type": "person",
      "singular": true,
      "description": "Godric Gryffindor is one of the four founders of Hogwarts. He founded Gryffindor house, which takes in students with brave deeds and boldness."
    },
    {
      "name": "helga hufflepuff",
      "entity_type": "person",
      "singular": true,
      "description": "Helga Hufflepuff is one of the four founders of Hogwarts. She founded Hufflepuff house, which takes in students who are not part of any other house and treats them equally."
    }
  ],
  "relationships": [
    {
      "entity_1": "slytherin",
      "entity_2": "salazar slytherin",
      "relationship_type": "founded_by",
      "description": "Slytherin was founded by Salazar Slytherin, who took in students with pure-blood ancestry and great cunning."
    },
    {
      "entity_1": "ravenclaw",
      "entity_2": "rowena ravenclaw",
      "relationship_type": "founded_by",
      "description": "Ravenclaw was founded by Rowena Ravenclaw, who took in students with intelligence and sharp minds."
    },
    {
      "entity_1": "gryffindor",
      "entity_2": "godric gryffindor",
      "relationship_type": "founded_by",
      "description": "Gryffindor was founded by Godric Gryffindor, who took in students with brave deeds and boldness."
    },
    {
      "entity_1": "hufflepuff",
      "entity_2": "helga hufflepuff",
      "relationship_type": "founded_by",
      "description": "Hufflepuff was founded by Helga Hufflepuff, who took in students who are not part of any other house and treats them equally."
    },
    {
      "entity_1": "slytherin",
      "entity_2": "ravenclaw",
      "relationship_type": "different_from",
      "description": "Slytherin is different from Ravenclaw, as it takes in students with pure-blood ancestry and great cunning, while Ravenclaw takes in students with intelligence and sharp minds."
    },
    {
      "entity_1": "slytherin",
      "entity_2": "gryffindor",
      "relationship_type": "different_from",
      "description": "Slytherin is different from Gryffindor, as it takes in students with pure-blood ancestry and great cunning, while Gryffindor takes in students with brave deeds and boldness."
    },
    {
      "entity_1": "slytherin",
      "entity_2": "hufflepuff",
      "relationship_type": "different_from",
      "description": "Slytherin is different from Hufflepuff, as it takes in students with pure-blood ancestry and great cunning, while Hufflepuff takes in students who are not part of any other house and treats them equally."
    },
    {
      "entity_1": "ravenclaw",
      "entity_2": "gryffindor",
      "relationship_type": "different_from",
      "description": "Ravenclaw is different from Gryffindor, as it takes in students with intelligence and sharp minds, while Gryffindor takes in students with brave deeds and boldness."
    },
    {
      "entity_1": "ravenclaw",
      "entity_2": "hufflepuff",
      "relationship_type": "different_from",
      "description": "Ravenclaw is different from Hufflepuff, as it takes in students with intelligence and sharp minds, while Hufflepuff takes in students who are not part of any other house and treats them equally."
    },
    {
      "entity_1": "gryffindor",
      "entity_2": "hufflepuff",
      "relationship_type": "different_from",
      "description": "Gryffindor is different from Hufflepuff, as it takes in students with brave deeds and boldness, while Hufflepuff takes in students who are not part of any other house and treats them equally."
    }
  ]
}