{
  "entities": [
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is one of the twins who are eating griffin claw. He is described as projectile-vomiting into a bucket and then beaming with his arms wide to protracted applause."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is the other twin who is eating griffin claw. He is described as projectile-vomiting into a bucket and then beaming with his arms wide to protracted applause."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is watching Fred and George eat griffin claw. He is described as being irritated and finding the sniffs distracting."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is trying to find a rule that says others are not entitled to buy griffin claw. She is described as gritting her teeth in frustration."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is watching Fred and George eat griffin claw along with Harry and Hermione."
    },
    {
      "name": "lee",
      "entity_type": "person",
      "singular": true,
      "description": "Lee is collecting gold along with Fred, George, and presumably others."
    }
  ],
  "relationships": [
    {
      "entity_1": "fred",
      "entity_2": "george",
      "relationship_type": "friendship",
      "description": "Fred and George are twins who are eating griffin claw together. They are described as beaming with their arms wide to protracted applause after finishing."
    },
    {
      "entity_1": "harry",
      "entity_2": "fred",
      "relationship_type": "friendship",
      "description": "Harry is watching Fred and George eat griffin claw. He seems to have a friendly relationship with them, as he is concerned about their actions."
    },
    {
      "entity_1": "harry",
      "entity_2": "george",
      "relationship_type": "friendship",
      "description": "Harry is watching George eat griffin claw. He seems to have a friendly relationship with him, as he is concerned about his actions."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry and Hermione are watching Fred and George eat griffin claw together. They seem to have a friendly relationship, as they are both concerned about the twins' actions."
    },
    {
      "entity_1": "ron",
      "entity_2": "fred",
      "relationship_type": "friendship",
      "description": "Ron is watching Fred and George eat griffin claw along with Harry and Hermione. He seems to have a friendly relationship with them, as he is concerned about their actions."
    },
    {
      "entity_1": "ron",
      "entity_2": "george",
      "relationship_type": "friendship",
      "description": "Ron is watching George eat griffin claw along with Harry and Hermione. He seems to have a friendly relationship with him, as he is concerned about his actions."
    },
    {
      "entity_1": "hermione",
      "entity_2": "fred",
      "relationship_type": "friendship",
      "description": "Hermione is trying to find a rule that says others are not entitled to buy griffin claw. She seems to have a friendly relationship with Fred, as she is concerned about his actions."
    },
    {
      "entity_1": "hermione",
      "entity_2": "george",
      "relationship_type": "friendship",
      "description": "Hermione is trying to find a rule that says others are not entitled to buy griffin claw. She seems to have a friendly relationship with George, as she is concerned about his actions."
    },
    {
      "entity_1": "lee",
      "entity_2": "fred",
      "relationship_type": "friendship",
      "description": "Lee is collecting gold along with Fred and George. He seems to have a friendly relationship with them, as he is participating in their activity."
    },
    {
      "entity_1": "lee",
      "entity_2": "george",
      "relationship_type": "friendship",
      "description": "Lee is collecting gold along with Fred and George. He seems to have a friendly relationship with George, as he is participating in their activity."
    }
  ]
}