{
  "entities": [
    {
      "name": "Sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is a person who was using magic to try and save time, as indicated by the text 'We were just trying to save a bit of time!'"
    },
    {
      "name": "Fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is a person who was also using magic and apologized for his actions, as indicated by the text 'Sorry Sirius, mate — didn't mean to —'"
    },
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who was laughing along with Sirius, as indicated by the text 'Harry and Sirius were both laug hing.'"
    },
    {
      "name": "Mundungus",
      "entity_type": "person",
      "singular": true,
      "description": "Mundungus is a person who toppled backward off his chair, as indicated by the text 'Mundungus, who had top-pelled backward off his chair, was swea ring as he got to his feet.'"
    },
    {
      "name": "Crookshanks",
      "entity_type": "animal",
      "singular": true,
      "description": "Crookshanks is a cat who gave an angry hiss and shot off under the dresser, as indicated by the text 'Crookshanks had given an angry hiss and shot off under the dresser, from whence his large yellow eyes  glowed in the darkness.'"
    },
    {
      "name": "Mrs. Weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is a person who was upset by the use of magic and scolded her sons, as indicated by the text '“FOR HEAVEN’S SAKE!” screamed Mrs. Weasley. “THERE WAS NO NEED — I’VE HAD ENOUGH OF THIS — JUST BE-CAUSE YOU’RE ALLOWED TO USE MAGIC NOW YOU DON’T HAVE TO WHIP YOUR WANDS OUT FOR EVERY TINY LITTLE THING!”'"
    },
    {
      "name": "Mr. Weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is a person who was trying to calm the situation and remind his sons of their responsibilities, as indicated by the text '“Boys,” Mr. Weasley said, lifting th e stew back into the middle of the table, “your mother’s right, you’re supposed to show a sense of re-sponsibility now you’ve come of age —”'"
    }
  ],
  "relationships": [
    {
      "entity_1": "Sirius",
      "entity_2": "Fred",
      "relationship_type": "apologized_to",
      "description": "Fred apologized to Sirius for his actions, as indicated by the text 'Sorry Sirius, mate — didn’t mean to —'"
    },
    {
      "entity_1": "Harry",
      "entity_2": "Sirius",
      "relationship_type": "laughed_with",
      "description": "Harry was laughing along with Sirius, as indicated by the text 'Harry and Sirius were both laug hing.'"
    },
    {
      "entity_1": "Mrs. Weasley",
      "entity_2": "Fred",
      "relationship_type": "scolded",
      "description": "Mrs. Weasley scolded her son Fred for his actions, as indicated by the text '“FOR HEAVEN’S SAKE!” screamed Mrs. Weasley. “THERE WAS NO NEED — I’VE HAD ENOUGH OF THIS — JUST BE-CAUSE YOU’RE ALLOWED TO USE MAGIC NOW YOU DON’T HAVE TO WHIP YOUR WANDS OUT FOR EVERY TINY LITTLE THING!”'"
    },
    {
      "entity_1": "Mr. Weasley",
      "entity_2": "Fred",
      "relationship_type": "reminded",
      "description": "Mr. Weasley reminded his son Fred of their responsibilities, as indicated by the text '“Boys,” Mr. Weasley said, lifting th e stew back into the middle of the table, “your mother’s right, you’re supposed to show a sense of re-sponsibility now you’ve come of age —”'"
    }
  ]
}