{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who is having trouble with Occlumency lessons. He is frustrated and defensive about his inability to close his mind."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a friend of Harry's who is trying to help him understand the situation. She is sharp and quick-witted."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is the headmaster of Hogwarts who has asked Snape to teach Harry Occlumency. He wants Harry to avoid having dreams about a certain corridor."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is the teacher assigned to teach Harry Occlumency. He is trying to get inside Harry's head, but Ron suggests that he may actually be trying to help Harry."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a friend of Harry's who has a dark and meaningful idea about Snape's intentions. He is slow to speak but has a clever insight."
    },
    {
      "name": "you-know-who",
      "entity_type": "entity",
      "singular": true,
      "description": "You-Know-Who is likely Voldemort, the main antagonist of the series. Ron suggests that Snape may be trying to make it easier for him to get inside Harry's mind."
    }
  ],
  "relationships": [
    {
      "entity_1": "snape",
      "entity_2": "harry",
      "relationship_type": "trying_to_get_inside_mind",
      "description": "Snape is trying to get inside Harry's head, but Ron suggests that he may actually be trying to help Harry."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "snape",
      "relationship_type": "assigned_task",
      "description": "Dumbledore has asked Snape to teach Harry Occlumency."
    }
  ]
}