{
  "entities": [
    {
      "name": "snivellus",
      "entity_type": "person",
      "singular": true,
      "description": "Snivellus is mentioned as a person being spoken to by Sirius. (\"I’ve warned you, Snivellus\")"
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is the one speaking to Snape and warning him. (\"I’ve warned you, Snivellus\")"
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is being spoken to by Sirius and is mentioned as having reformed. (\"I don’t care if Dumbledore thinks you’ve reformed\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone who might not take Snape’s advice seriously. (\"Or are you afraid he might not take the advice of a man...\")"
    },
    {
      "name": "lucius malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Lucius Malfoy is mentioned as someone who recognized Sirius and is delighted that his lapdog is working at Hogwarts. (\"Tell me, how is Lucius Malfoy these days? I expect he’s delighted...\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who yelled and tried to get in between Sirius and Snape. (\"NO! Harry yelled, vaulting over the table...\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "sirius",
      "entity_2": "snape",
      "relationship_type": "confrontation",
      "description": "Sirius is confronting Snape about his reformation. (\"I’ve warned you, Snivellus\")"
    },
    {
      "entity_1": "snape",
      "entity_2": "sirius",
      "relationship_type": "defiance",
      "description": "Snape is defiant towards Sirius and suggests that he is afraid of Dumbledore’s opinion. (\"Or are you afraid he might not take the advice...\")"
    },
    {
      "entity_1": "lucius malfoy",
      "entity_2": "sirius",
      "relationship_type": "recognition",
      "description": "Lucius Malfoy recognized Sirius when he went outside. (\"did you know that Lucius Malfoy recognized you last time you risked a little jaunt...\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "intervention",
      "description": "Harry intervened between Sirius and Snape when Sirius raised his wand. (\"NO! Harry yelled, vaulting over the table...\")"
    }
  ]
}