{
  "entities": [
    {
      "name": "seamus",
      "entity_type": "person",
      "singular": true,
      "description": "Seamus is mentioned as the one who narrowly avoided having his head hit by the Oracle. He is described as being present in the class."
    },
    {
      "name": "dean",
      "entity_type": "person",
      "singular": true,
      "description": "Dean is mentioned alongside Seamus and is also present in the class."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is mentioned as being hit by Professor Trelawney with a copy of the Oracle. He is described as slipping off his pouf due to the force of the throw."
    },
    {
      "name": "professor trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Trelawney is mentioned as being loud and somewhat hysterical. She is described as having angry tears in her magnified eyes."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as thinking he knows what the matter is with Professor Trelawney. He leans his head closer to Ron's and mutters a possible explanation."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as being present in the class and having Harry lean his head close to him."
    },
    {
      "name": "parvati patil",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati Patil is mentioned as speaking up in a hushed voice to ask if there is anything wrong with Professor Trelawney."
    },
    {
      "name": "lavender",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender is mentioned alongside Parvati Patil and is described as having always admired Professor Trelawney."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor trelawney",
      "entity_2": "seamus",
      "relationship_type": "threw_at",
      "description": "Professor Trelawney threw the Oracle at Seamus."
    },
    {
      "entity_1": "professor trelawney",
      "entity_2": "dean",
      "relationship_type": "threw_at",
      "description": "Professor Trelawney threw the Oracle at Dean."
    },
    {
      "entity_1": "professor trelawney",
      "entity_2": "neville",
      "relationship_type": "threw_at",
      "description": "Professor Trelawney threw the Oracle at Neville."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "leaned_head_close_to",
      "description": "Harry leaned his head close to Ron's and muttered a possible explanation for Professor Trelawney's behavior."
    }
  ]
}