{
  "entities": [
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is described as disheveled and soot-blackened, indicating she was affected by the fireworks. She is also mentioned to be snarling at Professor Flitwick's classroom door."
    },
    {
      "name": "flitwick",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Flitwick is described as having a squeaky little voice and is thanked by Umbridge for getting rid of the sparklers. He also closes his classroom door in her face."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned to be watching Umbridge with immense satisfaction as she leaves Professor Flitwick's classroom."
    },
    {
      "name": "fred and george",
      "entity_type": "people",
      "singular": false,
      "description": "Fred and George are described as heroes that night in the Gryffindor common room for their fireworks display. They are congratulated by Hermione and others."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned to be fighting her way through the crowd to congratulate Fred and George on their fireworks display."
    }
  ],
  "relationships": [
    {
      "entity_1": "umbridge",
      "entity_2": "flitwick",
      "relationship_type": "interacted_with",
      "description": "Umbridge interacted with Professor Flitwick when she asked him to get rid of the sparklers and he agreed, but also closed his classroom door in her face."
    },
    {
      "entity_1": "harry",
      "entity_2": "umbridge",
      "relationship_type": "observed",
      "description": "Harry observed Umbridge leaving Professor Flitwick's classroom with immense satisfaction."
    },
    {
      "entity_1": "fred and george",
      "entity_2": "hermione",
      "relationship_type": "congratulated_by",
      "description": "Hermione congratulated Fred and George on their fireworks display, indicating that they were appreciated by her."
    },
    {
      "entity_1": "fred and george",
      "entity_2": "umbridge",
      "relationship_type": "affected",
      "description": "Fred and George's fireworks affected Umbridge, causing her to be disheveled and soot-blackened."
    }
  ]
}