{
  "entities": [
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is introduced as a character who is talking about Harry's mother. He is described as casting a disgusted look at Angelina and using derogatory language to refer to Harry."
    },
    {
      "name": "angelina",
      "entity_type": "person",
      "singular": true,
      "description": "Angelina is introduced as a character who intervenes in the conversation between Malfoy and Fred. She takes Fred by the arm and tells him to leave it, implying that she does not want the situation to escalate."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is introduced as a character who stiffens when he realizes what Malfoy is talking about. He looks around at Malfoy and seems ready to leap on him, but Angelina intervenes."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is introduced as a character who has realized what Malfoy is talking about. He is grabbed hold of by Harry and seems to be trying to calm down the situation."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as a character who is being talked about by Malfoy. He grabs hold of George and tries to calm down the situation."
    },
    {
      "name": "alicia",
      "entity_type": "person",
      "singular": true,
      "description": "Alicia is introduced as a character who, along with Angelina and Katie, tries to stop Fred from leaping on Malfoy."
    },
    {
      "name": "katie",
      "entity_type": "person",
      "singular": true,
      "description": "Katie is introduced as a character who, along with Angelina and Alicia, tries to stop Fred from leaping on Malfoy."
    }
  ],
  "relationships": [
    {
      "entity_1": "malfoy",
      "entity_2": "harry",
      "relationship_type": "sneering_at",
      "description": "Malfoy is sneering at Harry, implying that he has a negative opinion of him."
    },
    {
      "entity_1": "angelina",
      "entity_2": "fred",
      "relationship_type": "stopping",
      "description": "Angelina intervenes to stop Fred from leaping on Malfoy, showing her attempt to calm down the situation."
    },
    {
      "entity_1": "harry",
      "entity_2": "george",
      "relationship_type": "grabbing_hold_of",
      "description": "Harry grabs hold of George, implying that he is trying to protect him or keep him safe from Malfoy's insults."
    }
  ]
}