{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story, referred to as 'he' or 'him'. The text mentions that Harry felt Hermione should have seen this coming and that some people had turned up in the hope of hearing his story firsthand."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "A friend of Harry's who is mentioned as saying 'Who are you?' rather rudely. The text does not provide any further information about Ron."
    },
    {
      "name": "zacharias smith",
      "entity_type": "person",
      "singular": true,
      "description": "The boy who introduces himself and asks for an explanation of why Harry says You-Know-Who's back. The text mentions that Zacharias is hoping to hear Harry's story firsthand."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "A friend of Harry's who intervenes in the conversation and tries to steer it towards a different topic. The text mentions that Hermione should have seen this coming and that some people had turned up in the hope of hearing Harry's story firsthand."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "A character who is mentioned as having told the whole school what happened last year. The text does not provide any further information about Dumbledore."
    },
    {
      "name": "you-know-who",
      "entity_type": "voldemort",
      "singular": true,
      "description": "The main antagonist of the story, referred to by his nickname 'You-Know-Who'. The text mentions that Harry says You-Know-Who's back and that Dumbledore told the whole school what happened last year."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "you-know-who",
      "relationship_type": "saw",
      "description": "Harry saw You-Know-Who, as mentioned in the text: 'What makes me say You-Know-Who’s back?’ he asked, looking Zacharias straight in the face. ‘I  saw him.'"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "you-know-who",
      "relationship_type": "told",
      "description": "Dumbledore told the whole school what happened last year, as mentioned in the text: 'Dumbledore told the whole school what happened last year,'"
    }
  ]
}