{
  "entities": [
    {
      "name": "cedric",
      "entity_type": "person",
      "singular": true,
      "description": "Cedric is mentioned as Harry's girlfriend's boyfriend who died in the Triwizard tournament. (\"she had been Cedric’s girlfriend; she could easily have hated Harry for coming out of the Triwizard maze alive when Cedric had died\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who came out of the Triwizard maze alive. (\"she was talking to him in a perfectl y friendly way, not as though she thought him mad, or a liar, or in some horrible way responsible for Cedric’s death\")"
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as the one who opens the dungeon door. (\"Even the ominous sound of Snape’s dungeon door creaking open did not pu ncture the small, hopeful bubble that seemed to have swelled in his chest\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as one of Harry's friends who follows him into the classroom. (\"He filed into the classroom behind Ron and Hermione and followed them to their usual table at the back\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as one of Harry's friends who follows him into the classroom. (\"He filed into the classroom behind Ron and Hermione and followed them to their usual table at the back\")"
    },
    {
      "name": "she",
      "entity_type": "person",
      "singular": true,
      "description": "She is mentioned as Cedric's girlfriend who talks to Harry in a friendly way. (\"she was talking to him in a perfectl y friendly way, not as though she thought him mad, or a liar, or in some horrible way responsible for Cedric’s death\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "cedric",
      "relationship_type": "died_before",
      "description": "Cedric died before Harry came out of the Triwizard maze alive. (\"she could easily have hated Harry for coming out of the Triwizard maze alive when Cedric had died\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "interacted_with",
      "description": "Harry interacted with Snape by ignoring him and following his friends into the classroom. (\"Even the ominous sound of Snape’s dungeon door creaking open did not pu ncture the small, hopeful bubble that seemed to have swelled in his chest\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "followed_by",
      "description": "Harry followed Ron into the classroom. (\"He filed into the classroom behind Ron and Hermione and followed them to their usual table at the back\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "followed_by",
      "description": "Harry followed Hermione into the classroom. (\"He filed into the classroom behind Ron and Hermione and followed them to their usual table at the back\")"
    },
    {
      "entity_1": "she",
      "entity_2": "harry",
      "relationship_type": "talked_to",
      "description": "She talked to Harry in a friendly way. (\"she was talking to him in a perfectl y friendly way, not as though she thought him mad, or a liar, or in some horrible way responsible for Cedric’s death\")"
    }
  ]
}