{
  "entities": [
    {
      "name": "moonstone",
      "entity_type": "rock",
      "singular": true,
      "description": "Moonstone is mentioned as a subject of study, specifically its properties and uses in potion-making. It is described as being the topic of a 12-inch parchment that needs to be handed in on Thursday."
    },
    {
      "name": "potion",
      "entity_type": "substance",
      "singular": true,
      "description": "Potions are mentioned as being made by students, including Harry, Ron, and Neville. They are described as having various consistencies and odors."
    },
    {
      "name": "flagon",
      "entity_type": "container",
      "singular": false,
      "description": "Flagons are mentioned as containers used to hold potions. They are described as being filled with potion and handed in to Snape's desk."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as the teacher who receives the flagons from students. He is not described in detail, but his presence is noted as a significant part of the scene."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a student who is upset about receiving zero marks for his potion. He is described as clearing away his things and slumping down onto his seat."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as a fellow student of Harry's who also made a potion that did not turn out well. His potion is described as giving off a foul odor."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is mentioned as another student who made a potion that did not turn out well. His potion is described as having the consistency of just-mixed cement."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as joining Harry and Ron for lunch after class. She is not described in detail, but her presence is noted as a significant part of the scene."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "potion",
      "relationship_type": "made",
      "description": "Harry made a potion that did not turn out well, resulting in him receiving zero marks for the day's work."
    },
    {
      "entity_1": "ron",
      "entity_2": "potion",
      "relationship_type": "made",
      "description": "Ron also made a potion that did not turn out well, giving off a foul odor."
    },
    {
      "entity_1": "neville",
      "entity_2": "potion",
      "relationship_type": "made",
      "description": "Neville made a potion that did not turn out well, having the consistency of just-mixed cement."
    },
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "will receive marks from",
      "description": "Harry will be receiving zero marks for the day's work from Snape."
    }
  ]
}