{
  "entities": [
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is described as one of the twins who have perfected a type of Skiving Snackbox. He is taking turns with his brother George to demonstrate it to a cheering crowd."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is described as one of the twins who have perfected a type of Skiving Snackbox. He is taking turns with his brother Fred to demonstrate it to a cheering crowd."
    },
    {
      "name": "lee jordan",
      "entity_type": "person",
      "singular": true,
      "description": "Lee Jordan is described as assisting the demonstration of the Skiving Snackbox. He is lazily vanishing the vomit at regular intervals with a Vanishing Spell."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as trying to focus on the correct method for Strengthening Solutions, but it's difficult due to the noise and commotion in the room."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as not helping Harry focus on his work. She is also part of the crowd cheering for Fred and George's demonstration."
    }
  ],
  "relationships": [
    {
      "entity_1": "fred",
      "entity_2": "george",
      "relationship_type": "sibling",
      "description": "Fred and George are described as twins who have perfected a type of Skiving Snackbox together. They are taking turns to demonstrate it to the crowd."
    },
    {
      "entity_1": "fred",
      "entity_2": "lee jordan",
      "relationship_type": "assistant",
      "description": "Fred is assisted by Lee Jordan during his demonstration of the Skiving Snackbox. Lee Jordan is lazily vanishing the vomit at regular intervals with a Vanishing Spell."
    },
    {
      "entity_1": "george",
      "entity_2": "lee jordan",
      "relationship_type": "assistant",
      "description": "George is also assisted by Lee Jordan during his demonstration of the Skiving Snackbox. Lee Jordan is lazily vanishing the vomit at regular intervals with a Vanishing Spell."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "classmate",
      "description": "Harry and Hermione are described as being in the same class together. They are also both part of the crowd cheering for Fred and George's demonstration."
    }
  ]
}