{
  "entities": [
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is introduced as the one who has just come and is holding Harry back from following Lupin. She is described as being in charge of the situation and giving instructions to Harry."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as the one who is trying to follow Lupin but is held back by Mrs. Weasley. He is described as being eager to join the meeting and is given instructions by Mrs. Weasley."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is introduced as someone who Harry wants to follow but is not allowed to because he is not a member of the Order."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as being upstairs with Hermione and waiting for the meeting to be over so they can have dinner."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as being upstairs with Ron and waiting for the meeting to be over so they can have dinner."
    },
    {
      "name": "the order",
      "entity_type": "organization",
      "singular": true,
      "description": "The Order is introduced as a group that has a meeting which Harry is not allowed to attend because he is not a member."
    },
    {
      "name": "troll's leg",
      "entity_type": "object",
      "singular": true,
      "description": "A troll's leg is mentioned as being used to make an umbrella stand in the house."
    },
    {
      "name": "shrunken heads",
      "entity_type": "object",
      "singular": false,
      "description": "Shrunken heads are mounted on a row and are described as being dark and eerie."
    }
  ],
  "relationships": [
    {
      "entity_1": "mrs weasley",
      "entity_2": "harry",
      "relationship_type": "held_back",
      "description": "Mrs. Weasley holds Harry back from following Lupin because he is not a member of the Order."
    },
    {
      "entity_1": "mrs weasley",
      "entity_2": "ron",
      "relationship_type": "waiting_with",
      "description": "Ron and Hermione are waiting with Mrs. Weasley for the meeting to be over so they can have dinner."
    },
    {
      "entity_1": "mrs weasley",
      "entity_2": "hermione",
      "relationship_type": "waiting_with",
      "description": "Ron and Hermione are waiting with Mrs. Weasley for the meeting to be over so they can have dinner."
    }
  ]
}