{
  "entities": [
    {
      "name": "ministry",
      "entity_type": "government_agency",
      "singular": true,
      "description": "The Ministry is mentioned as a governing body that has foisted an useless teacher upon the students. The Ministry is also mentioned as being in denial about the return of You-Know-Who."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is introduced as a teacher who is trying to actively prevent the students from using defensive spells. She has some mad idea that Dumbledore could use the students as a private army."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned by Umbridge as someone who might mobilize the students against the Ministry."
    },
    {
      "name": "you-know-who",
      "entity_type": "dark_lord",
      "singular": true,
      "description": "You-Know-Who is mentioned as a dark force that the Ministry is in denial about. The return of You-Know-Who is also mentioned as a reason for Umbridge's actions."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is introduced as someone who shares her thoughts on why Umbridge doesn't want the students to be trained in Defense Against the Dark Arts."
    }
  ],
  "relationships": [
    {
      "entity_1": "umbridge",
      "entity_2": "ministry",
      "relationship_type": "opposes",
      "description": "Umbridge is trying to prevent the students from using defensive spells, which suggests that she opposes the Ministry's goals."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "umbridge",
      "relationship_type": "potential_alliance",
      "description": "Hermione thinks that Umbridge believes Dumbledore might mobilize the students against the Ministry, suggesting a potential alliance between Dumbledore and the students."
    }
  ]
}