{
  "entities": [
    {
      "name": "gryffindor",
      "entity_type": "team",
      "singular": true,
      "description": "Gryffindor is mentioned as a team that is cheering and feeling heartened. The text states 'Gryffindor cheers and felt heartened' indicating their positive emotions."
    },
    {
      "name": "harry",
      "entity_type": "student",
      "singular": true,
      "description": "Harry is mentioned as a student who is participating in the Quidditch match. The text states 'Harry ducked a Bludger that Crabbe had sent rocketing in his direction' indicating his actions during the game."
    },
    {
      "name": "crabbe",
      "entity_type": "student",
      "singular": true,
      "description": "Crabbe is mentioned as a student who is participating in the Quidditch match. The text states 'Crabbe had sent rocketing in his direction' indicating his actions during the game."
    },
    {
      "name": "malfoy",
      "entity_type": "student",
      "singular": true,
      "description": "Malfoy is mentioned as a student who is participating in the Quidditch match. The text states 'but Malfoy, like him, was continuing to soar around the stadium' indicating his actions during the game."
    },
    {
      "name": "pucey",
      "entity_type": "student",
      "singular": true,
      "description": "Pucey is mentioned as a student who is participating in the Quidditch match. The text states '— Pucey throws to Warrington, Warrington to Montague' indicating his actions during the game."
    },
    {
      "name": "warrington",
      "entity_type": "student",
      "singular": true,
      "description": "Warrington is mentioned as a student who is participating in the Quidditch match. The text states '— Pucey throws to Warrington, Warrington to Montague' indicating his actions during the game."
    },
    {
      "name": "montague",
      "entity_type": "student",
      "singular": true,
      "description": "Montague is mentioned as a student who is participating in the Quidditch match. The text states '— Pucey throws to Warrington, Warrington to Montague' indicating his actions during the game."
    },
    {
      "name": "johnson",
      "entity_type": "student",
      "singular": true,
      "description": "Johnson is mentioned as a student who is participating in the Quidditch match. The text states '— Johnson intervenes, Johnson takes the Quaffle' indicating his actions during the game."
    },
    {
      "name": "bell",
      "entity_type": "student",
      "singular": true,
      "description": "Bell is mentioned as a student who is participating in the Quidditch match. The text states '— Bell’s hit by a Bludger from Goyle of Slytherin' indicating his actions during the game."
    },
    {
      "name": "goyle",
      "entity_type": "student",
      "singular": true,
      "description": "Goyle is mentioned as a student who is participating in the Quidditch match. The text states '— Bell’s hit by a Bludger from Goyle of Slytherin' indicating his actions during the game."
    },
    {
      "name": "weasley",
      "entity_type": "student",
      "singular": true,
      "description": "Weasley is mentioned as a student who is participating in the Quidditch match. The text states 'WEASLEY WAS BORN IN A BIN, HE ALWAYS LETS THE QUAFFLE IN' indicating his characteristics."
    },
    {
      "name": "slytherin",
      "entity_type": "team",
      "singular": true,
      "description": "Slytherin is mentioned as a team that is participating in the Quidditch match. The text states '— Bell’s hit by a Bludger from Goyle of Slytherin' indicating their involvement in the game."
    }
  ],
  "relationships": [
    {
      "entity_1": "gryffindor",
      "entity_2": "harry",
      "relationship_type": "cheering_for",
      "description": "Gryffindor is cheering for Harry, indicating their support for him during the game."
    },
    {
      "entity_1": "crabbe",
      "entity_2": "harry",
      "relationship_type": "opponent",
      "description": "Crabbe and Harry are opponents in the Quidditch match, indicated by Crabbe sending a Bludger towards Harry."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "harry",
      "relationship_type": "rival",
      "description": "Malfoy and Harry are rivals in the Quidditch match, indicated by their actions during the game."
    },
    {
      "entity_1": "pucey",
      "entity_2": "warrington",
      "relationship_type": "teammate",
      "description": "Pucey and Warrington are teammates in the Quidditch match, indicated by their actions during the game."
    },
    {
      "entity_1": "johnson",
      "entity_2": "quaffle",
      "relationship_type": "possessor",
      "description": "Johnson is possessing the Quaffle during the game, indicated by his actions."
    },
    {
      "entity_1": "bell",
      "entity_2": "bludger",
      "relationship_type": "victim",
      "description": "Bell is hit by a Bludger from Goyle of Slytherin, indicating that he is a victim in the game."
    }
  ]
}