{
  "entities": [
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is a student who is mentioned as having given up Divination and is now looking forward to their first lesson with Firenze. She is described as smirking and curling her eyelashes around her wand."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a student who has given up Divination and is now reading the Daily Prophet. She is mentioned as not really liking horses and is described as coolly responding to Parvati."
    },
    {
      "name": "firenze",
      "entity_type": "person",
      "singular": true,
      "description": "Firenze is a centaur who will be teaching Divination lessons to the students. He is described as gorgeous."
    },
    {
      "name": "trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Trelawney is a professor who has been sacked and is no longer teaching Divination. The students are mentioned as going up to her office to see her."
    },
    {
      "name": "lavender",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender is a student who is mentioned as being upset about Trelawney's departure and is described as sounding shocked when she hears that Firenze is a centaur."
    },
    {
      "name": "daily prophet",
      "entity_type": "newspaper",
      "singular": false,
      "description": "The Daily Prophet is the newspaper that Hermione is reading. It contains news columns that she scans."
    }
  ],
  "relationships": [
    {
      "entity_1": "parvati",
      "entity_2": "firenze",
      "relationship_type": "teaching",
      "description": "Parvati will be having her first lesson with Firenze, who is teaching Divination."
    },
    {
      "entity_1": "hermione",
      "entity_2": "daily prophet",
      "relationship_type": "reading",
      "description": "Hermione is reading the Daily Prophet and scanning its columns."
    }
  ]
}