{
  "entities": [
    {
      "name": "owls",
      "entity_type": "species",
      "singular": false,
      "description": "The text mentions O.W.L.S (Ordinary Wizarding Level) which are exams taken by students in the wizarding world."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a student who is taking O.W.L.S exams. He is mentioned as being thankful to Professor Sprout for interrupting Ernie's recital."
    },
    {
      "name": "ernie",
      "entity_type": "person",
      "singular": true,
      "description": "Ernie is a student who was in the middle of a recital when Harry and his friends were ushered into the greenhouse by Professor Sprout."
    },
    {
      "name": "professor sprout",
      "entity_type": "teacher",
      "singular": true,
      "description": "Professor Sprout is a teacher at Hogwarts School of Witchcraft and Wizardry. She ushers Harry and his friends into the greenhouse to interrupt Ernie's recital."
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Draco Malfoy is a student who tries to induce panic by telling Crabbe and Goyle that it's not what you know but who you know. He mentions his father's connection with the head of the Wizarding Examinations Authority."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is a student who listens to Draco Malfoy's conversation about inducing panic by using connections."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is a student who listens to Draco Malfoy's conversation about inducing panic by using connections."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a student who whispers to Harry and Ron about being frightened after hearing Draco Malfoy's conversation."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a student who listens to Hermione's whisper and responds gloomily."
    },
    {
      "name": "griselda marchbanks",
      "entity_type": "person",
      "singular": true,
      "description": "Griselda Marchbanks is the head of the Wizarding Examinations Authority. She is mentioned as being connected to Draco Malfoy's father."
    }
  ],
  "relationships": [
    {
      "entity_1": "draco malfoy",
      "entity_2": "griselda marchbanks",
      "relationship_type": "connection",
      "description": "Draco Malfoy mentions that his father has a connection with Griselda Marchbanks, the head of the Wizarding Examinations Authority."
    },
    {
      "entity_1": "harry",
      "entity_2": "professor sprout",
      "relationship_type": "gratitude",
      "description": "Harry is thankful to Professor Sprout for interrupting Ernie's recital."
    }
  ]
}