{
  "entities": [
    {
      "name": "dementors",
      "entity_type": "creatures",
      "singular": true,
      "description": "Dementors are mentioned as being present in Little Whinging, causing Harry and Dudley to be affected by them. (\"Dementors here, in Little Whinging . . .\")"
    },
    {
      "name": "little whinging",
      "entity_type": "location",
      "singular": true,
      "description": "Little Whinging is mentioned as the location where Dementors are present. (\"Dementors here, in Little Whinging . . .\")"
    },
    {
      "name": "dudley",
      "entity_type": "person",
      "singular": true,
      "description": "Dudley is mentioned as being affected by the Dementors and lying curled up on the ground. (\"Dudley lay curled up on the ground, whimpering and shaking.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being affected by the Dementors and trying to help Dudley. (\"He could not believe what ha d just happened. Dementors here, in Little Whinging . . .\")"
    },
    {
      "name": "mrs. figg",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Figg is mentioned as arriving on the scene and warning Harry not to put away his wand. (\"Mrs. Figg, their batty old neighbor,  came panting into sight.\")"
    },
    {
      "name": "mundungus fletcher",
      "entity_type": "person",
      "singular": true,
      "description": "Mundungus Fletcher is mentioned as someone Mrs. Figg is angry with and wants to kill. (\"Oh, I’m going to kill Mundungus Fletcher!\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "dementors",
      "relationship_type": "affected_by",
      "description": "Harry is affected by the Dementors, as evidenced by his sweat and reaction to them. (\"He could not believe what ha d just happened. Dementors here, in Little Whinging . . .\")"
    },
    {
      "entity_1": "dudley",
      "entity_2": "dementors",
      "relationship_type": "affected_by",
      "description": "Dudley is affected by the Dementors, as evidenced by his whimpering and shaking. (\"Dudley lay curled up on the ground, whimpering and shaking.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "dudley",
      "relationship_type": "helping",
      "description": "Harry is trying to help Dudley after he is affected by the Dementors. (\"He bent down to see whether he wa s in a fit state to stand up, but\")"
    },
    {
      "entity_1": "mrs. figg",
      "entity_2": "mundungus fletcher",
      "relationship_type": "anger_towards",
      "description": "Mrs. Figg is angry with Mundungus Fletcher and wants to kill him. (\"Oh, I’m going to kill Mundungus Fletcher!\")"
    }
  ]
}