{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character of the story, and he is feeling miserable due to a dementor attack. He is also guilty for being irritable with his owl Hedwig."
    },
    {
      "name": "hedwig",
      "entity_type": "owl",
      "singular": true,
      "description": "Hedwig is Harry's owl, who is described as the only friend he has at number four, Privet Drive. She is also mentioned to be eating a frog."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is one of Harry's friends who will write back to him with answers and sympathy after the dementor attack. He is mentioned as someone who will help Harry."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is another one of Harry's friends who will write back to him with answers and sympathy after the dementor attack. He is mentioned as someone who will help Harry."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is one of Harry's friends who will write back to him with answers and sympathy after the dementor attack. She is mentioned as someone who will help Harry."
    },
    {
      "name": "privet drive",
      "entity_type": "location",
      "singular": true,
      "description": "Privet Drive is where Harry lives, and it's mentioned that Hedwig is his only friend there."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hedwig",
      "relationship_type": "friendship",
      "description": "Harry has a friendship with Hedwig, who is described as his only friend at number four, Privet Drive."
    },
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "mutual_support",
      "description": "Harry expects Sirius to write back with sympathy and plans for his immediate removal to the Burrow after the dementor attack."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "mutual_support",
      "description": "Harry expects Ron to write back with sympathy and plans for his immediate removal to the Burrow after the dementor attack."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "mutual_support",
      "description": "Harry expects Hermione to write back with sympathy and plans for his immediate removal to the Burrow after the dementor attack."
    }
  ]
}