{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character in the story, referred to as 'he' and 'him'. He is described as having a warm glow at the sight of his friends, but then feeling uneasy and wanting them to leave him alone. (Excerpt: \"The warm glow that had flared in side him at the sight of his two best friends was extinguished...\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "One of Harry's best friends, referred to as 'he' and 'him'. He is mentioned as being present with Hermione. (Excerpt: \"Ron began.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "One of Harry's best friends, referred to as 'she' and 'her'. She is mentioned as being present with Ron. (Excerpt: \"Hermione rather breathlessly said.\")"
    },
    {
      "name": "hedwig",
      "entity_type": "animal",
      "singular": true,
      "description": "Harry's owl, mentioned as being stroked by Harry in a strained silence. (Excerpt: \"He stroked Hedwig automatically, not looking at either of the others.\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "A person mentioned as having made a decision about Harry's safety. (Excerpt: \"‘He seemed to think it was best,’ said Hermione rather breathlessly. ‘Dumbledore, I mean.’\")"
    },
    {
      "name": "muggles",
      "entity_type": "group",
      "singular": false,
      "description": "A group of people mentioned as being related to Harry's safety. (Excerpt: \"I think he thought you were safest with the Muggles —\""
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "friendship",
      "description": "Harry and Ron are described as best friends. (Excerpt: \"his two best friends was extinguished...\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry and Hermione are also described as best friends. (Excerpt: \"his two best friends was extinguished...\")"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "authority",
      "description": "Dumbledore is mentioned as having made a decision about Harry's safety, indicating an authority relationship. (Excerpt: \"‘He seemed to think it was best,’ said Hermione rather breathlessly. ‘Dumbledore, I mean.’\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "hedwig",
      "relationship_type": "ownership",
      "description": "Harry is described as stroking Hedwig, indicating ownership or care for the owl. (Excerpt: \"He stroked Hedwig automatically, not looking at either of the others.\")"
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Ron and Hermione are mentioned as being present together with Harry. (Excerpt: \"Ron began.\")"
    }
  ]
}