{
  "entities": [
    {
      "name": "molly",
      "entity_type": "person",
      "singular": true,
      "description": "Molly is described as someone who is upset and sobbing on Lupin's shoulder. She is introduced in the text as 'Molly' when Lupin tries to comfort her."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is described as someone who is trying to comfort Molly and telling her that it was just a boggart. He is introduced in the text as 'Lupin' when he walks over to Molly."
    },
    {
      "name": "boggart",
      "entity_type": "object",
      "singular": true,
      "description": "The boggart is described as something that pretends to be Harry's body and causes fear. It is introduced in the text as a magical entity that can take on different forms."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is described as someone who is staring at the patch of carpet where the boggart had lain. He is introduced in the text as 'Sirius' when he is mentioned looking at the carpet."
    },
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "Moody is described as someone who is looking at Harry and has a magical eye that can follow people. He is introduced in the text as 'Moody' when he is mentioned looking at Harry."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as someone who is avoiding Moody's gaze and feeling funny about being followed by Moody's magical eye. He is introduced in the text as 'Harry' when he is mentioned looking at the carpet."
    },
    {
      "name": "arthur",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur is described as someone who should not be told something by Mrs. Weasley. He is introduced in the text as 'Arthur' when Mrs. Weasley mentions him."
    }
  ],
  "relationships": [
    {
      "entity_1": "molly",
      "entity_2": "lupin",
      "relationship_type": "comforted_by",
      "description": "Lupin comforts Molly after she sees the boggart pretending to be Harry's body."
    },
    {
      "entity_1": "moody",
      "entity_2": "harry",
      "relationship_type": "followed_by",
      "description": "Moody's magical eye follows Harry out of the kitchen."
    }
  ]
}