{
  "entities": [
    {
      "name": "luna",
      "entity_type": "character",
      "singular": true,
      "description": "Luna is one of Harry's friends who helps him seal doors in the Brain Room. She is described as crying out 'Collo... aaaaaaaaargh...' as she is thrown through the air by Death Eaters."
    },
    {
      "name": "neville",
      "entity_type": "character",
      "singular": true,
      "description": "Neville is one of Harry's friends who helps him seal doors in the Brain Room. He is described as bewitching doors along with Luna."
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is a main character who is trying to seal doors in the Brain Room. He crashes into a table and rolls over it to reach another door."
    },
    {
      "name": "death eaters",
      "entity_type": "group",
      "singular": false,
      "description": "Death Eaters are a group of dark wizards who are attacking Harry and his friends in the Brain Room. They are described as running towards the doors and trying to break through them."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "death eaters",
      "relationship_type": "attacked_by",
      "description": "Harry is being attacked by Death Eaters in the Brain Room. This is described as 'footsteps running along behind the doors; every now and then another heavy body would launch itself against one, so it creaked and shuddered.'"
    },
    {
      "entity_1": "luna",
      "entity_2": "death eaters",
      "relationship_type": "attacked_by",
      "description": "Luna is being attacked by Death Eaters in the Brain Room. This is described as 'He turned in time to see her flying through the air.'"
    },
    {
      "entity_1": "neville",
      "entity_2": "death eaters",
      "relationship_type": "attacked_by",
      "description": "Neville is being attacked by Death Eaters in the Brain Room. This is described as 'He turned in time to see her flying through the air.'"
    },
    {
      "entity_1": "harry",
      "entity_2": "luna",
      "relationship_type": "helped_by",
      "description": "Harry is helped by Luna and Neville as they work together to seal doors in the Brain Room. This is described as 'The three of them tore around the room, sealing the doors as they went:'"
    },
    {
      "entity_1": "luna",
      "entity_2": "harry",
      "relationship_type": "helped_by",
      "description": "Luna helps Harry by working together with him to seal doors in the Brain Room. This is described as 'The three of them tore around the room, sealing the doors as they went:'"
    },
    {
      "entity_1": "neville",
      "entity_2": "harry",
      "relationship_type": "helped_by",
      "description": "Neville helps Harry by working together with him to seal doors in the Brain Room. This is described as 'The three of them tore around the room, sealing the doors as they went:'"
    }
  ]
}