{
  "entities": [
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is described as someone who Harry likes to blow raspberries at whenever she speaks. This suggests that Umbridge is a person of authority or importance in the story."
    },
    {
      "name": "peeves",
      "entity_type": "poltergeist",
      "singular": true,
      "description": "Peeves is described as a poltergeist who is causing trouble in the school. He is mentioned as being loose and trying to loosen a crystal chandelier."
    },
    {
      "name": "mcgonagall",
      "entity_type": "professor",
      "singular": true,
      "description": "Professor McGonagall is described as walking past Peeves and telling him that something unscrews the other way. This suggests that she is in charge or has authority over the school."
    },
    {
      "name": "filch",
      "entity_type": "staff_member",
      "singular": true,
      "description": "Filch is mentioned as being one of the staff members who seems to be stirring themselves to help Umbridge. This suggests that Filch is a member of the school's staff and has some level of responsibility."
    },
    {
      "name": "harry",
      "entity_type": "student",
      "singular": true,
      "description": "Harry is mentioned as witnessing Professor McGonagall walking past Peeves and could have sworn he heard her tell him something. This suggests that Harry is a student at the school and has some level of awareness about what's going on."
    },
    {
      "name": "fred",
      "entity_type": "student",
      "singular": true,
      "description": "Fred is mentioned as having departed from the school along with George. This suggests that Fred is a student at the school."
    },
    {
      "name": "george",
      "entity_type": "student",
      "singular": true,
      "description": "George is mentioned as having departed from the school along with Fred. This suggests that George is a student at the school."
    },
    {
      "name": "montague",
      "entity_type": "person",
      "singular": true,
      "description": "Montague is described as still not recovered from his sojourn in the toilet. This suggests that Montague is a person who has had some kind of experience or encounter with the toilet."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "umbridge",
      "relationship_type": "blows_raspberries_at",
      "description": "Harry likes to blow raspberries at Umbridge whenever she speaks. This suggests that Harry has a negative or playful relationship with Umbridge."
    },
    {
      "entity_1": "mcgonagall",
      "entity_2": "peeves",
      "relationship_type": "tells_off",
      "description": "Professor McGonagall is described as telling Peeves something out of the corner of her mouth. This suggests that McGonagall has some level of authority or control over Peeves."
    },
    {
      "entity_1": "filch",
      "entity_2": "umbridge",
      "relationship_type": "helps",
      "description": "Filch is mentioned as being one of the staff members who seems to be stirring themselves to help Umbridge. This suggests that Filch has some level of responsibility or obligation towards Umbridge."
    },
    {
      "entity_1": "mcgonagall",
      "entity_2": "peeves",
      "relationship_type": "ignores",
      "description": "Professor McGonagall is described as walking past Peeves without intervening. This suggests that McGonagall has some level of tolerance or acceptance towards Peeves's behavior."
    }
  ]
}