{
  "entities": [
    {
      "name": "gryffindor",
      "entity_type": "team",
      "singular": true,
      "description": "The Gryffindor team is mentioned as needing to be re-formed, indicating that it has been disbanded or is no longer active. (\"We have to go and ask permission to re-form the Gryffindor team!\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as having a temper issue with Umbridge, indicating that he has had conflicts with her in the past. (\"Please, please don't lose your temper with Umbridge again or she might not let us play anymore!\")"
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is mentioned as being the one who has the power to allow or deny the Gryffindor team from playing. (\"Please, please don't lose your temper with Umbridge again or she might not let us play anymore!\")"
    },
    {
      "name": "angelina",
      "entity_type": "person",
      "singular": true,
      "description": "Angelina is mentioned as being on the verge of tears, indicating that Harry's behavior has an impact on her. (\"Okay, okay,\" said Harry, for Angelina looked as though she was on the verge of tears.)"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as being appalled by the idea of re-forming the Gryffindor team. (\"No way,\" said Ron, appalled.)"
    },
    {
      "name": "binns",
      "entity_type": "teacher",
      "singular": true,
      "description": "Professor Binns is mentioned as being the teacher present in the History of Magic lesson. (\"But he was wrong; the only teacher present when they entered was Professor Binns, floating an inch or so above his chair as usual and preparing to continue his monotonous drone on giant wars.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "umbridge",
      "relationship_type": "conflict",
      "description": "Harry has had conflicts with Umbridge in the past, as mentioned by Ron. (\"Please, please don't lose your temper with Umbridge again or she might not let us play anymore!\")"
    },
    {
      "entity_1": "ron",
      "entity_2": "umbridge",
      "relationship_type": "prediction",
      "description": "Ron predicts that Umbridge will be present in the History of Magic lesson. (\"Bet Umbridge is in History of Magic,\" said Ron grimly, as they set off for Binns's lesson.)"
    },
    {
      "entity_1": "harry",
      "entity_2": "angelina",
      "relationship_type": "influence",
      "description": "Harry's behavior has an impact on Angelina, who is mentioned as being on the verge of tears. (\"Okay, okay,\" said Harry, for Angelina looked as though she was on the verge of tears.)"
    }
  ]
}