{
  "entities": [
    {
      "name": "hogsmeade",
      "entity_type": "location",
      "singular": true,
      "description": "Hogsmeade is a village where students can go on weekends. It is mentioned as the place Harry wants to take Cho Chang on Valentine's Day."
    },
    {
      "name": "valentine's day",
      "entity_type": "holiday",
      "singular": true,
      "description": "Valentine's Day is a holiday where people show love and affection for each other. It is mentioned as the occasion when Harry asks Cho Chang out."
    },
    {
      "name": "cho chang",
      "entity_type": "person",
      "singular": true,
      "description": "Cho Chang is a student at Hogwarts who is asked out by Harry on Valentine's Day. She is described as blushing and beaming at him."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is the main character of the story who asks Cho Chang out on Valentine's Day. He is described as feeling relieved that the day is not going to be a complete loss."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is Harry's friend who he plans to pick up from the library before their afternoon lessons."
    },
    {
      "name": "hermione granger",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione Granger is Harry's friend who he plans to pick up from the library before their afternoon lessons."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is a teacher at Hogwarts who has an ominous presence. Harry feels uneasy when approaching his office."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "cho chang",
      "relationship_type": "asked_out",
      "description": "Harry asks Cho Chang out on Valentine's Day, and she agrees to go with him."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "snape",
      "relationship_type": "approached_office",
      "description": "Harry feels uneasy when approaching Snape's office, but he eventually enters it."
    }
  ]
}