{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Albus Dumbledore, once Supreme Mugwump of the International Confederation of Wizards and Chief Warlock of the Wizengamot, is mentioned as the headmaster of Hogwarts. He has made eccentric decisions in the last few years."
    },
    {
      "name": "remus lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Remus Lupin, a werewolf, was hired by Dumbledore as a staff member at Hogwarts."
    },
    {
      "name": "rubeus hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Rubeus Hagrid, a half-giant, was also hired by Dumbledore as a staff member at Hogwarts."
    },
    {
      "name": "mad-eye moody",
      "entity_type": "person",
      "singular": true,
      "description": "Mad-Eye Moody, an ex-Auror, is described as 'delusional' and was also hired by Dumbledore as a staff member at Hogwarts."
    },
    {
      "name": "griselda marchbanks",
      "entity_type": "person",
      "singular": true,
      "description": "Griselda Marchbanks, a Wizengamot elder, resigned in protest against the introduction of the post of Inquisitor to Hogwarts."
    },
    {
      "name": "tiberius ogden",
      "entity_type": "person",
      "singular": true,
      "description": "Tiberius Ogden, another Wizengamot elder, also resigned in protest against the introduction of the post of Inquisitor to Hogwarts."
    },
    {
      "name": "ministry",
      "entity_type": "organization",
      "singular": false,
      "description": "The Ministry is mentioned as keeping an eye on the situation at Hogwarts."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "remus lupin",
      "relationship_type": "hired",
      "description": "Remus Lupin was hired by Dumbledore as a staff member at Hogwarts."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "rubeus hagrid",
      "relationship_type": "hired",
      "description": "Rubeus Hagrid was also hired by Dumbledore as a staff member at Hogwarts."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "mad-eye moody",
      "relationship_type": "hired",
      "description": "Mad-Eye Moody, an ex-Auror, was also hired by Dumbledore as a staff member at Hogwarts."
    },
    {
      "entity_1": "ministry",
      "entity_2": "dumbledore",
      "relationship_type": "monitoring",
      "description": "The Ministry is keeping an eye on the situation at Hogwarts, implying they are monitoring Dumbledore's actions."
    },
    {
      "entity_1": "griselda marchbanks",
      "entity_2": "inquisitor",
      "relationship_type": "opposed",
      "description": "Griselda Marchbanks resigned in protest against the introduction of the post of Inquisitor to Hogwarts, indicating she is opposed to it."
    },
    {
      "entity_1": "tiberius ogden",
      "entity_2": "inquisitor",
      "relationship_type": "opposed",
      "description": "Tiberius Ogden also resigned in protest against the introduction of the post of Inquisitor to Hogwarts, indicating he is opposed to it."
    }
  ]
}