{
  "entities": [
    {
      "name": "uncle vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Uncle Vernon is mentioned as speaking in a triumphant whisper and forcefully. He is described as not knowing how bad Harry felt at admitting the truth."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as hesitating to tell the truth, feeling bad about it, and having his temper rising. He is also described as getting news from owls."
    },
    {
      "name": "aunt petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Aunt Petunia is mentioned as not believing Harry's statement, knowing that he's up to something funny, and calling him back. She is also described as saying 'we know you're up to somethin' funny'."
    },
    {
      "name": "the dursleys",
      "entity_type": "family",
      "singular": false,
      "description": "The Dursleys are mentioned as a family, with Uncle Vernon and Aunt Petunia being part of it. They are described as not knowing how bad Harry felt at admitting the truth."
    },
    {
      "name": "the owls",
      "entity_type": "animals",
      "singular": false,
      "description": "The owls are mentioned as bringing news to Harry, but he denies this statement."
    }
  ],
  "relationships": [
    {
      "entity_1": "uncle vernon",
      "entity_2": "harry",
      "relationship_type": "knows",
      "description": "Uncle Vernon knows that Harry gets all his news from the owls, as mentioned in the line 'As if we didn’t know you get all your news from those pestilential birds!'"
    },
    {
      "entity_1": "aunt petunia",
      "entity_2": "harry",
      "relationship_type": "knows",
      "description": "Aunt Petunia knows that Harry is up to something funny, as mentioned in the line 'We know you’re up to somethin’ funny'."
    },
    {
      "entity_1": "uncle vernon",
      "entity_2": "aunt petunia",
      "relationship_type": "knows",
      "description": "Uncle Vernon and Aunt Petunia both know that Harry is up to something funny, as mentioned in the lines 'No more do I' and 'We know you’re up to somethin’ funny'."
    }
  ]
}