{
  "entities": [
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Umbridge is described as being in a bad mood and shooting glowering looks at Harry. She had vouched for him earlier."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as keeping his head down, staring at Defensive Magical Theory, and thinking about what to do next."
    },
    {
      "name": "mcgonagall",
      "entity_type": "professor",
      "singular": true,
      "description": "Professor McGonagall's reaction is imagined by Harry if he were caught trespassing in Umbridge's office."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as someone Harry can ask about the scene he witnessed in the Pensieve during the summer holiday."
    },
    {
      "name": "fred and george",
      "entity_type": "twins",
      "singular": false,
      "description": "Fred and George are mentioned as having a diversion planned, which is related to Harry's plan to ask Sirius about the scene in the Pensieve."
    }
  ],
  "relationships": [
    {
      "entity_1": "umbridge",
      "entity_2": "harry",
      "relationship_type": "glowering_at",
      "description": "Umbridge is described as shooting glowering looks at Harry, indicating a negative relationship between them."
    },
    {
      "entity_1": "harry",
      "entity_2": "mcgonagall",
      "relationship_type": "imagined_reaction",
      "description": "Harry imagines Professor McGonagall's reaction if he were caught trespassing in Umbridge's office, indicating a hypothetical relationship between Harry and McGonagall."
    },
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "planned_to_ask",
      "description": "Harry plans to ask Sirius about the scene he witnessed in the Pensieve during the summer holiday, indicating a planned relationship between Harry and Sirius."
    },
    {
      "entity_1": "harry",
      "entity_2": "fred and george",
      "relationship_type": "related_plan",
      "description": "Harry's plan to ask Sirius about the scene in the Pensieve is related to Fred and George's diversion, indicating a connection between Harry and the twins."
    }
  ]
}