{
  "entities": [
    {
      "name": "slytherin quidditch team",
      "entity_type": "sports_team",
      "singular": true,
      "description": "The Slytherin Quidditch team is mentioned as the one responsible for the catcalls and jeers. They are described as being in the empty stands, shouting loudly around the stadium."
    },
    {
      "name": "hangers-on",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "The hangers-on are a group of people who are grouped halfway up the empty stands and are shouting along with the Slytherin Quidditch team. They are not specified further in the text."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as calling out to Weasley, asking what he's riding and making a sneering comment about it being a moldy old log. He is described as having a sneering drawl."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is mentioned as guffawing and shrieking with laughter along with Goyle and Pansy Parkinson when Malfoy makes his comment about Weasley's broomstick."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is mentioned as guffawing and shrieking with laughter along with Crabbe and Pansy Parkinson when Malfoy makes his comment about Weasley's broomstick."
    },
    {
      "name": "pansy parkinson",
      "entity_type": "person",
      "singular": true,
      "description": "Pansy Parkinson is mentioned as guffawing and shrieking with laughter along with Crabbe and Goyle when Malfoy makes his comment about Weasley's broomstick."
    },
    {
      "name": "weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Weasley is mentioned as riding a broomstick that the Slytherin Quidditch team is making fun of. He is described as having a Flying Charm on his broomstick."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as ignoring the catcalls and jeers from the Slytherin Quidditch team and following Ron on his broomstick. He is described as watching his ears turn red."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is mentioned as riding a broomstick that the Slytherin Quidditch team is making fun of. Harry follows him on his own broomstick."
    },
    {
      "name": "angelina johnson",
      "entity_type": "person",
      "singular": true,
      "description": "Angelina Johnson is mentioned as soaring around them with the Quaffle under her arm and slowing to hover in front of her airborne team. She approves of Harry's attitude."
    },
    {
      "name": "quidditch teams",
      "entity_type": "sports_team",
      "singular": false,
      "description": "The text mentions that there are two Quidditch teams playing - the Slytherin Quidditch team and presumably the Gryffindor Quidditch team (which is not explicitly mentioned but implied by the context)."
    },
    {
      "name": "quaffle",
      "entity_type": "equipment",
      "singular": true,
      "description": "The Quaffle is a piece of equipment used in Quidditch. It is described as being under Angelina Johnson's arm."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "ron weasley",
      "relationship_type": "follows",
      "description": "Harry Potter follows Ron Weasley on his broomstick, ignoring the catcalls and jeers from the Slytherin Quidditch team."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "angelina johnson",
      "relationship_type": "approves_of",
      "description": "Angelina Johnson approves of Harry Potter's attitude, saying 'Exactly the attitude I want, Harry'."
    }
  ]
}