{
  "entities": [
    {
      "name": "professor umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Umbridge is described as leaving the blackboard and settling in the chair behind the teacher's desk, observing them all with her pouchy toad-like eyes. (Excerpt: 'Professor Umbridge left the blackb oard and settled herself in the chair behind the teacher’s desk, obse rving them all with those pouchy toad’s eyes.')"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as turning to page five of his copy of Defensive Magical Theory and starting to read. (Excerpt: 'Harry turned to page five of his copy of Defensive Magical  Theory and started to read.')"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as absent-mindedly turning his quill over and over in his fingers, staring at the same spot on the page. (Excerpt: 'Next to him, Ron was absent-mindedly turning his quill over and ov er in his fingers, staring at the same spot on the page.')"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as not even opening her copy of Defensive Magical Theory. (Excerpt: 'Harry looked right and received a surprise to shake him out of his torpor. Hermione had not even opened her copy')"
    },
    {
      "name": "professor binns",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Binns is mentioned as someone whose lectures are dull, similar to the current lesson. (Excerpt: 'It was desperately dull, quite as ba d as listening to Professor Binns.')"
    },
    {
      "name": "defensive magical theory",
      "entity_type": "book",
      "singular": true,
      "description": "Defensive Magical Theory is described as a book that Harry and his classmates are reading. (Excerpt: 'Harry turned to page five of his copy of Defensive Magical  Theory and started to read.')"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "defensive magical theory",
      "relationship_type": "reading",
      "description": "Harry is described as reading from his copy of Defensive Magical Theory. (Excerpt: 'Harry turned to page five of his copy of Defensive Magical  Theory and started to read.')"
    },
    {
      "entity_1": "ron",
      "entity_2": "defensive magical theory",
      "relationship_type": "reading",
      "description": "Ron is described as staring at the same spot on the page, implying he is also reading from his copy of Defensive Magical Theory. (Excerpt: 'Next to him, Ron was absent-mindedly turning his quill over and ov er in his fingers, staring at the same spot on the page.')"
    },
    {
      "entity_1": "hermione",
      "entity_2": "defensive magical theory",
      "relationship_type": "reading",
      "description": "Hermione is described as not even opening her copy of Defensive Magical Theory, implying she is also supposed to be reading it. (Excerpt: 'Harry looked right and received a surprise to shake him out of his torpor. Hermione had not even opened her copy')"
    },
    {
      "entity_1": "professor umbridge",
      "entity_2": "harry",
      "relationship_type": "observation",
      "description": "Professor Umbridge is described as observing Harry and his classmates. (Excerpt: 'Professor Umbridge left the blackb oard and settled herself in the chair behind the teacher’s desk, obse rving them all with those pouchy toad’s eyes.')"
    }
  ]
}