{
  "entities": [
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as a person who is innocent until proven guilty. He is described as someone who listens to Dumbledore even if he doesn't like what he hears."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as a person who has been telling the truth about Sirius. Harry and Ron believe that Dumbledore would go mad if Sirius turned out to be a Death Eater."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who believes that Sirius wouldn't turn up because he listens to Dumbledore."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who is worried about Sirius and has a lot on his plate."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who is trying to help Harry by telling him not to worry about Sirius."
    },
    {
      "name": "death eaters",
      "entity_type": "group",
      "singular": false,
      "description": "Death Eaters are mentioned as a group of people that Sirius is accused of being part of."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "sirius",
      "relationship_type": "trust",
      "description": "Dumbledore has been telling the truth about Sirius, and Sirius listens to Dumbledore even if he doesn't like what he hears."
    },
    {
      "entity_1": "ron",
      "entity_2": "sirius",
      "relationship_type": "belief",
      "description": "Ron believes that Sirius wouldn't turn up because he listens to Dumbledore."
    },
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "concern",
      "description": "Harry is worried about Sirius and has a lot on his plate."
    },
    {
      "entity_1": "hermione",
      "entity_2": "harry",
      "relationship_type": "reassurance",
      "description": "Hermione tries to reassure Harry by telling him not to worry about Sirius."
    },
    {
      "entity_1": "death eaters",
      "entity_2": "sirius",
      "relationship_type": "membership",
      "description": "Sirius is accused of being a Death Eater."
    }
  ]
}