{
  "entities": [
    {
      "name": "ron",
      "entity_type": "character",
      "singular": true,
      "description": "Ron is described as having a bubble of blood at the corner of his mouth and bursting, indicating he has been injured. (\"A bubble of blood grew at the corner of Ron’s mouth and burst.\")"
    },
    {
      "name": "gi nny",
      "entity_type": "character",
      "singular": true,
      "description": "Ginny is described as breathing in a very shallow way with her eyes still closed, indicating she has been injured. (\"Luna gestured hopelessly at Ginn y, who was breathing in a very shallow way, her eyes still closed.\")"
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is described as trying to help Ron and Ginny, indicating he is concerned about their well-being. (\"We’ve got to get out of here,\" said Harry firmly.)"
    },
    {
      "name": "luna",
      "entity_type": "character",
      "singular": true,
      "description": "Luna is described as trying to help Ginny and being concerned about Ron’s condition. (\"I don’t know what they hit him with,\" said Luna sadly, \"but he’s gone a bit funny, I could hardly get him along at all.\")"
    },
    {
      "name": "pluto",
      "entity_type": "character",
      "singular": true,
      "description": "Pluto is described as being blown up in the face by Harry. (\"I used the Reductor Curse and blew up Pluto in his face, but . . .\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "helping",
      "description": "Harry is helping Ron by trying to keep him upright. (\"We’ve got to get out of here,\" said Harry firmly.)"
    },
    {
      "entity_1": "luna",
      "entity_2": "gi nny",
      "relationship_type": "caring",
      "description": "Luna is caring for Ginny by putting an arm around her waist and pulling her up. (\"Yes,\" said Luna, sticking her wand behind her ear for safekeeping, \"putting an arm around Ginny’s waist and pulling her up.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "gi nny",
      "relationship_type": "helping",
      "description": "Harry is helping Ginny by trying to get them out of the situation. (\"We’ve got to get out of here,\" said Harry firmly.)"
    }
  ]
}