{
  "entities": [
    {
      "name": "professor tofty",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Tofty is mentioned as a character in the story, specifically as someone who is anxious and trying to get attention. He says 'Now, really!' and mentions that there are only sixteen minutes left."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid's cabin is mentioned in the story, indicating that Hagrid is a character who lives or works nearby. He is not directly involved in the action but his cabin serves as a reference point."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who recognizes Professor McGonagall's voice and whispers her name. She also screams along with Parvati and Lavender when the Stunners are fired."
    },
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is mentioned as someone who screams along with Hermione and Lavender when the Stunners are fired."
    },
    {
      "name": "lavender",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender is mentioned as someone who screams along with Hermione and Parvati when the Stunners are fired."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is a main character in the story. She is recognized by Hermione as she shouts at someone and then gets attacked with Stunners. She is described as being lifted off her feet and illuminated by an eerie red glow."
    },
    {
      "name": "the figure",
      "entity_type": "person",
      "singular": true,
      "description": "The figure is mentioned as someone who is sprinting towards the battle beside Hagrid's cabin and shouting at Professor McGonagall. They are later revealed to be Professor McGonagall herself."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "the figure",
      "relationship_type": "is_the_same_person_as",
      "description": "The figure is later revealed to be Professor McGonagall, indicating that they are the same person."
    },
    {
      "entity_1": "hermione",
      "entity_2": "professor mcgonagall",
      "relationship_type": "recognizes_voice_of",
      "description": "Hermione recognizes Professor McGonagall's voice and whispers her name."
    },
    {
      "entity_1": "parvati",
      "entity_2": "professor mcgonagall",
      "relationship_type": "is_attacked_by_stunners_with",
      "description": "Parvati is present when the Stunners are fired at Professor McGonagall."
    },
    {
      "entity_1": "lavender",
      "entity_2": "professor mcgonagall",
      "relationship_type": "is_attacked_by_stunners_with",
      "description": "Lavender is present when the Stunners are fired at Professor McGonagall."
    }
  ]
}