{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as a person who is upset about Ginny seeing Michael. He is described as someone who would take it badly if he knew."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as a person who is seeing Michael, and Ron is upset about it. She is described as someone who hasn't told Ron about her relationship with Michael."
    },
    {
      "name": "michael corner",
      "entity_type": "person",
      "singular": true,
      "description": "Michael Corner is mentioned as a person that Ginny is seeing, and Ron is upset about it. He is described as someone who is the subject of Ron's anger."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as a person who is talking to Harry and trying to distract him from his anger. She is described as someone who is observant and notices how Cho looks at Harry."
    },
    {
      "name": "cho",
      "entity_type": "person",
      "singular": true,
      "description": "Cho is mentioned as a person who has feelings for Harry, and Hermione notices it. She is described as someone who can't keep her eyes off Harry."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a person who is the subject of Cho's affections, and Ron's anger. He is described as someone who is oblivious to his own feelings."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "ginny",
      "relationship_type": "anger_towards",
      "description": "Ron is angry at Ginny for seeing Michael, and he expresses it in a harsh tone. (‘this is exactly why Ginny hasn’t told you she’s seeing Michael...’) "
    },
    {
      "entity_1": "ron",
      "entity_2": "michael corner",
      "relationship_type": "anger_towards",
      "description": "Ron is angry at Michael Corner for being with Ginny, and he expresses it in a harsh tone. (‘impr ecations about Michael Corner’) "
    },
    {
      "entity_1": "hermione",
      "entity_2": "cho",
      "relationship_type": "observed_affection",
      "description": "Hermione notices that Cho has feelings for Harry, and she mentions it to him. (‘she just couldn’t keep her eyes off you’) "
    },
    {
      "entity_1": "harry",
      "entity_2": "cho",
      "relationship_type": "subject_of_affection",
      "description": "Cho has feelings for Harry, and Hermione notices it. (‘she just couldn’t keep her eyes off you’) "
    }
  ]
}