{
  "entities": [
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is described as round-shouldered yet angular, with oily hair swinging about his face. He is seen moving between tables towards the doors into the entrance hall, still absorbed in his own examination paper."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as looking down at his father and then standing waiting for Sirius to join him. He is seen glimpsing Snape a short way away and trying to keep him in sight while straining his ears to catch the voices of James and his friends."
    },
    {
      "name": "james",
      "entity_type": "person",
      "singular": true,
      "description": "James is mentioned as being separated from Snape by a gang of chattering girls. He is seen talking with Sirius and Lupin in the entrance hall."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is described as emerging into the entrance hall with Harry and Lupin. He asks James if he liked question ten."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is mentioned as talking with Sirius and James in the entrance hall. He says he loved question ten."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "sight",
      "description": "Harry tries to keep Snape in sight while straining his ears to catch the voices of James and his friends."
    },
    {
      "entity_1": "james",
      "entity_2": "sirius",
      "relationship_type": "friendship",
      "description": "James is seen talking with Sirius in the entrance hall."
    },
    {
      "entity_1": "sirius",
      "entity_2": "lupin",
      "relationship_type": "friendship",
      "description": "Sirius and Lupin are mentioned as talking together in the entrance hall."
    }
  ]
}