{
  "entities": [
    {
      "name": "mad eye",
      "entity_type": "person",
      "singular": true,
      "description": "Mad-Eye is a person who wants to wait for Sturgis. He is mentioned as someone who would have helped the group if Arthur could get cars from the Ministry again."
    },
    {
      "name": "sturgis",
      "entity_type": "person",
      "singular": true,
      "description": "Sturgis is a person that Mad-Eye wants to wait for. He is not mentioned by name, but his presence is implied as something that Mad-Eye is waiting for."
    },
    {
      "name": "arthur",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur is a person who could have gotten cars from the Ministry again. He is mentioned as someone who would have helped the group if he had been able to do so."
    },
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is a person who wouldn't let Arthur borrow anything, including an empty ink bottle. He is mentioned as someone who has become more restrictive in his lending practices."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is a person who has been trapped inside for a very long time. He is mentioned as someone who is now free and able to accompany Harry and the others."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who is accompanying Sirius and the others on their journey. He is mentioned as someone who is laughing at Sirius's antics."
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is a person who purses her lips in an almost Aunt Petunia-ish way. She is mentioned as someone who is accompanying Harry and the others on their journey."
    },
    {
      "name": "aunt petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Aunt Petunia is a person who is mentioned as an example of someone who would purse her lips in a similar way to Mrs. Weasley."
    },
    {
      "name": "king's cross",
      "entity_type": "location",
      "singular": true,
      "description": "King's Cross is a location that the group reaches by foot after twenty minutes of walking. It is mentioned as a place where they linger casually before proceeding further."
    }
  ],
  "relationships": [
    {
      "entity_1": "mad eye",
      "entity_2": "sturgis",
      "relationship_type": "waiting_for",
      "description": "Mad-Eye wants to wait for Sturgis, implying that he is waiting for him to arrive or be ready."
    },
    {
      "entity_1": "arthur",
      "entity_2": "ministry",
      "relationship_type": "can_get_cars_from",
      "description": "Arthur could have gotten cars from the Ministry again, implying a relationship between Arthur and the Ministry where he has access to resources or assistance."
    },
    {
      "entity_1": "fudge",
      "entity_2": "arthur",
      "relationship_type": "won't_lend_to",
      "description": "Fudge won't let Arthur borrow anything, including an empty ink bottle, implying a restrictive relationship between Fudge and Arthur."
    },
    {
      "entity_1": "sirius",
      "entity_2": "harry",
      "relationship_type": "accompanying",
      "description": "Sirius is accompanying Harry on their journey, implying a close relationship or friendship between the two."
    }
  ]
}