{
  "entities": [
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as looking disconcerted and then making a joke about finding his friend crying over his mother's old bloomers. (\"I’ll look for him later, I expe ct I’ll find him upstairs crying his eyes out over my mother’s old bloomers or something.\")"
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as laughing along with George and Ron. (\"Fred, George, and Ron laughed;\")"
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as laughing along with Fred and Ron. (\"Fred, George, and Ron laughed;\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as laughing along with Fred and George. (\"Fred, George, and Ron laughed;\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as looking reproachful when the others laugh at Sirius' joke. (\"Hermione, however, looked reproachful.\")"
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr Weasley is mentioned as someone who will be visited by Harry and Hermione. (\"the Weasleys and Harry and Hermione were planning to pa y Mr. Weasley another visit,\")"
    },
    {
      "name": "mad-eye",
      "entity_type": "person",
      "singular": true,
      "description": "Mad-Eye is mentioned as one of the people who will escort Mr Weasley on a visit. (\"escorted by Mad-Eye and Lupin\")"
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is mentioned as one of the people who will escort Mr Weasley on a visit. (\"escorted by Mad-Eye and Lupin\")"
    },
    {
      "name": "mundungus",
      "entity_type": "person",
      "singular": true,
      "description": "Mundungus is mentioned as someone who turns up in time for Christmas pudding and trifle. (\"Mu ndungus turned up in time for Christmas pudding and trifle,\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "sirius",
      "entity_2": "fred",
      "relationship_type": "laughed_at",
      "description": "Sirius makes a joke that Fred, George, and Ron laugh at. (\"Fred, George, and Ron laughed;\")"
    },
    {
      "entity_1": "hermione",
      "entity_2": "sirius",
      "relationship_type": "looked_reproachful_at",
      "description": "Hermione looks reproachful when the others laugh at Sirius' joke. (\"Hermione, however, looked reproachful.\")"
    },
    {
      "entity_1": "mad-eye",
      "entity_2": "mr weasley",
      "relationship_type": "will_visit",
      "description": "Mad-Eye will escort Mr Weasley on a visit. (\"escorted by Mad-Eye and Lupin\")"
    },
    {
      "entity_1": "lupin",
      "entity_2": "mr weasley",
      "relationship_type": "will_visit",
      "description": "Lupin will escort Mr Weasley on a visit. (\"escorted by Mad-Eye and Lupin\")"
    },
    {
      "entity_1": "mundungus",
      "entity_2": "christmas pudding",
      "relationship_type": "arrived_in_time_for",
      "description": "Mundungus turns up in time for Christmas pudding and trifle. (\"Mu ndungus turned up in time for Christmas pudding and trifle,\")"
    }
  ]
}