{
  "entities": [
    {
      "name": "weasleys",
      "entity_type": "family",
      "singular": false,
      "description": "The Weasley family is mentioned as exchanging darkly significant looks when they hear the words 'Ministry of Magic'. This suggests that they are a close-knit family and are aware of each other's emotions."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as exchanging darkly significant looks with the Weasleys. She is likely a friend or acquaintance of the Weasley family."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as telling Harry not to mention Percy in front of his parents. He is likely a member of the Weasley family."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being told by Ron not to mention Percy in front of his parents. He is likely a friend or acquaintance of the Weasley family."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is mentioned as having a row with his father and causing tension within the family. He is likely a member of the Weasley family."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as telling Harry about Percy's argument with their father. He is likely a member of the Weasley family."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as saying that they are well shot of Percy. She is likely a member of the Weasley family."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as saying that they are well shot of Percy and having an uncharacteristically ugly look on his face. He is likely a member of the Weasley family."
    },
    {
      "name": "mum",
      "entity_type": "person",
      "singular": true,
      "description": "Mum is mentioned as crying whenever Percy's name is mentioned. She is likely a member of the Weasley family and the mother of Percy."
    }
  ],
  "relationships": [
    {
      "entity_1": "percy",
      "entity_2": "dad",
      "relationship_type": "argument",
      "description": "Percy had a row with his father, causing tension within the family. This is mentioned by Fred as an unusual occurrence."
    },
    {
      "entity_1": "percy",
      "entity_2": "mum",
      "relationship_type": "tension",
      "description": "Whenever Percy's name is mentioned, Mum starts crying. This suggests that there is a strained relationship between Percy and his mother."
    },
    {
      "entity_1": "dad",
      "entity_2": "percy",
      "relationship_type": "argument",
      "description": "Percy had a row with his father, causing tension within the family. This is mentioned by Fred as an unusual occurrence."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "advice",
      "description": "Ron told Harry not to mention Percy in front of his parents, indicating a close relationship between Ron and Harry."
    }
  ]
}