{
  "entities": [
    {
      "name": "flitwick",
      "entity_type": "professor",
      "singular": true,
      "description": "Flitwick is described as someone who treats students like guests and doesn't seem to bother him at all. He is also mentioned as someone who usually gets everyone through their exams all right."
    },
    {
      "name": "alicia",
      "entity_type": "student",
      "singular": true,
      "description": "Alicia is described as a student who told Harry that the classes are normally really good."
    },
    {
      "name": "george",
      "entity_type": "student",
      "singular": true,
      "description": "George is described as someone who thinks Flitwick will not get marked down and also advises Harry to keep his temper with Umbridge."
    },
    {
      "name": "fred",
      "entity_type": "student",
      "singular": true,
      "description": "Fred is described as someone who asks Harry about his schedule for the afternoon."
    },
    {
      "name": "harry",
      "entity_type": "student",
      "singular": true,
      "description": "Harry is described as a student who has to face Trelawney and Umbridge in Defense Against the Dark Arts class."
    },
    {
      "name": "trelawney",
      "entity_type": "professor",
      "singular": true,
      "description": "Trelawney is described as someone who is mentioned alongside Umbridge as Harry's teachers for Defense Against the Dark Arts class."
    },
    {
      "name": "umbridge",
      "entity_type": "professor",
      "singular": true,
      "description": "Umbridge is described as someone who is mentioned alongside Trelawney as Harry's teachers for Defense Against the Dark Arts class. She is also mentioned as someone whom George advises Harry to keep his temper with."
    },
    {
      "name": "angelina",
      "entity_type": "student",
      "singular": true,
      "description": "Angelina is described as someone who will be upset if Harry misses any more Quidditch practices."
    }
  ],
  "relationships": [
    {
      "entity_1": "george",
      "entity_2": "umbridge",
      "relationship_type": "advice",
      "description": "George advises Harry to keep his temper with Umbridge during the class."
    },
    {
      "entity_1": "fred",
      "entity_2": "harry",
      "relationship_type": "questioning",
      "description": "Fred asks Harry about his schedule for the afternoon."
    },
    {
      "entity_1": "alicia",
      "entity_2": "harry",
      "relationship_type": "informing",
      "description": "Alicia tells Harry that the classes are normally really good."
    }
  ]
}