{
  "entities": [
    {
      "name": "hedwig",
      "entity_type": "animal",
      "singular": true,
      "description": "Hedwig is Harry's owl, described as taking off into the sky with a moment's pressure on his arm. (\"dows; with a moment’s pressure on his arm Hedwig took off into the blindingly bright sky.\")"
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as the inhabitant of Hagrid's hut, which is described as uninhabited. (\"He watched her until she became a tiny black speck and vanished, then switched his gaze to Hagrid’s hut, clearly visible from this window, and just as clearly uninhabited...\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character, described as watching Hedwig take off and later seeing a great reptilian winged horse. (\"He watched her until she became a tiny black speck and vanished, then switched his gaze to Hagrid’s hut... Harry watched them, savoring the fresh air on his face...\")"
    },
    {
      "name": "forbidden forest",
      "entity_type": "location",
      "singular": true,
      "description": "The Forbidden Forest is mentioned as swaying in a light breeze. (\"The treetops of the Forbidden Fo rest swayed in a light breeze.\")"
    },
    {
      "name": "quidditch",
      "entity_type": "activity",
      "singular": false,
      "description": "Quidditch is mentioned as something Harry will be thinking about later. (\"Harry watched them, savoring the fresh air on his face, thinking about Quidditch later...\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hedwig",
      "relationship_type": "observed_by",
      "description": "Harry observed Hedwig taking off into the sky. (\"dows; with a moment’s pressure on his arm Hedwig took off into the blindingly bright sky.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "forbidden forest",
      "relationship_type": "observed_by",
      "description": "Harry observed the Forbidden Forest swaying in a light breeze. (\"The treetops of the Forbidden Fo rest swayed in a light breeze.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "quidditch",
      "relationship_type": "thinking_about",
      "description": "Harry was thinking about Quidditch later. (\"Harry watched them, savoring the fresh air on his face, thinking about Quidditch later...\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "reptilian winged horse",
      "relationship_type": "observed_by",
      "description": "Harry observed a great reptilian winged horse. (\"A great, reptilian winged horse... rose up out of the trees like a grotesque, giant bird.\")"
    }
  ]
}