{
  "entities": [
    {
      "name": "everard",
      "entity_type": "person",
      "singular": true,
      "description": "Everard is mentioned as one of the two most celebrated Heads of Hogwarts, with a portrait hanging in other important Wizarding institutions. (\"Everard and Dilys were two of Hogwarts’s most celebrated Heads\")"
    },
    {
      "name": "dilys",
      "entity_type": "person",
      "singular": true,
      "description": "Dilys is mentioned as one of the two most celebrated Heads of Hogwarts, with a portrait hanging in other important Wizarding institutions. (\"Everard and Dilys were two of Hogwarts’s most celebrated Heads\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as one of the students present, who is skeptical about Mr. Weasley's whereabouts. (\"But Mr. Weasley could be anywhere! said Harry.\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as one of the students present, who is skeptical about Mr. Weasley's whereabouts. (\"But Mr. Weasley could be anywhere! said Harry.\")"
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as one of the professors present, who is asked to draw up extra chairs. (\"Please sit down, all three of you,\" said Dumbledore, as though Harry had not spoken. \"Everard and Dilys may not be back for several minutes... Professor McGonagall, if you could draw up extra chairs .\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as the one speaking to Harry, Ron, and Professor McGonagall. (\"Everard and Dilys were two of Hogwarts’s most celebrated Heads,\" Dumbledore said...)"
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is mentioned as someone who could be anywhere, causing Harry to express skepticism. (\"But Mr. Weasley could be anywhere! said Harry.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "everard",
      "relationship_type": "speaks_about",
      "description": "Dumbledore is speaking about Everard, mentioning that he and Dilys are two of the most celebrated Heads of Hogwarts. (\"Everard and Dilys were two of Hogwarts’s most celebrated Heads,\" Dumbledore said...)"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "dilys",
      "relationship_type": "speaks_about",
      "description": "Dumbledore is speaking about Dilys, mentioning that she and Everard are two of the most celebrated Heads of Hogwarts. (\"Everard and Dilys were two of Hogwarts’s most celebrated Heads,\" Dumbledore said...)"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "professor mcgonagall",
      "relationship_type": "requests_action",
      "description": "Dumbledore is asking Professor McGonagall to draw up extra chairs. (\"Professor McGonagall, if you could draw up extra chairs .\")"
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "dumbledore",
      "relationship_type": "complies_with_request",
      "description": "Professor McGonagall is complying with Dumbledore's request to draw up extra chairs. (\"Professor McGonagall pulled her wand from the pocket of her dressing gown and waved it; three chairs appeared out of thin air...\")"
    }
  ]
}