{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as yelling 'RUN!' to alert others, indicating he is taking charge in the situation. (\"‘RUN!’ Harry yelled\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as having her robes seized by Harry, showing she is being protected or helped by him. (\"he seized a handful of Hermione’s robes and dragged her forward\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as sprinting past Harry, indicating he is also trying to escape the danger. (\"Harry found the way ahead clear and saw Ron, Ginny, and Luna sprint past him\")"
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as sprinting past Harry, indicating she is also trying to escape the danger. (\"Harry found the way ahead clear and saw Ron, Ginny, and Luna sprint past him\")"
    },
    {
      "name": "luna",
      "entity_type": "person",
      "singular": true,
      "description": "Luna is mentioned as sprinting past Harry, indicating she is also trying to escape the danger. (\"Harry found the way ahead clear and saw Ron, Ginny, and Luna sprint past him\")"
    },
    {
      "name": "death eater",
      "entity_type": "person",
      "singular": true,
      "description": "A Death Eater is mentioned as lunging forward through the dust, indicating they are trying to attack Harry and others. (\"A Death Eater lunged forward throug h the cloud of dust\")"
    },
    {
      "name": "shelves",
      "entity_type": "object",
      "singular": false,
      "description": "The shelves are described as collapsing upon themselves, causing a loud noise and chaos. (\"thunderous crashes as  the shelves collapsed upon them-selves\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "helped",
      "description": "Harry is helping Hermione by dragging her forward and protecting her from the danger. (\"he seized a handful of Hermione’s robes and dragged her forward\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "saw",
      "description": "Harry sees Ron sprinting past him, indicating they are both trying to escape the danger. (\"Harry found the way ahead clear and saw Ron, Ginny, and Luna sprint past him\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "ginny",
      "relationship_type": "saw",
      "description": "Harry sees Ginny sprinting past him, indicating they are both trying to escape the danger. (\"Harry found the way ahead clear and saw Ron, Ginny, and Luna sprint past him\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "luna",
      "relationship_type": "saw",
      "description": "Harry sees Luna sprinting past him, indicating they are both trying to escape the danger. (\"Harry found the way ahead clear and saw Ron, Ginny, and Luna sprint past him\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "death eater",
      "relationship_type": "elbowed",
      "description": "Harry elbowed a Death Eater in the masked face, indicating he is defending himself against their attack. (\"A Death Eater lunged forward throug h the cloud of dust and Harry el-bowed him hard in the ma sked face\")"
    },
    {
      "entity_1": "hermione",
      "entity_2": "death eater",
      "relationship_type": "stunned",
      "description": "Hermione casts a Stupefy spell on a Death Eater, stunning them and allowing Harry to escape. (\"She heard Hermione shout ‘Stupefy!’ and the hand released him at once\")"
    }
  ]
}