{
  "entities": [
    {
      "name": "arthur",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur is mentioned as someone who has received an urgent message from Mr. Weasley. The description of Arthur receiving the message is found in the text: 'Oh Arthur!' he said desperately, without looking at Harry."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who has missed an urgent message from Mr. Weasley. The description of Harry missing the message is found in the text: 'I didn’t know what to do for the best, whether to wait here for you or not, I’ve just sent an owl to your home but you’ve obviously missed it —'"
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is mentioned as someone who has sent an urgent message to Arthur and Harry. The description of Mr. Weasley sending the message is found in the text: 'I’ve just sent an owl to your home but you’ve obviously missed it —'"
    },
    {
      "name": "perkins",
      "entity_type": "person",
      "singular": true,
      "description": "Perkins is mentioned as someone who is present in the office with Mr. Weasley and Harry. The description of Perkins is found in the text: 'Perkins flattened himself against the filing cabinets as Mr. Weasley left the office at a run, Harry on his heels.'"
    },
    {
      "name": "potter boy",
      "entity_type": "person",
      "singular": true,
      "description": "The Potter Boy is mentioned as someone who has a hearing that has been changed in time and venue. The description of the Potter Boy's hearing is found in the text: 'No, no, it’s not the toilet, it’s the Potter boy’s hearing — they’ve changed the time and venue —'"
    }
  ],
  "relationships": [
    {
      "entity_1": "mr weasley",
      "entity_2": "harry",
      "relationship_type": "informant",
      "description": "Mr. Weasley informs Harry about the change in time and venue of the Potter Boy's hearing. The description of Mr. Weasley informing Harry is found in the text: 'No, no, it’s not the toilet, it’s the Potter boy’s hearing — they’ve changed the time and venue —'"
    },
    {
      "entity_1": "mr weasley",
      "entity_2": "arthur",
      "relationship_type": "informant",
      "description": "Mr. Weasley informs Arthur about the change in time and venue of the Potter Boy's hearing. The description of Mr. Weasley informing Arthur is found in the text: 'No, no, it’s not the toilet, it’s the Potter boy’s hearing — they’ve changed the time and venue —'"
    },
    {
      "entity_1": "mr weasley",
      "entity_2": "perkins",
      "relationship_type": "leaves_with",
      "description": "Mr. Weasley leaves with Perkins as they both rush to the Potter Boy's hearing. The description of Mr. Weasley leaving with Perkins is found in the text: 'Perkins flattened himself against the filing cabinets as Mr. Weasley left the office at a run, Harry on his heels.'"
    }
  ]
}