{
  "entities": [
    {
      "name": "hogsmeade",
      "entity_type": "location",
      "singular": true,
      "description": "The village where Harry and his friends are located. (\"What were they going to do if the great black dog came bounding up the street toward them in Hogsmeade...\")"
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's godfather who is on the run from Voldemort. (\"he still worried from time to time that Sirius might throw caution to the winds and turn up anyway.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story. (\"Harry knew they had made him angry by saying that they did not want him to come...\")"
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "A Slytherin student who is a rival of Harry's. (\"perhaps under the nose of Draco Malfoy...\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's best friend. (\"said Ron, when Harry discussed his fears with him and Hermione.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's other best friend. (\"Hermione scowled at Ron...\")"
    },
    {
      "name": "kreacher",
      "entity_type": "person",
      "singular": true,
      "description": "An elf who is being kept by the Malfoy family. (\"but otherwise ignored the slight on Kreacher.\")"
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "The main antagonist of the story. (\"until V-Voldemort — oh for heaven’s sake, Ron — comes out into the open...\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "concern",
      "description": "Harry is concerned about Sirius's safety. (\"he still worried from time to time that Sirius might throw caution to the winds and turn up anyway.\")"
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "friendship",
      "description": "Ron is friends with Harry. (\"said Ron, when Harry discussed his fears with him and Hermione.\")"
    },
    {
      "entity_1": "hermione",
      "entity_2": "kreacher",
      "relationship_type": "dislike",
      "description": "Hermione dislikes Kreacher. (\"but otherwise ignored the slight on Kreacher.\")"
    },
    {
      "entity_1": "voldemort",
      "entity_2": "sirius",
      "relationship_type": "threat",
      "description": "Voldemort is a threat to Sirius's safety. (\"until V-Voldemort — oh for heaven’s sake, Ron — comes out into the open...\")"
    }
  ]
}