{
  "entities": [
    {
      "name": "dudley",
      "entity_type": "person",
      "singular": true,
      "description": "Dudley is described as someone who has many friends and is popular. He is also mentioned to have lied about having tea with a different member of his gang every night during the summer holidays."
    },
    {
      "name": "aunt petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Aunt Petunia is fondly talking about Dudley and mentioning how popular he is. She believes that he has tea with a different member of his gang every night during the summer holidays."
    },
    {
      "name": "polkisses",
      "entity_type": "family",
      "singular": true,
      "description": "The Polkisses are mentioned as the place where Dudley supposedly has tea with his friends. However, it is revealed that this is a lie and he actually spends his evenings vandalizing the play park."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as someone who knows the truth about Dudley's activities during the summer holidays. He has seen Dudley and his gang vandalizing the play park and throwing stones at passing cars and children."
    },
    {
      "name": "dursleys",
      "entity_type": "family",
      "singular": false,
      "description": "The Dursleys are described as being astonishingly stupid about their son, Dudley. They have swallowed all of his lies about having tea with a different member of his gang every night during the summer holidays."
    },
    {
      "name": "little whinging",
      "entity_type": "location",
      "singular": true,
      "description": "Little Whinging is mentioned as the place where Harry spends most of his holidays wandering the streets and scavenging newspapers from bins."
    }
  ],
  "relationships": [
    {
      "entity_1": "dudley",
      "entity_2": "polkisses",
      "relationship_type": "visited",
      "description": "Dudley supposedly visits the Polkisses for tea, but it is revealed that this is a lie. He actually spends his evenings vandalizing the play park."
    },
    {
      "entity_1": "dudley",
      "entity_2": "harry",
      "relationship_type": "opposite",
      "description": "Dudley and Harry have opposite personalities and behaviors. Dudley lies about having tea with a different member of his gang every night, while Harry knows the truth and sees them vandalizing the play park."
    },
    {
      "entity_1": "dursleys",
      "entity_2": "dudley",
      "relationship_type": "parent_child",
      "description": "The Dursleys are Dudley's parents. They have swallowed all of his lies about having tea with a different member of his gang every night during the summer holidays."
    },
    {
      "entity_1": "harry",
      "entity_2": "little whinging",
      "relationship_type": "spent_time_in",
      "description": "Harry spends most of his holidays wandering the streets in Little Whinging and scavenging newspapers from bins."
    }
  ]
}