{
  "entities": [
    {
      "name": "venus",
      "entity_type": "celestial_body",
      "singular": true,
      "description": "Venus is mentioned as a celestial body that Harry needs to locate using his telescope. (\"He had quite forgotten Venus’s position — jamming his eye to his telescope, he found it again...\")"
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as having lights on in his windows and being present at the scene. (\"There were lights on in Hagrid’s windows... The door opened and he distinctly saw six tiny but sharply defined figures walk over the threshold.\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone Harry glances around to see if they have noticed what Harry has seen. (\"He glanced around to see whether Ron or Hermione had noticed what he had...\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone Harry glances around to see if they have noticed what Harry has seen. (\"He glanced around to see whether Ron or Hermione had noticed what he had...\")"
    },
    {
      "name": "professor marchbanks",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Marchbanks is mentioned as walking behind Harry and distracting him from looking at others' work. (\"Professor Marchbanks came walking behind him at that moment, and not wanting to appear as though he was sneaking looks at anyone else’s work...\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "venus",
      "relationship_type": "observes",
      "description": "Harry observes Venus using his telescope. (\"He had quite forgotten Venus’s position — jamming his eye to his telescope, he found it again...\")"
    },
    {
      "entity_1": "hagrid",
      "entity_2": "six tiny but sharply defined figures",
      "relationship_type": "hosts",
      "description": "Hagrid is hosting six tiny but sharply defined figures at his place. (\"The door opened and he distinctly saw six tiny but sharply defined figures walk over the threshold.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "looks_at",
      "description": "Harry looks at Ron's work, but it is not clear if they are actually interacting. (\"He glanced around to see whether Ron or Hermione had noticed what he had...\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "looks_at",
      "description": "Harry looks at Hermione's work, but it is not clear if they are actually interacting. (\"He glanced around to see whether Ron or Hermione had noticed what he had...\")"
    },
    {
      "entity_1": "professor marchbanks",
      "entity_2": "harry",
      "relationship_type": "interrupts",
      "description": "Professor Marchbanks interrupts Harry's observation of others' work. (\"Professor Marchbanks came walking behind him at that moment, and not wanting to appear as though he was sneaking looks at anyone else’s work...\")"
    }
  ]
}