{
  "entities": [
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is introduced as the one who provoked Harry and George. He is described as having a jaw that was bruised by Harry's knuckles (Chapter 19, page 414)."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as the one who had his knuckles bruised against Malfoy's jaw. He is also described as entering Professor McGonagall's office with George (Chapter 19, page 414)."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is introduced as the one who entered Professor McGonagall's office with Harry (Chapter 19, page 414)."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is introduced as the one who came marching along the corridor behind Harry and George. She is described as wearing a Gryffindor scarf, but tore it from her throat with shaking hands (Chapter 19, page 414)."
    },
    {
      "name": "snitch",
      "entity_type": "object",
      "singular": true,
      "description": "The Snitch is introduced as the object that was found by Harry. It has silver wings protruding from between his fingers (Chapter 19, page 414)."
    },
    {
      "name": "gryffindor scarf",
      "entity_type": "object",
      "singular": true,
      "description": "The Gryffindor scarf is introduced as the one that Professor McGonagall was wearing. She tore it from her throat with shaking hands (Chapter 19, page 414)."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "malfoy",
      "relationship_type": "provoked",
      "description": "Harry and George were provoked by Malfoy. This is described in the text as 'Malfoy provoked us' (Chapter 19, page 414)."
    },
    {
      "entity_1": "harry",
      "entity_2": "professor mcgonagall",
      "relationship_type": "defended_by",
      "description": "Harry and George were defended by Professor McGonagall. This is described in the text as 'In!' she said furiously, pointing to the door (Chapter 19, page 414)."
    },
    {
      "entity_1": "george",
      "entity_2": "professor mcgonagall",
      "relationship_type": "defended_by",
      "description": "George was also defended by Professor McGonagall. This is described in the text as 'In!' she said furiously, pointing to the door (Chapter 19, page 414)."
    }
  ]
}