{
  "entities": [
    {
      "name": "alastor",
      "entity_type": "person",
      "singular": true,
      "description": "Alastor is mentioned as someone who should be asked to look at the boggart before it's let out. (\"be a boggart, but I thought we ought to ask Alastor to have a look at it before we let it out.\")"
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as responding indifferently to the suggestion of asking Alastor to look at the boggart. (\"Whatever you like,\" said Sirius indifferently.)"
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Weasley is mentioned as noticing that the curtains are full of doxies and suggesting tackling them tomorrow. (\"The curtains in there are full of doxies too,\" Mrs. Weasley went on. \"I thought we might try and tackle them tomorrow.\")"
    },
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is mentioned as entertaining Hermione and Ginny by transforming her nose between mouthfuls. (Opposite Harry, Tonks was entertaining Hermione and Ginny by transforming her nose between mouthfuls.)"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as being entertained by Tonks' nose transformations. (Apparently this was a regular mealtime entertainment, because after a while Hermione and Ginny started requesting their favorite noses.)"
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as being entertained by Tonks' nose transformations. (Apparently this was a regular mealtime entertainment, because after a while Hermione and Ginny started requesting their favorite noses.)"
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as having a beak-like protuberance on his nose. (Screwing up her eyes each time with the same pained expression she had worn back in Harry’s bedroom, her nose swelled to a beak like protuberance like Snape’s.)"
    }
  ],
  "relationships": [
    {
      "entity_1": "alastor",
      "entity_2": "boggart",
      "relationship_type": "has_look",
      "description": "Alastor is asked to look at the boggart before it's let out. (\"be a boggart, but I thought we ought to ask Alastor to have a look at it before we let it out.\")"
    },
    {
      "entity_1": "sirius",
      "entity_2": "boggart",
      "relationship_type": "has_no_concern",
      "description": "Sirius shows no concern about the boggart. (\"Whatever you like,\" said Sirius indifferently.)"
    },
    {
      "entity_1": "mrs weasley",
      "entity_2": "curtains",
      "relationship_type": "is_full_of_doxies",
      "description": "Mrs Weasley notices that the curtains are full of doxies. (\"The curtains in there are full of doxies too,\" Mrs. Weasley went on.)"
    },
    {
      "entity_1": "tonks",
      "entity_2": "nose",
      "relationship_type": "can_transform",
      "description": "Tonks is able to transform her nose between mouthfuls. (Opposite Harry, Tonks was entertaining Hermione and Ginny by transforming her nose between mouthfuls.)"
    },
    {
      "entity_1": "hermione",
      "entity_2": "nose",
      "relationship_type": "requests_shape",
      "description": "Hermione requests a specific shape for Tonks' nose. (\"Do that one like a pig snout, Tonks . . .\")"
    }
  ]
}