{
  "entities": [
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is mentioned as someone who obliged, indicating they are a person involved in the scene."
    },
    {
      "name": "dudley",
      "entity_type": "person",
      "singular": true,
      "description": "Dudley is mentioned as having a female version grinning at Harry from across the table, indicating he is a person present in the scene."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as looking up and seeing Dudley's female version, indicating he is a person involved in the scene."
    },
    {
      "name": "mr. weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is mentioned as having an intense discussion with Bill and Lupin about goblins, indicating he is a person present in the scene."
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is mentioned as being part of the intense discussion with Mr. Weasley and Lupin about goblins, indicating he is a person present in the scene."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is mentioned as being part of the intense discussion with Mr. Weasley and Bill about goblins, indicating he is a person present in the scene."
    },
    {
      "name": "goblins",
      "entity_type": "group",
      "singular": false,
      "description": "Goblins are mentioned as being discussed by Mr. Weasley, Bill, and Lupin, indicating they are a group of entities involved in the scene."
    }
  ],
  "relationships": [
    {
      "entity_1": "mr. weasley",
      "entity_2": "goblins",
      "relationship_type": "discussing",
      "description": "Mr. Weasley is discussing goblins with Bill and Lupin, indicating a relationship between him and the group of goblins."
    },
    {
      "entity_1": "bill",
      "entity_2": "goblins",
      "relationship_type": "discussing",
      "description": "Bill is also part of the discussion about goblins with Mr. Weasley and Lupin, indicating a relationship between him and the group of goblins."
    },
    {
      "entity_1": "lupin",
      "entity_2": "goblins",
      "relationship_type": "discussing",
      "description": "Lupin is also part of the discussion about goblins with Mr. Weasley and Bill, indicating a relationship between him and the group of goblins."
    },
    {
      "entity_1": "mr. weasley",
      "entity_2": "ragnok",
      "relationship_type": "trying_to_contact",
      "description": "Mr. Weasley is trying to contact Ragnok, indicating a relationship between him and the person named Ragnok."
    }
  ]
}