{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character, Harry, is described as reaching out to seize the brass handle and pulling open the door. He is also mentioned as leading the way into a spacious room."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as enthusiastically saying 'These will be good when we’re practicing Stunning' and prodding one of the cushions with his foot. He is described as excited about the instruments in the room."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as excitedly running a finger along the spines of the large leather-bound tomes and saying 'And just look at these books!' She is described as enthusiastic about the books in the room."
    },
    {
      "name": "sneakoscopes",
      "entity_type": "instrument",
      "singular": false,
      "description": "Sneakoscopes are mentioned as one of the instruments on the shelves at the far end of the room. They are described as being used for practicing Stunning spells."
    },
    {
      "name": "secrecy sensors",
      "entity_type": "instrument",
      "singular": false,
      "description": "Secrecy Sensors are mentioned as one of the instruments on the shelves at the far end of the room. They are described as being used for practicing Stunning spells."
    },
    {
      "name": "foe-glass",
      "entity_type": "instrument",
      "singular": true,
      "description": "The Foe-Glass is mentioned as a large, cracked instrument on the shelves at the far end of the room. It is described as having hung in the fake Moody’s office the previous year."
    },
    {
      "name": "a compendium of common curses and their counter-actions",
      "entity_type": "book",
      "singular": true,
      "description": "A Compendium of Common Curses and Their Counter-Actions is mentioned as one of the large leather-bound tomes on the shelves. It is described as being a book about common curses and their counter-actions."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "brass handle",
      "relationship_type": "grasped",
      "description": "Harry reached out to seize the brass handle, pulling open the door and leading the way into a spacious room."
    },
    {
      "entity_1": "ron",
      "entity_2": "cushions",
      "relationship_type": "prodded",
      "description": "Ron prodded one of the cushions with his foot, enthusiastically saying 'These will be good when we’re practicing Stunning'."
    },
    {
      "entity_1": "hermione",
      "entity_2": "books",
      "relationship_type": "examined",
      "description": "Hermione ran a finger along the spines of the large leather-bound tomes, excitedly saying 'And just look at these books!'"
    },
    {
      "entity_1": "harry",
      "entity_2": "foe-glass",
      "relationship_type": "recognized",
      "description": "Harry recognized the Foe-Glass as having hung in the fake Moody’s office the previous year."
    }
  ]
}