{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is introduced as a character who has been attacked and is trying to downplay his injuries. He is described as being in a 'right state' and having 'cuts' that look 'nasty'."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is introduced as one of Hagrid's friends who is concerned about his well-being. He is described as being 'right state' and trying to get Hagrid to see Madam Pomfrey."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is introduced as one of Hagrid's friends who is concerned about his well-being. She suggests that he should go and see Madam Pomfrey."
    },
    {
      "name": "madam pomfrey",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Pomfrey is introduced as a character who is a healer or nurse. Hermione suggests that Hagrid should go and see her to get his injuries treated."
    },
    {
      "name": "mince",
      "entity_type": "food",
      "singular": true,
      "description": "Mince is mentioned as an example of something that would be unacceptable if someone turned up with it instead of their face. It is used to illustrate the severity of Hagrid's injuries."
    },
    {
      "name": "steak",
      "entity_type": "food",
      "singular": true,
      "description": "A raw, bloody, green-tinged steak is mentioned as being under a tea towel on Hagrid's table. It is described as being slightly larger than the average car tire."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "ron",
      "relationship_type": "concerned_about",
      "description": "Ron is concerned about Hagrid's well-being and tries to get him to see Madam Pomfrey."
    },
    {
      "entity_1": "hermione",
      "entity_2": "hagrid",
      "relationship_type": "concerned_about",
      "description": "Hermione is also concerned about Hagrid's well-being and suggests that he should go and see Madam Pomfrey."
    },
    {
      "entity_1": "ron",
      "entity_2": "mince",
      "relationship_type": "unacceptable",
      "description": "Ron uses mince as an example of something that would be unacceptable if someone turned up with it instead of their face, illustrating the severity of Hagrid's injuries."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "steak",
      "relationship_type": "has",
      "description": "Hagrid has a raw, bloody, green-tinged steak on his table, which is described as being slightly larger than the average car tire."
    }
  ]
}