{
  "entities": [
    {
      "name": "bell",
      "entity_type": "person",
      "singular": true,
      "description": "Bell is mentioned as scoring twice in a few seconds, indicating that they are participating in some sort of game or competition."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is watching Bell play and is concerned about the Keeper being Ron. He looks away frequently to avoid detection."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as a possible Keeper, which suggests that he may be involved in the game or competition that Bell and Harry are watching."
    },
    {
      "name": "umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge's quill is heard scratching on parchment, indicating that she is writing something. This suggests that she may be keeping track of the game or competition in some way."
    },
    {
      "name": "bludge",
      "entity_type": "object",
      "singular": true,
      "description": "Bludge is mentioned as being dodged exceptionally well by one of the players, but then fumbled an easy save. This suggests that Bludge may be a player or a team in the game or competition."
    },
    {
      "name": "keeper",
      "entity_type": "position",
      "singular": true,
      "description": "The Keeper is mentioned as being Ron, which suggests that they are responsible for keeping track of the game or competition in some way."
    }
  ],
  "relationships": [
    {
      "entity_1": "bell",
      "entity_2": "harry",
      "relationship_type": "watching",
      "description": "Bell is being watched by Harry, who is concerned about the Keeper being Ron and looks away frequently to avoid detection."
    },
    {
      "entity_1": "umbridge",
      "entity_2": "bludge",
      "relationship_type": "writing_about",
      "description": "Umbridge's quill is heard scratching on parchment, indicating that she is writing about Bludge and the game or competition."
    }
  ]
}