{
  "entities": [
    {
      "name": "luna lovegood",
      "entity_type": "person",
      "singular": true,
      "description": "Luna Lovegood is mentioned as a character who can see the bat-winged horses. She is described as having silvery eyes and being able to see them since her first day at Hogwarts."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is mentioned as a character who cannot see the bat-winged horses. He is described as looking worried about Harry and making a joke about it."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as a character who can see the bat-winged horses but is unsure if he is going mad. He is described as looking worried and desperate for reassurance from Luna."
    },
    {
      "name": "bat-winged horses",
      "entity_type": "animal",
      "singular": false,
      "description": "The bat-winged horses are mentioned as being able to pull carriages. They are described as being visible to Luna but not to Ron or Harry."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "luna lovegood",
      "relationship_type": "reassurance",
      "description": "Harry is reassured by Luna that he is sane and can see the bat-winged horses. This is described in the text as Luna telling Harry 'You're just as sane as I am'."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "bat-winged horses",
      "relationship_type": "visibility",
      "description": "Harry can see the bat-winged horses. This is described in the text as Harry being able to 'see them too'."
    },
    {
      "entity_1": "luna lovegood",
      "entity_2": "bat-winged horses",
      "relationship_type": "visibility",
      "description": "Luna can see the bat-winged horses. This is described in the text as Luna saying 'I've been able to see them ever since my first day here'."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "bat-winged horses",
      "relationship_type": "invisibility",
      "description": "Ron cannot see the bat-winged horses. This is described in the text as Ron saying 'I don't know what you're talking about'."
    }
  ]
}