{
  "entities": [
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is a Ministry official who is involved in the hearing. He is described as shouting and banging his fist on the judge's bench (\"Fudge shouted, banging his fist  on the judge’s bench and upsetting a bottle of ink.\")."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is a calm and polite wizard who is defending Harry. He is described as speaking calmly (\"said Dumbledore calmly\")."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the subject of the hearing. He is mentioned several times in the conversation between Fudge and Dumbledore."
    },
    {
      "name": "ministry",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry is a governing body that has authority over wizards and witches. It is mentioned as having no power to punish Hogwarts students for misdemeanors at school (\"but as the Ministry has no authority to punish Hogwarts students for misdemeanors at school\")."
    },
    {
      "name": "hogwarts",
      "entity_type": "school",
      "singular": true,
      "description": "Hogwarts is a school for wizards and witches. It is mentioned as being separate from the Ministry's authority (\"but as the Ministry has no authority to punish Hogwarts students for misdemeanors at school\")."
    }
  ],
  "relationships": [
    {
      "entity_1": "fudge",
      "entity_2": "harry",
      "relationship_type": "accusation",
      "description": "Fudge is accusing Harry of misbehavior (\"And I haven’t even started on what  he gets up to at school —\")."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "fudge",
      "relationship_type": "defense",
      "description": "Dumbledore is defending Harry against Fudge's accusations (\"The Ministry does not have the power to expel Hogwarts students, Cornelius, as I reminded yo u on the night of the second of\")."
    },
    {
      "entity_1": "ministry",
      "entity_2": "hogwarts",
      "relationship_type": "authority",
      "description": "The Ministry has authority over Hogwarts (\"but as the Ministry has no authority to punish Hogwarts students for misdemeanors at school\")."
    }
  ]
}