{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as one of the people who are being toasted and applauded. (\"Ron and Hermione beamed as everyone drank to them and then applauded.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as one of the people who are being toasted and applauded. (\"Ron and Hermione beamed as everyone drank to them and then applauded.\")"
    },
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is mentioned as someone who was never a prefect herself. (\"I was never a prefect myself,\" said Tonks brightly from behind Harry...)"
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as someone who is talking to Tonks and laughing at her joke. (\"Like what?\" said Ginny, who was choosing a baked potato.)"
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as someone who is right beside Harry and letting out his usual barklike laugh. (\"What about you, Sirius?\" Ginny asked... \"No one would have made me a prefect, I spent too much time in detention with James.\")"
    },
    {
      "name": "james",
      "entity_type": "person",
      "singular": true,
      "description": "James is mentioned as someone who was in detention with Sirius. (\"No one would have made me a prefect, I spent too much time in detention with James.\")"
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is mentioned as the good boy who got the badge. (\"Lupin was the good boy, he got the badge.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "tonks",
      "entity_2": "ginny",
      "relationship_type": "similar_to",
      "description": "Tonks is described as looking like Ginny's older sister. (\"Her hair was tomato-red and waist length today; she looked like Ginny’s older sister.\")"
    },
    {
      "entity_1": "tonks",
      "entity_2": "dumbledore",
      "relationship_type": "hoped_by",
      "description": "Dumbledore might have hoped that Tonks would be able to excel. (\"I think Dumbledore might have hoped that I would be able to ex-...\")"
    },
    {
      "entity_1": "sirius",
      "entity_2": "james",
      "relationship_type": "detained_with",
      "description": "Sirius and James were in detention together. (\"No one would have made me a prefect, I spent too much time in detention with James.\")"
    },
    {
      "entity_1": "lupin",
      "entity_2": "dumbledore",
      "relationship_type": "approved_by",
      "description": "Dumbledore approved of Lupin and gave him the badge. (\"Lupin was the good boy, he got the badge.\")"
    }
  ]
}