{
  "entities": [
    {
      "name": "potter",
      "entity_type": "person",
      "singular": true,
      "description": "The person being addressed by Professor Snape. The text describes Potter as someone who has been affected by the curse and is sharing thoughts with the Dark Lord."
    },
    {
      "name": "dark lord",
      "entity_type": "organization",
      "singular": true,
      "description": "A powerful and evil entity that has a connection to Potter. The text suggests that the Dark Lord's thoughts and emotions are being shared with Potter when he is asleep."
    },
    {
      "name": "professor dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "The headmaster of Hogwarts who thinks it inadvisable for Potter to continue sharing thoughts with the Dark Lord. The text describes Dumbledore as someone who wants to teach Potter how to close his mind to the Dark Lord."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "A professor at Hogwarts who is tasked with teaching Potter how to close his mind to the Dark Lord. The text describes Snape as someone who is staring at Harry and tracing his mouth."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story who is being addressed by Professor Snape. The text describes Harry as someone who has been affected by the curse and is sharing thoughts with the Dark Lord."
    },
    {
      "name": "mr. weasley",
      "entity_type": "person",
      "singular": true,
      "description": "A person who was attacked by a snake. The text suggests that Potter's ability to see the attack allowed Dumbledore to save Weasley."
    },
    {
      "name": "snake",
      "entity_type": "animal",
      "singular": true,
      "description": "An animal that attacked Mr. Weasley. The text describes the snake as something that Potter was able to see and prevent from harming Weasley."
    },
    {
      "name": "harry's heart",
      "entity_type": "body_part",
      "singular": true,
      "description": "A part of Harry's body that is described as pumping fast again."
    }
  ],
  "relationships": [
    {
      "entity_1": "potter",
      "entity_2": "dark lord",
      "relationship_type": "shared_thoughts",
      "description": "The text suggests that Potter and the Dark Lord share thoughts and emotions when Potter is asleep."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "potter",
      "relationship_type": "concerned_for",
      "description": "Dumbledore is concerned for Potter's well-being and wants to teach him how to close his mind to the Dark Lord."
    },
    {
      "entity_1": "snape",
      "entity_2": "potter",
      "relationship_type": "tasked_with_teaching",
      "description": "Snape has been tasked with teaching Potter how to close his mind to the Dark Lord."
    }
  ]
}