{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is introduced as a character in the story. He is described as wearing a green tweed cloak and a matching hat with earflaps. His height is also mentioned, barely reaching Dolores Umbridge's navel."
    },
    {
      "name": "dolores umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Dolores Umbridge is introduced as a character in the story. She is described as wearing a handbag and has bulging eyes that are rolling in every direction. Her name is mentioned when she introduces herself to Hagrid."
    },
    {
      "name": "fang",
      "entity_type": "animal",
      "singular": true,
      "description": "Fang is introduced as Hagrid's dog. He is described as bounding up to Dolores Umbridge and attempting to lick her face."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as being present in the cabin with Harry and Hermione."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as being present in the cabin with Ron and Harry."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being present in the cabin with Ron and Hermione."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "dolores umbridge",
      "relationship_type": "met",
      "description": "Hagrid meets Dolores Umbridge for the first time. This is mentioned when Hagrid asks her who she is."
    },
    {
      "entity_1": "dolores umbridge",
      "entity_2": "hagrid",
      "relationship_type": "introduced",
      "description": "Dolores Umbridge introduces herself to Hagrid. This is mentioned when she says 'My name is Dolores Umbridge.'"
    },
    {
      "entity_1": "hagrid",
      "entity_2": "fang",
      "relationship_type": "owner",
      "description": "Hagrid owns Fang, his dog. This is implied by the fact that Fang bounds up to Dolores Umbridge and attempts to lick her face."
    },
    {
      "entity_1": "dolores umbridge",
      "entity_2": "harry",
      "relationship_type": "seen",
      "description": "Dolores Umbridge sees Harry, who is sandwiched between Ron and Hermione in the corner of the cabin. This is mentioned when her eyes sweep the cabin and stare directly into the corner where Harry stands."
    },
    {
      "entity_1": "dolores umbridge",
      "entity_2": "ron",
      "relationship_type": "seen",
      "description": "Dolores Umbridge sees Ron, who is present in the cabin with Harry and Hermione. This is mentioned when her eyes sweep the cabin and stare directly into the corner where Harry stands."
    },
    {
      "entity_1": "dolores umbridge",
      "entity_2": "hermione",
      "relationship_type": "seen",
      "description": "Dolores Umbridge sees Hermione, who is present in the cabin with Ron and Harry. This is mentioned when her eyes sweep the cabin and stare directly into the corner where Harry stands."
    }
  ]
}