{
  "entities": [
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being angry and not speaking to Hermione in Charms class."
    },
    {
      "name": "Hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as being present in the classroom."
    },
    {
      "name": "Ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as whispering to Hermione and expressing his desire for Umbridge to get what she deserves."
    },
    {
      "name": "Umbridge",
      "entity_type": "person",
      "singular": true,
      "description": "Umbridge is mentioned as sitting in a corner with a clipboard."
    },
    {
      "name": "Professor McGonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as marching into the room without acknowledging Professor Umbridge's presence."
    },
    {
      "name": "Mr. Finnigan",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Finnigan is mentioned as being called upon by Professor McGonagall to hand back homework."
    },
    {
      "name": "Miss Brown",
      "entity_type": "person",
      "singular": true,
      "description": "Miss Brown is mentioned as being called upon by Professor McGonagall to take a box of mice and distribute them to students."
    }
  ],
  "relationships": [
    {
      "entity_1": "Harry",
      "entity_2": "Umbridge",
      "relationship_type": "anger",
      "description": "Harry is angry with Umbridge, as described in the text: 'the sight of her drove the memory of breakfast right out of his head'."
    },
    {
      "entity_1": "Ron",
      "entity_2": "Harry",
      "relationship_type": "support",
      "description": "Ron supports Harry's anger towards Umbridge, as described in the text: 'Let’s see Umbridge get what she deserves.'"
    },
    {
      "entity_1": "Professor McGonagall",
      "entity_2": "Umbridge",
      "relationship_type": "disapproval",
      "description": "Professor McGonagall disapproves of Professor Umbridge's presence, as described in the text: 'That will do'."
    },
    {
      "entity_1": "Mr. Finnigan",
      "entity_2": "Professor McGonagall",
      "relationship_type": "obedience",
      "description": "Mr. Finnigan obeys Professor McGonagall's instructions to hand back homework, as described in the text: 'Mr. Finnigan, kindly come here and hand back the homework'."
    },
    {
      "entity_1": "Miss Brown",
      "entity_2": "Professor McGonagall",
      "relationship_type": "obedience",
      "description": "Miss Brown obeys Professor McGonagall's instructions to take a box of mice and distribute them to students, as described in the text: 'Miss Brown, please take this box of mice'."
    }
  ]
}