{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story, mentioned as 'he' and 'Harry'. The text describes Harry's actions and interactions with other characters."
    },
    {
      "name": "filch",
      "entity_type": "person",
      "singular": true,
      "description": "The caretaker of Hogwarts, described as giving a great sniff and a curt nod. He is mentioned as being suspicious of Harry."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "One of Harry's friends, mentioned as asking why Filch was sniffing Harry. The text describes Ron's actions and interactions with other characters."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "One of Harry's friends, mentioned as finding the story about Dungbombs highly interesting. The text describes Hermione's reactions to the story."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "A character mentioned in the story, described as being related to Harry and having a letter sent to him by Harry. The text describes Filch's reaction to this letter."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "A character mentioned in the story, described as potentially tipping off Filch about Harry ordering Dungbombs. The text describes Malfoy's motivations and actions."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "filch",
      "relationship_type": "suspicion",
      "description": "Filch is suspicious of Harry, as described in the text: 'Then he gave a curt nod that set his jowls aquiver again and Harry walked on...'."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "friendship",
      "description": "Harry, Ron, and Hermione are friends, as described in the text: '“Er — why was Filch sniffling you?” asked Ron...'."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry, Ron, and Hermione are friends, as described in the text: '“Er — why was Filch sniffling you?” asked Ron...'."
    },
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "relation",
      "description": "Harry has a relation with Sirius, as described in the text: 'And he recounted the story of sending his letter to Sirius...'."
    },
    {
      "entity_1": "harry",
      "entity_2": "malfoy",
      "relationship_type": "suspicions_of_malfoy",
      "description": "Harry suspects Malfoy of tipping off Filch about Dungbombs, as described in the text: '“I dunno,” said Harry, shrugging. “Maybe Malfoy, he’d think it was a laugh.”'"
    }
  ]
}