{
  "entities": [
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is a character who thinks that Dumbledore is forming his own private army. This is mentioned when Sirius says, \"That's exactly what he thinks you're doing,\" and later when he says, \"Fudge thinks  Dumbledore will stop at nothing to seize power.\""
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is a character who is accused of forming his own private army by Fudge. This is mentioned when Sirius says, \"that's exactly what he's afraid Dumbledore's doing — forming his own private army,\" and later when Hermione asks if they are being prevented from learning Defense Against the Dark Arts because Fudge thinks Dumbledore will use spells against the Ministry."
    },
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is a character who is paranoid about Dumbledore and thinks he will stop at nothing to seize power. This is mentioned when Sirius says, \"Fudge thinks  Dumbledore will stop at nothing to seize power.\""
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a character who calls the idea of Dumbledore forming his own private army 'the stupidest thing I've ever heard.' This is mentioned when Ron says, \"That's the stupidest thing I've ever heard, including all the stuff that Luna Lovegood comes out with.\""
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a character who looks furious at the idea of Fudge preventing them from learning Defense Against the Dark Arts. This is mentioned when Hermione says, \"So we're being prevented from le arning Defense Against the Dark Arts because Fudge is scared we'll use spells against the Ministry?\""
    },
    {
      "name": "luna lovegood",
      "entity_type": "person",
      "singular": true,
      "description": "Luna Lovegood is a character who is mentioned by Ron as someone who comes out with 'stupid' ideas. This is mentioned when Ron says, \"That's the stupidest thing I've ever heard, including all the stuff that Luna Lovegood comes out with.\""
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is an organization that Fudge is scared they will use spells against. This is mentioned when Hermione says, \"So we're being prevented from le arning Defense Against the Dark Arts because Fudge is scared we'll use spells against the Ministry?\""
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is a character who has sent Harry a letter. This is mentioned when Harry says, \"This reminded Harry of Percy's letter.\""
    }
  ],
  "relationships": [
    {
      "entity_1": "fudge",
      "entity_2": "dumbledore",
      "relationship_type": "paranoid_of",
      "description": "Fudge is paranoid about Dumbledore and thinks he will stop at nothing to seize power. This is mentioned when Sirius says, \"Fudge thinks  Dumbledore will stop at nothing to seize power.\""
    },
    {
      "entity_1": "fudge",
      "entity_2": "ministry of magic",
      "relationship_type": "afraid_of",
      "description": "Fudge is scared that they will use spells against the Ministry. This is mentioned when Hermione says, \"So we're being prevented from le arning Defense Against the Dark Arts because Fudge is scared we'll use spells against the Ministry?\""
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "ministry of magic",
      "relationship_type": "target_of",
      "description": "Dumbledore is accused of forming his own private army to take on the Ministry. This is mentioned when Sirius says, \"that's exactly what he's afraid Dumbledore's doing — forming his own private army, with which he will be able to take on the Ministry of Magic.\""
    },
    {
      "entity_1": "sirius",
      "entity_2": "dumbledore",
      "relationship_type": "believes_in",
      "description": "Sirius believes that Dumbledore is forming his own private army. This is mentioned when Sirius says, \"That's exactly what he thinks you're doing,\" and later when he says, \"Fudge thinks  Dumbledore will stop at nothing to seize power.\""
    },
    {
      "entity_1": "ron",
      "entity_2": "luna lovegood",
      "relationship_type": "comparing_to",
      "description": "Ron compares the idea of Dumbledore forming his own private army to 'all the stuff that Luna Lovegood comes out with.' This is mentioned when Ron says, \"That's the stupidest thing I've ever heard, including all the stuff that Luna Lovegood comes out with.\""
    },
    {
      "entity_1": "percy",
      "entity_2": "harry",
      "relationship_type": "sent_letter_to",
      "description": "Percy has sent Harry a letter. This is mentioned when Harry says, \"This reminded Harry of Percy's letter.\""
    }
  ]
}