{
  "entities": [
    {
      "name": "luna lovegood",
      "entity_type": "person",
      "singular": true,
      "description": "Luna Lovegood is mentioned as a student who knows about Padma Patil's experience at the Yule Ball. She is described as gazing un-blinkingly at Ron over The Quibbler."
    },
    {
      "name": "padma patil",
      "entity_type": "person",
      "singular": true,
      "description": "Padma Patil is mentioned as a student who went to the Yule Ball with Ron. She is described as not enjoying it very much and feeling that Ron didn't treat her well."
    },
    {
      "name": "anthony goldstein",
      "entity_type": "person",
      "singular": true,
      "description": "Anthony Goldstein is mentioned as a student who was paired with Padma Patil for the Yule Ball."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is mentioned as someone who went to the Yule Ball with Padma Patil. He is described as looking mildly surprised when reminded of this by Luna Lovegood."
    },
    {
      "name": "ginny weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny Weasley is mentioned as someone who is trying not to giggle at Ron's reaction to being reminded of his experience with Padma Patil."
    },
    {
      "name": "hermione granger",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione Granger is mentioned as the one who said that Anthony Goldstein and Padma Patil were paired for the Yule Ball."
    },
    {
      "name": "the quibbler",
      "entity_type": "magazine",
      "singular": false,
      "description": "The Quibbler is mentioned as a magazine that Luna Lovegood was reading over when she reminded Ron of his experience with Padma Patil."
    },
    {
      "name": "yule ball",
      "entity_type": "event",
      "singular": true,
      "description": "The Yule Ball is mentioned as an event where Ron went with Padma Patil and Anthony Goldstein went with Luna Lovegood."
    }
  ],
  "relationships": [
    {
      "entity_1": "luna lovegood",
      "entity_2": "padma patil",
      "relationship_type": "reminded",
      "description": "Luna reminded Ron of his experience at the Yule Ball with Padma Patil."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "padma patil",
      "relationship_type": "went_to_yule_ball_with",
      "description": "Ron went to the Yule Ball with Padma Patil."
    },
    {
      "entity_1": "anthony goldstein",
      "entity_2": "padma patil",
      "relationship_type": "paired_for_yule_ball",
      "description": "Anthony Goldstein was paired for the Yule Ball with Padma Patil."
    }
  ]
}