{
  "entities": [
    {
      "name": "christmas baubles",
      "entity_type": "christmas_baubles",
      "singular": false,
      "description": "Became gigantic, glowing Christmas baubles; holly hung around every doorway, and shining white Christma s trees covered in magical snow. This indicates that the Christmas baubles are described as gigantic and glowing."
    },
    {
      "name": "holly",
      "entity_type": "holly",
      "singular": false,
      "description": "Became gigantic, glowing Christmas baubles; holly hung around every doorway, and shining white Christma s trees covered in magical snow. This indicates that the holly is described as hanging around doorways."
    },
    {
      "name": "christmas trees",
      "entity_type": "christmas_trees",
      "singular": false,
      "description": "Became gigantic, glowing Christmas baubles; holly hung around every doorway, and shining white Christma s trees covered in magical snow. This indicates that the Christmas trees are described as shining white and covered in magical snow."
    },
    {
      "name": "snow",
      "entity_type": "snow",
      "singular": true,
      "description": "Became gigantic, glowing Christmas baubles; holly hung around every doorway, and shining white Christma s trees covered in magical snow. This indicates that the snow is described as magical."
    }
  ],
  "relationships": [
    {
      "entity_1": "christmas baubles",
      "entity_2": "holly",
      "relationship_type": "adjacent_to",
      "description": "Became gigantic, glowing Christmas baubles; holly hung around every doorway, and shining white Christma s trees covered in magical snow. This indicates that the Christmas baubles are adjacent to the holly."
    },
    {
      "entity_1": "holly",
      "entity_2": "christmas trees",
      "relationship_type": "adjacent_to",
      "description": "Became gigantic, glowing Christmas baubles; holly hung around every doorway, and shining white Christma s trees covered in magical snow. This indicates that the holly is adjacent to the Christmas trees."
    },
    {
      "entity_1": "christmas trees",
      "entity_2": "snow",
      "relationship_type": "covered_in",
      "description": "Became gigantic, glowing Christmas baubles; holly hung around every doorway, and shining white Christma s trees covered in magical snow. This indicates that the Christmas trees are covered in magical snow."
    }
  ]
}