{
  "entities": [
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is mentioned as a person who is present in the kitchen and is yawning widely. She is also referred to as 'Arthur's wife' (not explicitly stated but implied) and is concerned about Harry staying up late."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is mentioned as a person who is talking to Tonks in the kitchen. He is discussing the handle of an object with anti-jinx varnish and in-built vibration control."
    },
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is mentioned as a person who is present in the kitchen and is talking to Ron Weasley. She is not explicitly described but is referred to by name."
    },
    {
      "name": "arthur weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur Weasley is mentioned as Mrs. Weasley's husband (implied) and is told by his wife to keep the group from staying up too late."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as a person who is present in the kitchen and is talking to Moody. He is also referred to as 'dear' by Mrs. Weasley."
    },
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "Moody is mentioned as a person who is present in the kitchen and is talking to Harry Potter. He is described as having an electric blue eye and is referred to as 'gruff'."
    },
    {
      "name": "podmore",
      "entity_type": "person",
      "singular": true,
      "description": "Podmore is mentioned as a person who has not returned Moody's Invisibility Cloak."
    },
    {
      "name": "spanish oak",
      "entity_type": "material",
      "singular": false,
      "description": "Spanish oak is mentioned as the material used to make an object's handle."
    }
  ],
  "relationships": [
    {
      "entity_1": "mrs weasley",
      "entity_2": "harry potter",
      "relationship_type": "left",
      "description": "Mrs. Weasley leaves the kitchen after saying goodnight to Harry Potter."
    },
    {
      "entity_1": "moody",
      "entity_2": "podmore",
      "relationship_type": "owed item",
      "description": "Moody mentions that Podmore owes him an Invisibility Cloak, which has not been returned."
    },
    {
      "entity_1": "moody",
      "entity_2": "harry potter",
      "relationship_type": "showed something to",
      "description": "Moody shows Harry Potter a Wizarding photograph."
    }
  ]
}