{
  "entities": [
    {
      "name": "gornuk",
      "entity_type": "person",
      "singular": true,
      "description": "Gornuk laughed and was mentioned as one of the goblins. He is described as laughing again later in the text."
    },
    {
      "name": "dean",
      "entity_type": "person",
      "singular": true,
      "description": "Dean asked what the joke was and didn't get it. He is also referred to by Ted as a good man."
    },
    {
      "name": "dirk",
      "entity_type": "person",
      "singular": true,
      "description": "Dirk replied to Dean's question about the joke and mentioned that Griphook had his small revenge before he left."
    },
    {
      "name": "griphook",
      "entity_type": "goblin",
      "singular": true,
      "description": "Griphook spoke in English and explained that if he had locked a Death Eater up, the sword would not have helped him break out. He is also referred to as a good man by Ted."
    },
    {
      "name": "ted",
      "entity_type": "person",
      "singular": true,
      "description": "Ted amended his statement about Griphook being a goblin and asked if Griphook managed to lock a Death Eater up in one of the old high-security vaults."
    },
    {
      "name": "severus snape",
      "entity_type": "person",
      "singular": true,
      "description": "Severus Snape was mentioned as not knowing something that Griphook knew. He is also referred to as having an office at Hogwarts where Gryﬃndor's sword was kept."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's breathing was shallow with excitement and he stared at Hermione listening hard."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione stared at Harry listening hard along with him."
    }
  ],
  "relationships": [
    {
      "entity_1": "griphook",
      "entity_2": "severus snape",
      "relationship_type": "knows",
      "description": "Griphook knew something that Severus Snape did not know. This is mentioned in the text as 'So is Severus Snape, though he does not know it'."
    }
  ]
}