{
  "entities": [
    {
      "name": "grawp",
      "entity_type": "person",
      "singular": true,
      "description": "Grawp is described as an undersized giant and a gargantuan monster trying to crush people on the upper floors. He has yellow, half brick-sized teeth and launches himself at his smaller kin with savagery."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as realizing that Grawp was an undersized giant and he roars to tell others to run. He runs so fast that they are halfway toward the forest before being brought up short again."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as having her hand seized by Harry and they both tear down the steps into the grounds."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as bringing up the rear of the group as they run down the steps into the grounds."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as someone Harry hopes to find and save."
    },
    {
      "name": "gargantuan monster",
      "entity_type": "monster",
      "singular": true,
      "description": "The gargantuan monster is described as trying to crush people on the upper floors."
    },
    {
      "name": "giants",
      "entity_type": "group",
      "singular": false,
      "description": "The giants are described as wrestling each other with savagery."
    },
    {
      "name": "forest",
      "entity_type": "location",
      "singular": true,
      "description": "The forest is mentioned as a location that Harry and his friends are heading towards."
    },
    {
      "name": "castle",
      "entity_type": "location",
      "singular": true,
      "description": "The castle is described as being surrounded by the giants and having stone steps that tremble when Grawp stomps towards it."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "grawp",
      "relationship_type": "knows",
      "description": "Harry realizes that Grawp is an undersized giant."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "accompanies",
      "description": "Harry seizes Hermione's hand and they both tear down the steps into the grounds."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "follows",
      "description": "Ron brings up the rear of the group as they run down the steps into the grounds."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "harry",
      "relationship_type": "is_helped_by",
      "description": "Harry hopes to find and save Hagrid."
    }
  ]
}