{
  "entities": [
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is described as trying to find Malfoy, Crabbe, and Goyle in the midst of the chaos. He is also mentioned as being unable to see them anywhere."
    },
    {
      "name": "malfoy",
      "entity_type": "character",
      "singular": true,
      "description": "Malfoy is described as one of the students who were involved in banned experiments and whose secrets are being consumed by the fire. Harry is also trying to find him."
    },
    {
      "name": "crabbe",
      "entity_type": "character",
      "singular": true,
      "description": "Crabbe is described as one of the students who were involved in banned experiments and whose secrets are being consumed by the fire. Harry is also trying to find him."
    },
    {
      "name": "goyle",
      "entity_type": "character",
      "singular": true,
      "description": "Goyle is described as one of the students who were involved in banned experiments and whose secrets are being consumed by the fire. Harry is also trying to find him."
    },
    {
      "name": "ron",
      "entity_type": "character",
      "singular": true,
      "description": "Ron is described as shouting at Harry to get out of the room through the black smoke."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "malfoy",
      "relationship_type": "searching_for",
      "description": "Harry is trying to find Malfoy in the midst of the chaos. This is described as Harry swooping low over the marauding monsters of flame."
    },
    {
      "entity_1": "harry",
      "entity_2": "crabbe",
      "relationship_type": "searching_for",
      "description": "Harry is trying to find Crabbe in the midst of the chaos. This is described as Harry swooping low over the marauding monsters of flame."
    },
    {
      "entity_1": "harry",
      "entity_2": "goyle",
      "relationship_type": "searching_for",
      "description": "Harry is trying to find Goyle in the midst of the chaos. This is described as Harry swooping low over the marauding monsters of flame."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "shouting_at",
      "description": "Ron is shouting at Harry to get out of the room through the black smoke. This is described as Ron bellowing 'Harry, let's get out, let's get out!'"
    }
  ]
}