{
  "entities": [
    {
      "name": "shell cottage",
      "entity_type": "location",
      "singular": true,
      "description": "The location where the scene is taking place. The text states \"Shell Cottage\" as the name of the location."
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "A person who is present at Shell Cottage. Bill is described as filling goblets with wine and making toast."
    },
    {
      "name": "teddy remus lupin",
      "entity_type": "person",
      "singular": true,
      "description": "A person who is the subject of a toast. Lupin is described as a \"great wizard in the making\"."
    },
    {
      "name": "dora",
      "entity_type": "person",
      "singular": true,
      "description": "A person whose resemblance to Teddy Remus Lupin is mentioned. Dora's name is mentioned as being compared to Lupin's appearance."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "A person who inquires about the resemblance between Teddy Remus Lupin and Dora. Fleur's name is mentioned as asking a question."
    },
    {
      "name": "andromeda",
      "entity_type": "person",
      "singular": true,
      "description": "A person whose opinion on Tonks's hair color change is mentioned. Andromeda's name is mentioned in the context of discussing hair color changes."
    },
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "A person whose hair color change is mentioned by Andromeda. Tonks's name is mentioned as having a notable hair color change at birth."
    }
  ],
  "relationships": [
    {
      "entity_1": "bill",
      "entity_2": "shell cottage",
      "relationship_type": "located_at",
      "description": "Bill is located at Shell Cottage, where the scene is taking place. The text states \"The wind buﬀeted the little cottage and the ﬁre leapt and crackled\"."
    },
    {
      "entity_1": "bill",
      "entity_2": "teddy remus lupin",
      "relationship_type": "toast_to",
      "description": "Bill makes a toast to Teddy Remus Lupin. The text states \"To Teddy Remus Lupin,\" said Lupin, \"a great wizard in the making!\""
    },
    {
      "entity_1": "fleur",
      "entity_2": "dora",
      "relationship_type": "resemblance_to",
      "description": "Fleur compares Dora's resemblance to Teddy Remus Lupin. The text states \"’Oo does ’e look like?\" Fleur inquired.\""
    },
    {
      "entity_1": "andromeda",
      "entity_2": "tonks",
      "relationship_type": "similar_hair_color_change",
      "description": "Andromeda mentions that Tonks's hair color change is similar to Teddy Remus Lupin's. The text states \"Andromeda says Tonks’s hair started changing color the day that she was born.\""
    }
  ]
}