{
  "entities": [
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is the main character, described as someone who hopes for a red-haired figure to appear between the trees. He is also shown to be frustrated and anxious about their delay in leaving the campsite."
    },
    {
      "name": "hermione",
      "entity_type": "character",
      "singular": true,
      "description": "Hermione is another main character, described as someone who wants to spin out their time on the riverbank and hopes to hear footsteps through the heavy rain. She is also shown to be indecisive and unable to find reasons to delay."
    },
    {
      "name": "ron",
      "entity_type": "character",
      "singular": true,
      "description": "Ron is a main character, mentioned as someone who would say 'We thought you knew what you were doing!' to Harry. He is not physically present in the scene but his voice is heard."
    },
    {
      "name": "the riverbank",
      "entity_type": "location",
      "singular": true,
      "description": "The riverbank is a location where Harry and Hermione are situated, described as being muddy and rising rapidly. It is also mentioned that they have lingered there for an hour longer than usual."
    },
    {
      "name": "the campsite",
      "entity_type": "location",
      "singular": true,
      "description": "The campsite is a location where Harry, Hermione, and Ron would usually depart from. It is mentioned that they have lingered there for an hour longer than usual."
    },
    {
      "name": "the beaded bag",
      "entity_type": "object",
      "singular": true,
      "description": "The beaded bag is an object that Harry and Hermione are packing, described as being repacked three times. It is mentioned that Hermione seems unable to find any more reasons to delay."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry and Hermione are friends, described as grasping hands at the end of the scene. They also seem to be in a state of mutual frustration and anxiety about their delay."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "friendship",
      "description": "Harry and Ron are friends, described as having a conversation where Ron says 'We thought you knew what you were doing!' to Harry. Although Ron is not physically present in the scene, his voice is heard."
    },
    {
      "entity_1": "harry",
      "entity_2": "the riverbank",
      "relationship_type": "location",
      "description": "Harry is situated at the riverbank, described as being muddy and rising rapidly. He also seems to be frustrated about their delay in leaving the campsite."
    },
    {
      "entity_1": "hermione",
      "entity_2": "the riverbank",
      "relationship_type": "location",
      "description": "Hermione is also situated at the riverbank, described as wanting to spin out their time there and hoping to hear footsteps through the heavy rain."
    },
    {
      "entity_1": "harry",
      "entity_2": "the beaded bag",
      "relationship_type": "possession",
      "description": "Harry is packing the beaded bag, described as repacking it three times. He also seems to be frustrated about their delay in leaving the campsite."
    },
    {
      "entity_1": "hermione",
      "entity_2": "the beaded bag",
      "relationship_type": "possession",
      "description": "Hermione is also packing the beaded bag, described as repacking it three times. She seems to be indecisive and unable to find reasons to delay."
    }
  ]
}