{
  "entities": [
    {
      "name": "aunt petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Aunt Petunia is described as bursting into tears and embracing Dudley rather than Harry. She is also mentioned to be sobbing into his chest, indicating her affection for him."
    },
    {
      "name": "hestia jones",
      "entity_type": "person",
      "singular": true,
      "description": "Hestia Jones is described as giving Aunt Petunia an ap-40 and later expressing indignation at Dudley's statement about Harry. She seems to be a disapproving character."
    },
    {
      "name": "dudley",
      "entity_type": "person",
      "singular": true,
      "description": "Dudley is described as receiving affection from Aunt Petunia and making a statement about Harry that Hestia Jones finds objectionable. He seems to be the favored child."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as being the subject of Dudley's statement and Aunt Petunia's affection. He also expresses annoyance at his aunt's behavior."
    },
    {
      "name": "uncle vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Uncle Vernon is described as reappearing and expressing frustration with the family's delay in leaving. He seems to be a strict character."
    },
    {
      "name": "dedalus diggle",
      "entity_type": "person",
      "singular": true,
      "description": "Dedalus Diggle is described as watching the exchanges between Aunt Petunia and Harry with an air of bemusement. He seems to be a somewhat detached character."
    }
  ],
  "relationships": [
    {
      "entity_1": "aunt petunia",
      "entity_2": "dudley",
      "relationship_type": "affection",
      "description": "Aunt Petunia shows affection towards Dudley, embracing him and sobbing into his chest."
    },
    {
      "entity_1": "hestia jones",
      "entity_2": "aunt petunia",
      "relationship_type": "disapproval",
      "description": "Hestia Jones expresses disapproval of Aunt Petunia's behavior, specifically her favoritism towards Dudley."
    },
    {
      "entity_1": "harry",
      "entity_2": "dudley",
      "relationship_type": "comparison",
      "description": "Harry compares himself to Dudley, stating that coming from Dudley is like saying 'I love you'."
    }
  ]
}