{
  "entities": [
    {
      "name": "delacours",
      "entity_type": "family",
      "singular": false,
      "description": "The Delacours are mentioned as giving chocolates to Harry. The text states \"chocolates from the Delacours\"."
    },
    {
      "name": "weasleys",
      "entity_type": "family",
      "singular": false,
      "description": "Weasleys' Wizard Wheezes merchandise is given by Fred and George to Harry. The text mentions \"the latest Weasleys’ Wizard Wheezes merchandise from Fred and George\"."
    },
    {
      "name": "madame delacour",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Delacour arrives at the kitchen with Fleur and Gabrielle. The text states \"the arrival of Madame Delacour, Fleur, and Gabrielle made the kitchen uncomfortably crowded\"."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is mentioned as arriving at the kitchen with Madame Delacour and Gabrielle. The text states \"the arrival of Madame Delacour, Fleur, and Gabrielle made the kitchen uncomfortably crowded\"."
    },
    {
      "name": "gabrielle",
      "entity_type": "person",
      "singular": true,
      "description": "Gabrielle is mentioned as arriving at the kitchen with Madame Delacour and Fleur. The text states \"the arrival of Madame Delacour, Fleur, and Gabrielle made the kitchen uncomfortably crowded\"."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as receiving presents from Hermione. The text states \"I’ll pack these for you,\" Hermione said brightly, taking Harry’s presents out of his arms\"."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as having underpants in the wash and being taken upstairs by Hermione. The text states \"I’m nearly done, I’m just waiting for the rest of your underpants to come out of the wash, Ron\"."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as packing presents for Harry and taking him upstairs. The text states \"I’ll pack these for you,\" Hermione said brightly, taking Harry’s presents out of his arms\"."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny calls Harry into her room. The text states \"‘Harry, will you come in here a moment?’ It was Ginny\"."
    },
    {
      "name": "weird sisters",
      "entity_type": "band",
      "singular": false,
      "description": "The Weird Sisters are mentioned as being on a poster in Ginny’s room. The text states \"There was a large poster of the Wizarding band the Weird Sisters on one wall\"."
    },
    {
      "name": "gwenog jones",
      "entity_type": "person",
      "singular": true,
      "description": "Gwenog Jones is mentioned as being on a picture in Ginny’s room. The text states \"There was a picture of Gwenog Jones, Captain of the all-witch Quidditch team\"."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "gave_presents_to",
      "description": "Hermione packs presents for Harry. The text states \"I’ll pack these for you,\" Hermione said brightly, taking Harry’s presents out of his arms\"."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "was_taken_by",
      "description": "Hermione takes Ron upstairs. The text states \"Hermione took him by the elbow rugged him on up the stairs\"."
    },
    {
      "entity_1": "harry",
      "entity_2": "ginny",
      "relationship_type": "visited",
      "description": "Harry visits Ginny in her room. The text states \"He had never been inside it before. It was small, but bright.\""
    },
    {
      "entity_1": "ginny",
      "entity_2": "harry",
      "relationship_type": "called_into_room",
      "description": "Ginny calls Harry into her room. The text states \"‘Harry, will you come in here a moment?’ It was Ginny\"."
    }
  ]
}