{
  "entities": [
    {
      "name": "lupin",
      "entity_type": "character",
      "singular": true,
      "description": "Lupin is a character in the story who is present at the Burrow. He is described as having a muscle jumping in his jaw and nodding to Kingsley."
    },
    {
      "name": "tonks",
      "entity_type": "character",
      "singular": true,
      "description": "Tonks is a character in the story who asks Harry, Hermione, and Kingsley about their journeys."
    },
    {
      "name": "kingsley",
      "entity_type": "character",
      "singular": true,
      "description": "Kingsley is a character in the story who has to get back to Downing Street. He says goodbye to the others before Disapparating."
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is a character in the story who is present at the Burrow and recounts his journey with Hermione."
    },
    {
      "name": "hermione",
      "entity_type": "character",
      "singular": true,
      "description": "Hermione is a character in the story who is present at the Burrow and recounts her journey with Harry."
    },
    {
      "name": "bill",
      "entity_type": "character",
      "singular": true,
      "description": "Bill is a character mentioned in the story as being absent. His absence seems to be affecting the others."
    },
    {
      "name": "fleur",
      "entity_type": "character",
      "singular": true,
      "description": "Fleur is a character mentioned in the story as being absent. Her absence seems to be affecting the others."
    },
    {
      "name": "mad-eye",
      "entity_type": "character",
      "singular": true,
      "description": "Mad-eye is a character mentioned in the story as being absent. His absence seems to be affecting the others."
    },
    {
      "name": "mundungus",
      "entity_type": "character",
      "singular": true,
      "description": "Mundungus is a character mentioned in the story as being absent. His absence seems to be affecting the others."
    },
    {
      "name": "ron",
      "entity_type": "character",
      "singular": true,
      "description": "Ron is a character in the story who is hugged by his parents before Lupin and Tonks arrive."
    },
    {
      "name": "ginny",
      "entity_type": "character",
      "singular": true,
      "description": "Ginny is a character in the story who comes down the back steps with her parents."
    },
    {
      "name": "downing street",
      "entity_type": "location",
      "singular": false,
      "description": "Downing Street is a location mentioned in the story as where Kingsley has to get back to. It seems to be some kind of important place for him."
    }
  ],
  "relationships": [
    {
      "entity_1": "kingsley",
      "entity_2": "downing street",
      "relationship_type": "location_of_work",
      "description": "Kingsley has to get back to Downing Street, indicating that it is his workplace or a place he needs to be for work."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "travel_companion",
      "description": "Harry and Hermione recounted their journeys together, indicating that they traveled with each other."
    }
  ]
}