{
  "entities": [
    {
      "name": "he-who-must-not-be-named",
      "entity_type": "character",
      "singular": true,
      "description": "The main antagonist, mentioned by Professor McGonagall and Professor Sprout. (\"He-Who-Must-Not-Be-Named is coming\")"
    },
    {
      "name": "potter",
      "entity_type": "character",
      "singular": true,
      "description": "Harry Potter, a student who has work to do in the castle on Dumbledore's orders. (\"Potter has work to do in the castle on Dumbledore's orders\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "character",
      "singular": true,
      "description": "Albus Dumbledore, mentioned as giving Potter orders. (\"Potter has work to do in the castle on Dumbledore's orders\")"
    },
    {
      "name": "sprout",
      "entity_type": "character",
      "singular": true,
      "description": "Professor Sprout, a teacher who is concerned about the protection of the school. (\"You realize, of course, that nothing we do will be able to keep out You-Know-Who indeﬁnitely?\" said Professor Sprout.)"
    },
    {
      "name": "mcgonagall",
      "entity_type": "character",
      "singular": true,
      "description": "Professor McGonagall, a teacher who is in charge of the protection of the school. (\"Thank you, Pomona,\" said Professor McGonagall, and between the two witches there passed a look of grim understanding.)"
    },
    {
      "name": "flitwick",
      "entity_type": "character",
      "singular": true,
      "description": "Professor Flitwick, a teacher who gasped at the news. (\"Sprout and Flitwick gasped; Slughorn let out a low groan.\")"
    },
    {
      "name": "slughorn",
      "entity_type": "character",
      "singular": true,
      "description": "Professor Slughorn, a teacher who let out a low groan at the news. (\"Sprout and Flitwick gasped; Slughorn let out a low groan.\")"
    },
    {
      "name": "pomona",
      "entity_type": "character",
      "singular": true,
      "description": "Professor Sprout's first name, mentioned by Professor McGonagall. (\"Thank you, Pomona,\" said Professor McGonagall.)"
    }
  ],
  "relationships": [
    {
      "entity_1": "mcgonagall",
      "entity_2": "sprout",
      "relationship_type": "grim_understanding",
      "description": "There was a look of grim understanding between Professor McGonagall and Professor Sprout. (\"between the two witches there passed a look of grim understanding.\")"
    },
    {
      "entity_1": "mcgonagall",
      "entity_2": "he-who-must-not-be-named",
      "relationship_type": "concerned_about",
      "description": "Professor McGonagall is concerned about the protection of the school from He-Who-Must-Not-Be-Named. (\"He-Who-Must-Not-Be-Named is coming\")"
    },
    {
      "entity_1": "sprout",
      "entity_2": "he-who-must-not-be-named",
      "relationship_type": "concerned_about",
      "description": "Professor Sprout is concerned about the protection of the school from He-Who-Must-Not-Be-Named. (\"You realize, of course, that nothing we do will be able to keep out You-Know-Who indeﬁnitely?\" said Professor Sprout.)"
    },
    {
      "entity_1": "potter",
      "entity_2": "dumbledore",
      "relationship_type": "working_for",
      "description": "Harry Potter is working for Dumbledore. (\"Potter has work to do in the castle on Dumbledore's orders\")"
    }
  ]
}