{
  "entities": [
    {
      "name": "mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is described as crying and speaking to Harry and Luna in the corridor."
    },
    {
      "name": "luna",
      "entity_type": "person",
      "singular": true,
      "description": "Luna is asked by Harry what has happened, indicating she is present at the scene."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as dragging Luna to her feet and racing along the corridor with her."
    },
    {
      "name": "flitwick",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Flitwick is standing at a smashed window in the classroom, yelling in shock at Harry's sudden appearance."
    },
    {
      "name": "sprout",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Sprout is standing at a smashed window in the classroom, yelling in shock at Harry's sudden appearance."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as being dead and having taught his master tricks with a wand."
    },
    {
      "name": "slughorn",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Slughorn catches up to Harry, panting and massaging his chest in emerald-green silk pajamas."
    }
  ],
  "relationships": [
    {
      "entity_1": "mcgonagall",
      "entity_2": "harry",
      "relationship_type": "speaks_to",
      "description": "Professor McGonagall speaks to Harry about what has happened, indicating a relationship between them."
    },
    {
      "entity_1": "luna",
      "entity_2": "mcgonagall",
      "relationship_type": "listens_to",
      "description": "Luna listens to Professor McGonagall's explanation of what has happened, showing a relationship between them."
    },
    {
      "entity_1": "harry",
      "entity_2": "flitwick",
      "relationship_type": "startles",
      "description": "Harry's sudden appearance startles Professor Flitwick, indicating a relationship between them."
    },
    {
      "entity_1": "harry",
      "entity_2": "sprout",
      "relationship_type": "startles",
      "description": "Harry's sudden appearance also startles Professor Sprout, showing a relationship between them."
    }
  ]
}