{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "The main character's mentor and a powerful wizard who fought against the Dark Arts. He is described as someone who stopped Grindelwald, voted for Muggle protection and rights, and fought You-Know-Who from the start."
    },
    {
      "name": "grindelwald",
      "entity_type": "person",
      "singular": true,
      "description": "A dark wizard that Dumbledore stopped. He is mentioned as someone who was defeated by Dumbledore."
    },
    {
      "name": "you-know-who",
      "entity_type": "person",
      "singular": true,
      "description": "The main antagonist, also known as Voldemort. Dumbledore fought against him from the start and died trying to bring him down."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character who is angry because Dumbledore never told him about his past actions."
    },
    {
      "name": "rita",
      "entity_type": "person",
      "singular": true,
      "description": "Someone who wrote a book about Dumbledore's life. The book lies on the ground between Harry and another person."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "grindelwald",
      "relationship_type": "defeated",
      "description": "Dumbledore stopped Grindelwald, as mentioned in the text: 'The one who stopped Grindelwald...'"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "you-know-who",
      "relationship_type": "fought_against",
      "description": "Dumbledore fought against You-Know-Who from the start, as mentioned in the text: 'The one who always voted for Muggle protection and Muggle born rights, who fought You-Know-Who from the start...'"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "you-know-who",
      "relationship_type": "died_trying_to_defeat",
      "description": "Dumbledore died trying to bring down You-Know-Who, as mentioned in the text: '...and who died trying to bring him down!'"
    },
    {
      "entity_1": "harry",
      "entity_2": "dumbledore",
      "relationship_type": "angry_with",
      "description": "Harry is angry with Dumbledore because he never told him about his past actions, as mentioned in the text: 'I think the real reason you're so angry is that Dumbledore never told you any of this himself.'"
    }
  ]
}