{
  "entities": [
    {
      "name": "wormtail",
      "entity_type": "person",
      "singular": true,
      "description": "Wormtail is a person who is being attacked by Harry and Ron. He is described as having a wand arm and a silver hand."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who is attacking Wormtail along with Ron. He is described as slapping his hand to Wormtail's mouth to muffle his voice."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person who is attacking Wormtail along with Harry. He is described as seizing Wormtail's wand arm and forcing it upwards."
    },
    {
      "name": "lucius malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Lucius Malfoy is a person who is calling out to Wormtail from above. He is described as asking what is wrong with Wormtail."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "wormtail",
      "relationship_type": "attacking",
      "description": "Harry and Ron are attacking Wormtail. This is described in the text as 'Silently they struggled: Wormtail’s wand emitted sparks; his silver hand closed around Harry’s throat.'"
    },
    {
      "entity_1": "ron",
      "entity_2": "wormtail",
      "relationship_type": "attacking",
      "description": "Ron is attacking Wormtail along with Harry. This is described in the text as 'Silently they struggled: Wormtail’s wand emitted sparks; his silver hand closed around Harry’s throat.'"
    },
    {
      "entity_1": "lucius malfoy",
      "entity_2": "wormtail",
      "relationship_type": "questioning",
      "description": "Lucius Malfoy is questioning Wormtail from above. This is described in the text as '“What is it, Wormtail?” called Lucius Malfoy from above.'"
    },
    {
      "entity_1": "ron",
      "entity_2": "wormtail",
      "relationship_type": "deceiving",
      "description": "Ron is deceiving Wormtail by calling back in a passable imitation of Wormtail's wheezy voice. This is described in the text as '“Nothing!” Ron called back, in a passable imitation of Wormtail’s wheezy voice.'"
    }
  ]
}