{
  "entities": [
    {
      "name": "auntie muriel",
      "entity_type": "person",
      "singular": true,
      "description": "Auntie Muriel is mentioned as commenting on the dress of Ginevra. She says that her tiara sets off the whole thing nicely, but also criticizes Ginevra's dress as being too low-cut."
    },
    {
      "name": "ginevra",
      "entity_type": "person",
      "singular": true,
      "description": "Ginevra is mentioned as wearing a dress that auntie Muriel finds to be too low-cut. Ginny glances around and winks at Harry, suggesting that she may have been the one who wore the dress."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as glancing around and winking at Harry. She seems to be enjoying herself, but also appears to be hiding something (perhaps the fact that she wore Ginevra's dress)."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being present at the wedding and interacting with Ginny. He seems to be lost in thought, remembering afternoons spent alone with Ginny."
    },
    {
      "name": "william arthur",
      "entity_type": "person",
      "singular": true,
      "description": "William Arthur is mentioned as being married to Fleur Isabelle. The ceremony is described in detail, including the declaration of their bond for life."
    },
    {
      "name": "fleur isabelle",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur Isabelle is mentioned as being married to William Arthur. She is described as being beautiful and elegant."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as making a loud noise with his handkerchief, causing everyone to turn around."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as beaming at Harry and having tears in her eyes. She seems to be happy for the couple getting married."
    },
    {
      "name": "madame delacour",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Delacour is mentioned as sobbing quietly into a piece of lace, along with Mrs. Weasley."
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is mentioned as sobbing quietly into a piece of lace, along with Madame Delacour."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ginny",
      "relationship_type": "romantic_connection",
      "description": "Harry and Ginny seem to have had a romantic connection in the past, as evidenced by Harry's memories of spending afternoons alone with her."
    },
    {
      "entity_1": "william arthur",
      "entity_2": "fleur isabelle",
      "relationship_type": "marriage",
      "description": "William Arthur and Fleur Isabelle are getting married, as described in the ceremony. They are declared to be bonded for life."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "handkerchief",
      "relationship_type": "possession",
      "description": "Hagrid is mentioned as taking out a large handkerchief, which he uses to make a loud noise."
    }
  ]
}