{
  "entities": [
    {
      "name": "greyback",
      "entity_type": "person",
      "singular": true,
      "description": "Greyback is a person mentioned in the text as one of the people who borrowed something to cut firewood. He is also referred to by name when Scabior says 'Greyback! Look at this, in the Prophet!'"
    },
    {
      "name": "scabior",
      "entity_type": "person",
      "singular": true,
      "description": "Scabior is a person mentioned in the text as one of the people who borrowed something to cut firewood. He is also referred to by name when he says 'Ang on a minute, Greyback! Look at this, in the Prophet!'"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person mentioned in the text as someone who has a scar that burns savagely. He is also referred to by name when Scabior says 'Hermione Granger'"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person mentioned in the text as someone who is tied with Harry and others. She is also referred to by name when Scabior says 'Hermione Granger'"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person mentioned in the text as someone who is tied with Harry and others"
    },
    {
      "name": "dean",
      "entity_type": "person",
      "singular": true,
      "description": "Dean is a person mentioned in the text as someone who is tied with Harry and others"
    },
    {
      "name": "griphook",
      "entity_type": "person",
      "singular": true,
      "description": "Griphook is a person mentioned in the text as someone who is tied with Harry and others"
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is a person mentioned in the text as someone whose thoughts are being experienced by Harry. He is also referred to as 'the Prophet'"
    },
    {
      "name": "prophet",
      "entity_type": "thing",
      "singular": true,
      "description": "The Prophet is an entity mentioned in the text as something that Scabior says 'Look at this, in the Prophet!'"
    }
  ],
  "relationships": [
    {
      "entity_1": "greyback",
      "entity_2": "scabior",
      "relationship_type": "associated_with",
      "description": "Greyback and Scabior are associated with each other as they are both mentioned together in the text"
    },
    {
      "entity_1": "harry",
      "entity_2": "voldemort",
      "relationship_type": "experiencing_thoughts_of",
      "description": "Harry is experiencing the thoughts of Voldemort, which is described in the text as 'Voldemort's thoughts had suddenly become Razor-Sharp again'"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "tied_with",
      "description": "Harry and Hermione are tied together with others, which is mentioned in the text as 'listening to Greyback and Scabior. “‘’ermione Granger,’” Scabior was saying'"
    },
    {
      "entity_1": "voldemort",
      "entity_2": "building",
      "relationship_type": "gliding_toward",
      "description": "Voldemort is gliding toward a building, which is described in the text as 'a towering building, a grim fortress, jet-black and forbidding'"
    }
  ]
}