{
  "entities": [
    {
      "name": "monsieur delacour",
      "entity_type": "person",
      "singular": true,
      "description": "Monsieur Delacour is described as walking up the aisle with Fleur, bouncing and beaming. He is a person who is part of the wedding ceremony."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is described as gliding up the aisle, wearing a simple white dress and emitting a strong silvery glow. She is a person who is part of the wedding ceremony."
    },
    {
      "name": "ginnys",
      "entity_type": "person",
      "singular": false,
      "description": "Ginny and Gabrielle are described as wearing golden dresses, looking prettier than usual when Fleur's radiance falls upon them. They are people who are part of the wedding ceremony."
    },
    {
      "name": "gabrielle",
      "entity_type": "person",
      "singular": false,
      "description": "Ginny and Gabrielle are described as wearing golden dresses, looking prettier than usual when Fleur's radiance falls upon them. They are people who are part of the wedding ceremony."
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is described as not looking like he had ever met Fenrir Greyback when Fleur reaches him. He is a person who is part of the wedding ceremony."
    },
    {
      "name": "fenrir greyback",
      "entity_type": "person",
      "singular": true,
      "description": "Fenrir Greyback is mentioned as someone Bill has never met, implying he is an important or notable figure. He is a person who is not part of the wedding ceremony."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as seeing the small, tufty-haired wizard standing in front of Bill and Fleur. He is a person who is part of the wedding ceremony."
    }
  ],
  "relationships": [
    {
      "entity_1": "monsieur delacour",
      "entity_2": "fleur",
      "relationship_type": "together",
      "description": "Monsieur Delacour and Fleur are walking up the aisle together, indicating a close relationship between them."
    },
    {
      "entity_1": "bill",
      "entity_2": "fenrir greyback",
      "relationship_type": "no_relationship",
      "description": "Bill does not look like he has ever met Fenrir Greyback, implying they do not have a relationship."
    },
    {
      "entity_1": "fleur",
      "entity_2": "ginnys",
      "relationship_type": "affects",
      "description": "Fleur's radiance beautifies Ginny and Gabrielle when it falls upon them, indicating Fleur has an effect on them."
    },
    {
      "entity_1": "fleur",
      "entity_2": "bill",
      "relationship_type": "together",
      "description": "Fleur reaches Bill at the end of the aisle, indicating they are together in this moment."
    }
  ]
}