{
  "entities": [
    {
      "name": "albania",
      "entity_type": "location",
      "singular": true,
      "description": "A country in Eastern Europe where Helena Ravenclaw hid the diadem inside a hollow tree. (\"A forest in Albania. A lonely place I thought was far beyond my mother’s reach.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character who is trying to understand Helena Ravenclaw's story. (\"Sense was emerging miraculously from confusion, and now he understood why she was telling him what she had denied Dumbledore and Flitwick.\")"
    },
    {
      "name": "helena ravenclaw",
      "entity_type": "person",
      "singular": true,
      "description": "A student who hid the diadem inside a hollow tree in Albania. (\"She closed her eyes and nodded.\" \"I had . . . no idea. . . . He was . . . ﬂattering.\")"
    },
    {
      "name": "tom riddle",
      "entity_type": "person",
      "singular": true,
      "description": "A person who understood Helena Ravenclaw's desire to possess fabulous objects and wormed things out of her. (\"Yes, Harry thought, Tom Riddle would certainly have understood Helena Ravenclaw’s desire to possess fabulous objects to which she had little right.\")"
    },
    {
      "name": "baron",
      "entity_type": "person",
      "singular": true,
      "description": "A person who was blundering through the forest toward Helena Ravenclaw. (\"It remained where I had hidden it when I heard the Baron blundering through the forest toward me.\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "A person who was denied information by Helena Ravenclaw. (\"Sense was emerging miraculously from confusion, and now he understood why she was telling him what she had denied Dumbledore and Flitwick.\")"
    },
    {
      "name": "flitwick",
      "entity_type": "person",
      "singular": true,
      "description": "A person who was denied information by Helena Ravenclaw. (\"Sense was emerging miraculously from confusion, and now he understood why she was telling him what she had denied Dumbledore and Flitwick.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "helena ravenclaw",
      "relationship_type": "understands",
      "description": "Harry understands Helena Ravenclaw's story. (\"Sense was emerging miraculously from confusion, and now he understood why she was telling him what she had denied Dumbledore and Flitwick.\")"
    },
    {
      "entity_1": "tom riddle",
      "entity_2": "helena ravenclaw",
      "relationship_type": "understands",
      "description": "Tom Riddle understands Helena Ravenclaw's desire to possess fabulous objects. (\"Yes, Harry thought, Tom Riddle would certainly have understood Helena Ravenclaw’s desire to possess fabulous objects to which she had little right.\")"
    },
    {
      "entity_1": "tom riddle",
      "entity_2": "helena ravenclaw",
      "relationship_type": "manipulates",
      "description": "Tom Riddle manipulates Helena Ravenclaw into telling him her story. (\"Well, you weren’t the ﬁrst person Riddle wormed things out of,\")"
    },
    {
      "entity_1": "baron",
      "entity_2": "helena ravenclaw",
      "relationship_type": "approaches",
      "description": "The Baron approaches Helena Ravenclaw in the forest. (\"It remained where I had hidden it when I heard the Baron blundering through the forest toward me.\")"
    }
  ]
}