{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as one of the people whose features are changing, specifically her hair appearing to shoot backward into her skull."
    },
    {
      "name": "mundungus",
      "entity_type": "person",
      "singular": true,
      "description": "Mundungus is described as one of the people whose features are changing, shooting upward."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as one of the people whose features are changing, shrinking in size."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is described as one of the people whose features are changing, shrinking in size and turning to George to comment on their identical appearance."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is described as one of the people whose features are changing, shrinking in size and turning to Fred to comment on their identical appearance."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is described as one of the people whose hair appears to shoot backward into her skull."
    },
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "Moody is described as a person who is unconcerned and loosening ties on sacks he brought with him."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is described as one of the people whose features are changing, specifically there being six Harry Potters in front of Moody."
    }
  ],
  "relationships": [
    {
      "entity_1": "fred",
      "entity_2": "george",
      "relationship_type": "commented_on",
      "description": "Fred and George comment on their identical appearance together, saying 'Wow — we’re identical!'"
    },
    {
      "entity_1": "moody",
      "entity_2": "harry potter",
      "relationship_type": "created",
      "description": "Moody creates six Harry Potters in front of him."
    }
  ]
}