{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who doesn't want to go with the Dursleys. He is referred to by name and is described as being in the room."
    },
    {
      "name": "dudley",
      "entity_type": "person",
      "singular": true,
      "description": "Dudley is mentioned as asking questions about Harry's departure. He is referred to by name and is described as struggling with concepts too difficult to put into words."
    },
    {
      "name": "aunt petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Aunt Petunia is mentioned as stopping along with Dudley when they were about to leave. She is referred to by name and is described as looking at Uncle Vernon."
    },
    {
      "name": "uncle vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Uncle Vernon is mentioned as being loud and asking Harry if he wants to go with them. He is referred to by name and is described as turning to glare at Harry."
    },
    {
      "name": "hestia jones",
      "entity_type": "person",
      "singular": true,
      "description": "Hestia Jones is mentioned as breaking the silence and asking Uncle Vernon where Harry is going. She is referred to by name and is described as looking bewildered."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "dursleys",
      "relationship_type": "departure",
      "description": "Harry is departing with the Dursleys, but it's implied that he doesn't want to go."
    },
    {
      "entity_1": "dudley",
      "entity_2": "concepts",
      "relationship_type": "struggle",
      "description": "Dudley is struggling with concepts too difficult to put into words."
    },
    {
      "entity_1": "hestia jones",
      "entity_2": "uncle vernon",
      "relationship_type": "questioning",
      "description": "Hestia Jones asks Uncle Vernon where Harry is going, implying that she knows something about the situation."
    },
    {
      "entity_1": "aunt petunia",
      "entity_2": "dudley",
      "relationship_type": "support",
      "description": "Aunt Petunia stops along with Dudley when they were about to leave, suggesting that she is supporting him."
    }
  ]
}