{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as the person who stood next door. He is referred to by name and is a key character in the scene."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who bellowed 'Ron!' and used his wand to steady the rampart. He is also referred to as 'Potter' by Crabbe."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who screamed out of sight. She is a key character in the scene and is implied to be present but not directly involved in the action."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as someone who stayed Crabbe's arm and tried to reason with him. He is a key character in the scene and is implied to be trying to prevent damage to the room."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is mentioned as someone who made to repeat his spell but was stayed by Malfoy. He is a key character in the scene and is implied to be trying to cause damage to the room."
    },
    {
      "name": "diadem thing",
      "entity_type": "object",
      "singular": true,
      "description": "The diadem thing is mentioned as something that Potter wants and that might be buried if the room is wrecked. It is referred to as an object of importance in the scene."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "called_out_to",
      "description": "Harry bellowed 'Ron!' indicating that he was calling out to Ron. This is described as Harry trying to get Ron's attention."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "crabbe",
      "relationship_type": "stayed_arm_of",
      "description": "Malfoy stayed Crabbe's arm, indicating that Malfoy was trying to prevent Crabbe from repeating his spell. This is described as Malfoy trying to reason with Crabbe."
    },
    {
      "entity_1": "harry",
      "entity_2": "diadem thing",
      "relationship_type": "wanted",
      "description": "Harry is implied to be the one who wants the diadem thing, although it is not explicitly stated. This is described as something that Potter wants."
    }
  ]
}