{
  "entities": [
    {
      "name": "skeeter",
      "entity_type": "person",
      "singular": true,
      "description": "Skeeter is mentioned as someone who took advantage of Bathilda, according to Doge. (\"If that is so, it is even more dishonorable for Skeeter to have taken advantage of her\")"
    },
    {
      "name": "bathilda",
      "entity_type": "person",
      "singular": true,
      "description": "Bathilda is mentioned as someone who may have said something that cannot be relied upon, according to Doge. (\"no reliance can be placed on anything Bathilda may have said!\")"
    },
    {
      "name": "rita skeeter",
      "entity_type": "person",
      "singular": true,
      "description": "Rita Skeeter is mentioned as someone who knows ways of bringing back memories. (\"Oh, there are ways of bringing back memories, and I’m sure Rita Skeeter knows them all\")"
    },
    {
      "name": "auntie muriel",
      "entity_type": "person",
      "singular": true,
      "description": "Auntie Muriel is mentioned as someone who thinks Bathilda may have old photographs and letters. (\"But even if Bathilda’s completely cuckoo, I’m sure she’d still have old photographs, maybe even letters\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone who lived in Godric's Hollow. (\"She knew the Dumbledores for years... The Dumbledores moved there after Percival was imprisoned\")"
    },
    {
      "name": "godric's hollow",
      "entity_type": "location",
      "singular": false,
      "description": "Godric's Hollow is mentioned as a location where Bathilda lives and the Dumbledores used to live. (\"She’s been there forever! The Dumbledores moved there after Percival was imprisoned\")"
    },
    {
      "name": "percival",
      "entity_type": "person",
      "singular": true,
      "description": "Percival is mentioned as someone who was imprisoned, which led to the Dumbledores moving to Godric's Hollow. (\"The Dumbledores moved there after Percival was imprisoned\")"
    },
    {
      "name": "barry",
      "entity_type": "person",
      "singular": true,
      "description": "Barry is mentioned as Harry's name, which Auntie Muriel uses to address him. (\"Yes, Barry, that’s what I just said\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "skeeter",
      "entity_2": "bathilda",
      "relationship_type": "took_advantage_of",
      "description": "Skeeter took advantage of Bathilda, according to Doge. (\"If that is so, it is even more dishonorable for Skeeter to have taken advantage of her\")"
    },
    {
      "entity_1": "auntie muriel",
      "entity_2": "bathilda",
      "relationship_type": "thinks_has_old_photos_and_letters",
      "description": "Auntie Muriel thinks Bathilda may have old photographs and letters. (\"But even if Bathilda’s completely cuckoo, I’m sure she’d still have old photographs, maybe even letters\")"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "godric's hollow",
      "relationship_type": "lived_in",
      "description": "The Dumbledores lived in Godric's Hollow. (\"She knew the Dumbledores for years... The Dumbledores moved there after Percival was imprisoned\")"
    },
    {
      "entity_1": "bathilda",
      "entity_2": "godric's hollow",
      "relationship_type": "lives_in",
      "description": "Bathilda lives in Godric's Hollow. (\"She’s been there forever! The Dumbledores moved there after Percival was imprisoned\")"
    }
  ]
}