{
  "entities": [
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as one of those who could no longer work. He is referred to by name and is a member of the Weasley family."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as one of those who could no longer work. He is referred to by name and is a member of the Weasley family."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is mentioned as someone who could no longer work. He is referred to by title and last name."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is mentioned as the one being spoken to by Mr. Weasley. She is a witch and is helping with dinner preparation."
    },
    {
      "name": "griphook",
      "entity_type": "goblin",
      "singular": true,
      "description": "Griphook is mentioned as someone who needs meat for dinner. He is referred to by name and is a goblin."
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is mentioned as someone who prefers his meat bloody. He is referred to by name and is a member of the Weasley family."
    },
    {
      "name": "greyback",
      "entity_type": "werewolf",
      "singular": true,
      "description": "Greyback is mentioned as the one who attacked Bill. He is referred to by name and is a werewolf."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who saved Fleur's sister's life. He is referred to by name and is a member of the Weasley family."
    },
    {
      "name": "gabrielle",
      "entity_type": "person",
      "singular": true,
      "description": "Gabrielle is mentioned as Fleur's sister. She is referred to by name and is a person."
    },
    {
      "name": "mr ollivander",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Ollivander is mentioned as someone who leaves Shell Cottage for Muriel's evening. He is referred to by title and last name."
    },
    {
      "name": "muriel",
      "entity_type": "person",
      "singular": true,
      "description": "Muriel is mentioned as the one whose evening Mr. Ollivander is leaving for. She is referred to by name and is a person."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who can take a room upstairs. He is referred to by name and is a member of the Weasley family."
    },
    {
      "name": "dean",
      "entity_type": "person",
      "singular": true,
      "description": "Dean is mentioned as someone who can take a room upstairs. He is referred to by name and is a person."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "fleur",
      "relationship_type": "saved_life_of",
      "description": "Harry saved Fleur's sister's life, according to the text."
    },
    {
      "entity_1": "mr ollivander",
      "entity_2": "muriel",
      "relationship_type": "leaves_for",
      "description": "Mr. Ollivander leaves Shell Cottage for Muriel's evening."
    }
  ]
}