{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who knows what Muriel told Harry. She is also shown to be concerned about Harry's feelings and wants him to get the truth."
    },
    {
      "name": "muriel",
      "entity_type": "person",
      "singular": true,
      "description": "Muriel is introduced as a malicious old woman who has told Harry something that upset him. Hermione questions Harry's decision to believe Muriel."
    },
    {
      "name": "rita skeeter",
      "entity_type": "person",
      "singular": true,
      "description": "Rita Skeeter is mentioned by Hermione as someone who writes malicious articles about people. Hermione suggests that Harry should not believe her."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned by Hermione as someone whom Harry knew and trusted. She suggests that Harry's memories of Dumbledore are being tarnished by the lies of others."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character in this passage. He is upset by what Muriel told him and wants to know the truth."
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "harry",
      "relationship_type": "concerned_about",
      "description": "Hermione is concerned about Harry's feelings and wants him to get the truth."
    },
    {
      "entity_1": "rita skeeter",
      "entity_2": "harry",
      "relationship_type": "untrustworthy",
      "description": "Hermione suggests that Rita Skeeter writes malicious articles about people, implying that she cannot be trusted by Harry."
    },
    {
      "entity_1": "muriel",
      "entity_2": "harry",
      "relationship_type": "told_something_upsetting",
      "description": "Muriel told Harry something that upset him. Hermione questions Harry's decision to believe Muriel."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "trusted",
      "description": "Hermione mentions Dumbledore as someone whom Harry knew and trusted."
    }
  ]
}