{
  "entities": [
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is the main character in the conversation. He is mentioned as having a mother and being related to Dumbledore."
    },
    {
      "name": "severus snape",
      "entity_type": "character",
      "singular": true,
      "description": "Snape is a character who was working for Dumbledore, not Harry. His Patronus is revealed to be a doe."
    },
    {
      "name": "dumbledore",
      "entity_type": "character",
      "singular": true,
      "description": "Dumbledore is mentioned as the one Snape was working for. He is also related to Harry's mother."
    },
    {
      "name": "voldemort",
      "entity_type": "character",
      "singular": true,
      "description": "Voldemort is the antagonist in the conversation, who is being confronted by Harry."
    },
    {
      "name": "riddle",
      "entity_type": "character",
      "singular": true,
      "description": "Riddle is Voldemort's name when he was younger. He is mentioned as someone who did not understand Snape's Patronus."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "dumbledore",
      "relationship_type": "related_to",
      "description": "Harry and Dumbledore are related, as revealed in the conversation. Harry mentions that Snape was working for Dumbledore."
    },
    {
      "entity_1": "severus snape",
      "entity_2": "harry",
      "relationship_type": "loved_by",
      "description": "Snape loved Harry's mother for nearly all of his life, as revealed by Harry. This is also mentioned in the context of Snape's Patronus."
    },
    {
      "entity_1": "severus snape",
      "entity_2": "dumbledore",
      "relationship_type": "worked_for",
      "description": "Snape was working for Dumbledore, as revealed by Harry. This is mentioned in the context of Snape's Patronus and his relationship with Harry's mother."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "riddle",
      "relationship_type": "same_person",
      "description": "Voldemort and Riddle are the same person, as mentioned in the conversation. This is revealed when Harry confronts Voldemort about his past."
    }
  ]
}