{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is the one operating the motorcycle and trying to get Harry safe. He is described as 'roaring' and 'slamming a thick finger'."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the passenger on the motorcycle, being pursued by Death Eaters. He is described as shouting and trying to avoid curses."
    },
    {
      "name": "death eaters",
      "entity_type": "group",
      "singular": false,
      "description": "The Death Eaters are a group of four individuals who have broken away from the circle and are pursuing Harry and Hagrid. They are described as 'aiming for Hagrid's broad back' and shooting curses."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "death eaters",
      "relationship_type": "pursuing",
      "description": "Hagrid is being pursued by the Death Eaters, who are trying to attack him. This is described as 'Four Death Eaters had broken away from the circle and were pursuing them'."
    },
    {
      "entity_1": "harry",
      "entity_2": "death eaters",
      "relationship_type": "being_pursued_by",
      "description": "Harry is being pursued by the Death Eaters, who are trying to attack him. This is described as 'Two jets of green light flew past his left ear: Four Death Eaters had broken away from the circle and were pursuing them'."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "death eaters",
      "relationship_type": "being_attacked_by",
      "description": "Hagrid is being attacked by the Death Eaters, who are shooting curses at him. This is described as 'more curses shot after them'."
    },
    {
      "entity_1": "harry",
      "entity_2": "death eaters",
      "relationship_type": "avoiding",
      "description": "Harry is trying to avoid the Death Eaters, who are shooting curses at him. This is described as 'Harry had to sink low into the sidecar to avoid them'."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "death eaters",
      "relationship_type": "defending",
      "description": "Hagrid is defending himself against the Death Eaters, who are attacking him. This is described as 'Hold on, Harry, this'll do it for 'em!' and Hagrid slamming a thick finger into something."
    },
    {
      "entity_1": "harry",
      "entity_2": "death eaters",
      "relationship_type": "defending",
      "description": "Harry is defending himself against the Death Eaters, who are attacking him. This is described as 'Wriggling around he cried, “Stupefy!” and a red bolt of light shot from his own wand'."
    }
  ]
}