{
  "entities": [
    {
      "name": "resurrection stone",
      "entity_type": "object",
      "singular": true,
      "description": "The Resurrection Stone is mentioned as a powerful object that can bring back the dead. It is described as an army of Inferi to one person and the return of parents to another."
    },
    {
      "name": "cloak",
      "entity_type": "object",
      "singular": true,
      "description": "The Cloak is mentioned as a powerful object that can protect and shield others as well as its owner. It is said to be part of a trio with the Resurrection Stone and the wand."
    },
    {
      "name": "wand",
      "entity_type": "object",
      "singular": true,
      "description": "The wand is mentioned as a powerful object that would lead us to power."
    }
  ],
  "relationships": [
    {
      "entity_1": "resurrection stone",
      "entity_2": "cloak",
      "relationship_type": "complement",
      "description": "The Resurrection Stone and the Cloak are part of a trio, with the legend saying that the man who united all three objects would be truly master of death."
    },
    {
      "entity_1": "resurrection stone",
      "entity_2": "wand",
      "relationship_type": "complement",
      "description": "The Resurrection Stone and the Wand are part of a trio, with the legend saying that the man who united all three objects would be truly master of death."
    },
    {
      "entity_1": "cloak",
      "entity_2": "resurrection stone",
      "relationship_type": "complement",
      "description": "The Cloak and the Resurrection Stone are part of a trio, with the legend saying that the man who united all three objects would be truly master of death."
    },
    {
      "entity_1": "cloak",
      "entity_2": "wand",
      "relationship_type": "complement",
      "description": "The Cloak and the Wand are part of a trio, with the legend saying that the man who united all three objects would be truly master of death."
    },
    {
      "entity_1": "resurrection stone",
      "entity_2": "ariana",
      "relationship_type": "useful_for",
      "description": "The Resurrection Stone might be useful in hiding Ariana, according to one person's thought."
    }
  ]
}