{
  "entities": [
    {
      "name": "bellatrix",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix is mentioned as a person who has just gotten married, and the Death Eaters are mocking her family's reaction to it. (\"I'm talking about your niece, Bellatrix... She has just married the werewolf, Remus Lupin.\")"
    },
    {
      "name": "lucius",
      "entity_type": "person",
      "singular": true,
      "description": "Lucius is mentioned as a person who is part of Bellatrix's family. (\"And your, Lucius and Narcissa.\")"
    },
    {
      "name": "narcissa",
      "entity_type": "person",
      "singular": true,
      "description": "Narcissa is mentioned as a person who is part of Bellatrix's family. (\"And your, Lucius and Narcissa.\")"
    },
    {
      "name": "remus lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Remus Lupin is mentioned as a werewolf who has married Bellatrix. (\"She has just married the werewolf, Remus Lupin.\")"
    },
    {
      "name": "death eaters",
      "entity_type": "group",
      "singular": false,
      "description": "The Death Eaters are mentioned as a group of people who are mocking Bellatrix's family. (\"There was an eruption of jeering laughter from around the table.\")"
    },
    {
      "name": "great snake",
      "entity_type": "animal",
      "singular": true,
      "description": "The great snake is mentioned as a creature that is present in the scene and is reacting to the disturbance. (\"The great snake, disliking the disturbance, opened its mouth and hissed angrily,\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "bellatrix",
      "entity_2": "remus lupin",
      "relationship_type": "married_to",
      "description": "Bellatrix is married to Remus Lupin, as mentioned in the text. (\"She has just married the werewolf, Remus Lupin.\")"
    },
    {
      "entity_1": "bellatrix",
      "entity_2": "lucius",
      "relationship_type": "sister_of",
      "description": "Bellatrix is mentioned as a sister of Lucius. (\"She is no niece of ours, my Lord,\" she cried over the outpouring of mirth. \"We — Narcissa and I — have never set eyes on our sister since she married the Mudblood.\")"
    },
    {
      "entity_1": "bellatrix",
      "entity_2": "narcissa",
      "relationship_type": "sister_of",
      "description": "Bellatrix is mentioned as a sister of Narcissa. (\"She is no niece of ours, my Lord,\" she cried over the outpouring of mirth. \"We — Narcissa and I — have never set eyes on our sister since she married the Mudblood.\")"
    },
    {
      "entity_1": "lucius",
      "entity_2": "narcissa",
      "relationship_type": "sister_of",
      "description": "Lucius is mentioned as a brother of Narcissa. (\"She is no niece of ours, my Lord,\" she cried over the outpouring of mirth. \"We — Narcissa and I — have never set eyes on our sister since she married the Mudblood.\")"
    }
  ]
}