{
  "entities": [
    {
      "name": "eagle",
      "entity_type": "symbol",
      "singular": true,
      "description": "The eagle is mentioned as being on something, but its significance and context are not clear. (\"ever come across something with her eagle on it\")"
    },
    {
      "name": "ravenclaws",
      "entity_type": "house",
      "singular": false,
      "description": "Ravenclaw is a house at Hogwarts School of Witchcraft and Wizardry. It is mentioned as having a lost diadem. (\"The lost diadem of Ravenclaw? Daddy’s trying to duplicate it.\")"
    },
    {
      "name": "luna",
      "entity_type": "person",
      "singular": true,
      "description": "Luna is a student at Hogwarts and a member of the Ravenclaws house. She mentions the lost diadem of Ravenclaw. (\"Well, that’s her lost diadem.\")"
    },
    {
      "name": "padma",
      "entity_type": "person",
      "singular": true,
      "description": "Padma is a student at Hogwarts and a member of the Ravenclaws house. She is part of the group being addressed by Harry. (\"He looked hopefully toward the little group of Ravenclaws, to Padma...\")"
    },
    {
      "name": "michael",
      "entity_type": "person",
      "singular": true,
      "description": "Michael is a student at Hogwarts and a member of the Ravenclaws house. He mentions that the lost diadem is indeed lost. (\"Yeah, but the lost diadem,” said Michael Corner, rolling his eyes, “is lost, Luna.\")"
    },
    {
      "name": "terry",
      "entity_type": "person",
      "singular": true,
      "description": "Terry is a student at Hogwarts and a member of the Ravenclaws house. He explains what a diadem is to Ron. (\"It’s a kind of crown,” said Terry Boot.\")"
    },
    {
      "name": "cho",
      "entity_type": "person",
      "singular": true,
      "description": "Cho is a student at Hogwarts and a member of the Ravenclaws house. She mentions that the lost diadem vanished with Ravenclaw herself. (\"Professor Flitwick says the diadem vanished with Ravenclaw herself.\")"
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is a student at Hogwarts and has a chair where Luna is perched on its arm. (\"perched on the arm of Ginny’s chair\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a student at Hogwarts and asks what a diadem is. (\"Sorry, but what is a diadem?” asked Ron.\")"
    },
    {
      "name": "professor flitwick",
      "entity_type": "teacher",
      "singular": true,
      "description": "Professor Flitwick is mentioned as saying that the diadem vanished with Ravenclaw herself. (\"Professor Flitwick says the diadem vanished with Ravenclaw herself.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a student at Hogwarts and asks when the lost diadem was lost. (\"When was it lost?” asked Harry.\")"
    },
    {
      "name": "daddy",
      "entity_type": "person",
      "singular": true,
      "description": "Daddy is mentioned as trying to duplicate the lost diadem of Ravenclaw. (\"The lost diadem of Ravenclaw? Daddy’s trying to duplicate it.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "ravenclaws",
      "entity_2": "luna",
      "relationship_type": "member_of",
      "description": "Luna is a member of the Ravenclaws house. (\"Well, that’s her lost diadem.\")"
    },
    {
      "entity_1": "padma",
      "entity_2": "ravenclaws",
      "relationship_type": "member_of",
      "description": "Padma is a member of the Ravenclaws house. (\"He looked hopefully toward the little group of Ravenclaws, to Padma...\")"
    },
    {
      "entity_1": "michael",
      "entity_2": "ravenclaws",
      "relationship_type": "member_of",
      "description": "Michael is a member of the Ravenclaws house. (\"Yeah, but the lost diadem,” said Michael Corner, rolling his eyes, “is lost, Luna.\")"
    },
    {
      "entity_1": "terry",
      "entity_2": "ravenclaws",
      "relationship_type": "member_of",
      "description": "Terry is a member of the Ravenclaws house. (\"It’s a kind of crown,” said Terry Boot.\")"
    },
    {
      "entity_1": "cho",
      "entity_2": "ravenclaws",
      "relationship_type": "member_of",
      "description": "Cho is a member of the Ravenclaws house. (\"Professor Flitwick says the diadem vanished with Ravenclaw herself.\")"
    }
  ]
}