{
  "entities": [
    {
      "name": "ginn",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as suddenly speaking up to identify a group of people. She says 'I think that's them, Al'."
    },
    {
      "name": "albus",
      "entity_type": "person",
      "singular": true,
      "description": "Albus is mentioned as being relieved and having his trunk and owl lifted onto the train by Harry and Ron."
    },
    {
      "name": "rose",
      "entity_type": "person",
      "singular": true,
      "description": "Rose is mentioned as already wearing her brand-new Hogwarts robes and beaming at Albus."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as asking Harry if he parked the car all right and whispering to him that he actually Confunded the examiner."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being with Ron and lifting Albus's trunk and owl onto the train."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as not believing Ron could pass a Muggle driving test and having faith in him."
    },
    {
      "name": "hugo",
      "entity_type": "person",
      "singular": true,
      "description": "Hugo is mentioned as Rose's younger brother and having an animated discussion with Lily about which House they should be sorted into."
    },
    {
      "name": "lily",
      "entity_type": "person",
      "singular": true,
      "description": "Lily is mentioned as being with Hugo and discussing which House they should be sorted into."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "acquaintance",
      "description": "Ron and Harry are mentioned as working together to lift Albus's trunk and owl onto the train."
    },
    {
      "entity_1": "hermione",
      "entity_2": "ron",
      "relationship_type": "supporter",
      "description": "Hermione is mentioned as having faith in Ron's ability to pass a Muggle driving test."
    },
    {
      "entity_1": "hugo",
      "entity_2": "lily",
      "relationship_type": "acquaintance",
      "description": "Hugo and Lily are mentioned as discussing which House they should be sorted into."
    }
  ]
}