{
  "entities": [
    {
      "name": "dumbledore family",
      "entity_type": "family",
      "singular": false,
      "description": "The Dumbledore family is described as a group of people in a photograph. The description mentions the names of each family member: Albus, Percival, Ariana, Kendra, and Aberforth."
    },
    {
      "name": "albus dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Albus Dumbledore is described as looking several years older than his brother Aberforth in the photograph. He is also mentioned to have a different nose shape compared to his brother."
    },
    {
      "name": "percival dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Percival Dumbledore is described as a good-looking man with twinkling eyes even in an old and faded photograph."
    },
    {
      "name": "ariana dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Ariana Dumbledore is described as being little longer than a loaf of bread and not very distinctive-looking in the photograph."
    },
    {
      "name": "kendra dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Kendra Dumbledore is described as having jet black hair pulled into a high bun and dark eyes that remind Harry of Native Americans. Her face has a carved quality about it."
    },
    {
      "name": "aberforth dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Aberforth Dumbledore is described as looking very alike to his brother Albus in the photograph, but with identical shoulder-length hairstyles and matching lacy collared jackets."
    }
  ],
  "relationships": [
    {
      "entity_1": "albus dumbledore",
      "entity_2": "aberforth dumbledore",
      "relationship_type": "looks alike",
      "description": "Albus and Aberforth are described as looking very alike in the photograph, with identical hairstyles and matching jackets. This suggests a close physical resemblance between the two brothers."
    },
    {
      "entity_1": "albus dumbledore",
      "entity_2": "kendra dumbledore",
      "relationship_type": "parent child",
      "description": "Albus is mentioned as being part of the Dumbledore family, with Kendra as his mother. This establishes a parent-child relationship between Albus and Kendra."
    },
    {
      "entity_1": "aberforth dumbledore",
      "entity_2": "kendra dumbledore",
      "relationship_type": "parent child",
      "description": "Aberforth is also mentioned as being part of the Dumbledore family, with Kendra as his mother. This establishes a parent-child relationship between Aberforth and Kendra."
    },
    {
      "entity_1": "percival dumbledore",
      "entity_2": "kendra dumbledore",
      "relationship_type": "spouse spouse",
      "description": "Percival is mentioned as being married to Kendra, establishing a spousal relationship between the two."
    }
  ]
}