{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story, who is trying to escape from the goblins. He is described as being in pain from burns covering his body."
    },
    {
      "name": "griphook",
      "entity_type": "goblin",
      "singular": true,
      "description": "A goblin who was with Harry, but ran away when he saw the sword. He is described as brandishing the sword and crying for help."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "One of Harry's friends, who joins in the spell-casting to try and defeat the goblins."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Another one of Harry's friends, who also joins in the spell-casting to help defeat the goblins."
    },
    {
      "name": "dragon",
      "entity_type": "animal",
      "singular": true,
      "description": "A dragon that is tied up and lets out a roar when it sees the goblins. It then breathes fire on them, causing them to flee."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "griphook",
      "relationship_type": "ran_from",
      "description": "Griphook ran away from Harry when he saw the sword. This is described in the text as 'Sliding from Harry’s shoulders the moment he could, he had sprinted for cover amongst the surrounding goblins'."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "worked_with",
      "description": "Harry and Ron worked together to try and defeat the goblins. This is described in the text as '“Stupefy!” he bellowed, and Ron and Hermione joined in'."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "worked_with",
      "description": "Harry and Hermione worked together to try and defeat the goblins. This is described in the text as '“Stupefy!” he bellowed, and Ron and Hermione joined in'."
    },
    {
      "entity_1": "dragon",
      "entity_2": "goblins",
      "relationship_type": "attacked",
      "description": "The dragon attacked the goblins when it saw them. This is described in the text as 'The tethered dragon let out a roar, and a gush of ﬂame ﬂew over the goblins'."
    }
  ]
}