{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as the one who will take tokens and drink a potion to transform into Mafalda Hopkirk. (\"You'd better take this, Hermione, and here are the tokens\")"
    },
    {
      "name": "mafalda hopkirk",
      "entity_type": "person",
      "singular": true,
      "description": "Mafalda Hopkirk is mentioned as a witch who has been transformed into by Hermione using Polyjuice Potion. (\"Hermione drank the Polyjuice Potion, which was now a pleasant heliotrope color, and within seconds stood before them, the double of Mafalda Hopkirk\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as checking his watch and hurrying to close the door. (\"Harry checked his watch. Were running late, Mr. Magical Maintenance will be here any second\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as throwing an Invisibility Cloak over himself along with Harry. (\"Harry and Ron threw the Invisibility Cloak over themselves but Hermione remained in view, waiting\")"
    },
    {
      "name": "mr. magical maintenance",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Magical Maintenance is mentioned as someone who will arrive soon. (\"Were running late, Mr. Magical Maintenance will be here any second\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "mafalda hopkirk",
      "relationship_type": "transformation",
      "description": "Hermione transforms into Mafalda Hopkirk using Polyjuice Potion. (\"Hermione drank the Polyjuice Potion, which was now a pleasant heliotrope color, and within seconds stood before them, the double of Mafalda Hopkirk\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "mr. magical maintenance",
      "relationship_type": "arrival anticipation",
      "description": "Harry is waiting for Mr. Magical Maintenance to arrive. (\"Were running late, Mr. Magical Maintenance will be here any second\")"
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "cooperation",
      "description": "Ron is cooperating with Harry by throwing an Invisibility Cloak over himself along with Harry. (\"Harry and Ron threw the Invisibility Cloak over themselves but Hermione remained in view, waiting\")"
    }
  ]
}