{
  "entities": [
    {
      "name": "geour",
      "entity_type": "person",
      "singular": true,
      "description": "Geour remains shut up in his office all day. This implies that Geour is a person who works from home or has an office."
    },
    {
      "name": "Mrs. Weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley magicked her empty plates onto the work surface and served apple tart. This shows that Mrs. Weasley is a person with magical abilities."
    },
    {
      "name": "Fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur said 'For ze wedding,' she added, when he looked confused. This implies that Fleur is a person who is involved in the wedding planning."
    },
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry gathered that she still suspected Hagrid. This shows that Harry is a person who is aware of the situation and has some knowledge about it."
    },
    {
      "name": "Hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "It was mentioned that Mrs. Weasley still suspected Hagrid. This implies that Hagrid is a person who is being suspected by Mrs. Weasley."
    },
    {
      "name": "Ron",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley asked Ron if he had cleaned out his room yet. This shows that Ron is a person who lives in the house and has a room to clean."
    }
  ],
  "relationships": [
    {
      "entity_1": "Fleur",
      "entity_2": "Harry",
      "relationship_type": "suspects",
      "description": "Fleur said 'For ze wedding,' she added, when he looked confused. This implies that Fleur suspects Harry about something."
    },
    {
      "entity_1": "Mrs. Weasley",
      "entity_2": "Hagrid",
      "relationship_type": "suspects",
      "description": "It was mentioned that Mrs. Weasley still suspected Hagrid. This shows that Mrs. Weasley has suspicions about Hagrid."
    },
    {
      "entity_1": "Mrs. Weasley",
      "entity_2": "Ron",
      "relationship_type": "asks",
      "description": "Mrs. Weasley asked Ron if he had cleaned out his room yet. This shows that Mrs. Weasley is asking Ron to do something."
    }
  ]
}