{
  "entities": [
    {
      "name": "monsieur delacour",
      "entity_type": "person",
      "singular": true,
      "description": "Monsieur Delacour is mentioned as protesting and insisting on taking their bedroom. He is described as a person who is involved in the situation."
    },
    {
      "name": "madame delacour",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Delacour is also mentioned as protesting and insisting on taking their bedroom. She is described as a person who is involved in the situation."
    },
    {
      "name": "gabrielle",
      "entity_type": "person",
      "singular": true,
      "description": "Gabrielle is mentioned as sleeping with Fleur in Percy's old room. She is described as a person who is part of the household."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is mentioned as sleeping with Gabrielle in Percy's old room. She is described as a person who is part of the household."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is mentioned as having an old room where Fleur and Gabrielle are sleeping. He is described as a person who owns the room."
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is mentioned as arriving from Romania to share a bedroom with Charlie. He is described as a person who is part of the household."
    },
    {
      "name": "charlie",
      "entity_type": "person",
      "singular": true,
      "description": "Charlie is mentioned as Bill's best man and someone who will be sharing a bedroom with him. He is described as a person who is part of the household."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as one of the people who are trying to escape the overcrowded house by feeding the chickens. He is described as a person who is part of the household."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as snarling at Mrs. Weasley and trying to escape the overcrowded house by feeding the chickens. He is described as a person who is part of the household."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as one of the people who are trying to escape the overcrowded house by feeding the chickens. She is described as a person who is part of the household."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is not explicitly mentioned in this text but his wife Mrs. Weasley is mentioned. He might be implied to be present due to his relationship with Mrs. Weasley."
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is mentioned as carrying a large basket of laundry and foiling the meeting in the yard. She is described as a person who is part of the household."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "friendship",
      "description": "Harry, Ron, and Hermione are trying to escape the overcrowded house by feeding the chickens together. This suggests a close relationship between Harry and Ron."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry, Ron, and Hermione are trying to escape the overcrowded house by feeding the chickens together. This suggests a close relationship between Harry and Hermione."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry, Ron, and Hermione are trying to escape the overcrowded house by feeding the chickens together. This suggests a close relationship between Ron and Hermione."
    },
    {
      "entity_1": "bill",
      "entity_2": "charlie",
      "relationship_type": "friendship",
      "description": "Bill is mentioned as arriving from Romania to share a bedroom with Charlie, who is his best man. This suggests a close relationship between Bill and Charlie."
    }
  ]
}