{
  "entities": [
    {
      "name": "church row",
      "entity_type": "location",
      "singular": true,
      "description": "The church row is described as being behind the church where Harry and Hermione are standing. The text states 'Behind the church row upon row of snowy tombstones protruded from a blanket of pale blue that was ﬂecked with dazzling red, gold, and green wherever the reﬂections from the stained glass hit the snow.'"
    },
    {
      "name": "tombstones",
      "entity_type": "location",
      "singular": false,
      "description": "The tombstones are described as being behind the church row. The text states 'Upon row upon row of snowy tombstones protruded from a blanket of pale blue that was ﬂecked with dazzling red, gold, and green wherever the reﬂections from the stained glass hit the snow.'"
    },
    {
      "name": "abbott",
      "entity_type": "family_name",
      "singular": true,
      "description": "The Abbott family is mentioned as a possible relation of Hannah's. The text states '“Look at this, it’s an Abbott, could be some long-lost relation of Hannah’s!”'"
    },
    {
      "name": "hannah",
      "entity_type": "person_name",
      "singular": true,
      "description": "Hannah is mentioned as possibly being related to the Abbott family. The text states '“Look at this, it’s an Abbott, could be some long-lost relation of Hannah’s!”'"
    },
    {
      "name": "hermione",
      "entity_type": "person_name",
      "singular": true,
      "description": "Hermione is mentioned as being with Harry in the graveyard. The text states '“Harry, here!” / Hermione was two rows of tombstones away: he had to wade back to her, his heart positively banging in his chest.'"
    },
    {
      "name": "kendra dumbledore",
      "entity_type": "person_name",
      "singular": true,
      "description": "Kendra Dumbledore is mentioned as being buried in the graveyard. The text states '“Is it — ?” / “No, but look!” / She pointed to the dark stone. Harry stooped down and saw, upon the frozen lichen-spotted granite, the words Kendra Dumbledore'"
    },
    {
      "name": "harry",
      "entity_type": "person_name",
      "singular": true,
      "description": "Harry is mentioned as being with Hermione in the graveyard. The text states '“Harry, here!” / Hermione was two rows of tombstones away: he had to wade back to her, his heart positively banging in his chest.'"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "accompanying",
      "description": "Harry and Hermione are accompanying each other through the graveyard. The text states 'They waded deeper and deeper into the graveyard, gouging dark tracks into the snow behind them, stooping to peer at the words on old headstones, every now and then squinting into the surrounding darkness to make absolutely sure that they were unaccompanied.'"
    },
    {
      "entity_1": "harry",
      "entity_2": "kendra dumbledore",
      "relationship_type": "visited",
      "description": "Harry visited Kendra Dumbledore's grave. The text states 'He stooped down and saw, upon the frozen lichen-spotted granite, the words Kendra Dumbledore'"
    },
    {
      "entity_1": "hermione",
      "entity_2": "kendra dumbledore",
      "relationship_type": "visited",
      "description": "Hermione visited Kendra Dumbledore's grave. The text states 'She pointed to the dark stone. Harry stooped down and saw, upon the frozen lichen-spotted granite, the words Kendra Dumbledore'"
    },
    {
      "entity_1": "harry",
      "entity_2": "abbott",
      "relationship_type": "found",
      "description": "Harry found an Abbott grave in the graveyard. The text states '“Look at this, it’s an Abbott, could be some long-lost relation of Hannah’s!”'"
    },
    {
      "entity_1": "hermione",
      "entity_2": "abbott",
      "relationship_type": "found",
      "description": "Hermione found an Abbott grave in the graveyard. The text states '“Look at this, it’s an Abbott, could be some long-lost relation of Hannah’s!”'"
    }
  ]
}