{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as being on top of, and then pulled out of the wreckage by Ron. She is also mentioned to be clutching the sword of Gryﬃndor with a goblin."
    },
    {
      "name": "draco",
      "entity_type": "person",
      "singular": true,
      "description": "Draco is described as doubling over, covering his bloody face. He is also mentioned to be holding the three wands and then having them wrested away by Harry."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as running to pull Hermione out of the wreckage."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as taking the chance to wrestle the three wands from Draco's grip and then casting a triple spell on Greyback."
    },
    {
      "name": "greyback",
      "entity_type": "werewolf",
      "singular": true,
      "description": "Greyback is described as being lifted oﬀ his feet by the triple spell, ﬂew up to the ceiling and then smashed to the ground."
    },
    {
      "name": "narcissa",
      "entity_type": "person",
      "singular": true,
      "description": "Narcissa is described as dragging Draco out of the way of further harm."
    },
    {
      "name": "bellatrix",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix is described as brandishing a silver knife and then being directed by Narcissa's wand at the doorway."
    },
    {
      "name": "goblin",
      "entity_type": "goblin",
      "singular": true,
      "description": "The goblin is described as clutching the sword of Gryﬃndor with Hermione."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "greyback",
      "relationship_type": "cast_spell",
      "description": "Harry cast a triple spell on Greyback, lifting him oﬀ his feet and smashing him to the ground."
    },
    {
      "entity_1": "narcissa",
      "entity_2": "bellatrix",
      "relationship_type": "directed_wand",
      "description": "Narcissa directed her wand at Bellatrix, preventing her from causing further harm."
    }
  ]
}