{
  "entities": [
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is mentioned as one of the people who loves the subject Muggle Studies. He is described as being top in anything for the first time."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is mentioned as one of the people who loves the subject Muggle Studies. He is described as being top in anything for the first time."
    },
    {
      "name": "alecto",
      "entity_type": "person",
      "singular": true,
      "description": "Alecto is mentioned as the sister of Amycus and teaches Muggle Studies. She is described as explaining how Muggles are like animals and how they drove wizards into hiding."
    },
    {
      "name": "amykus",
      "entity_type": "person",
      "singular": true,
      "description": "Amycus is mentioned as Alecto's brother and teaches Muggle Studies with his sister."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is mentioned as the one who got a smart mouth for asking how much Muggle blood Alecto and her brother have. He is also described as standing up to Alecto and giving everyone hope."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as the one who told Neville that there's a time and a place for getting a smart mouth."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who stood up to Alecto in the past and gave everyone hope."
    }
  ],
  "relationships": [
    {
      "entity_1": "neville",
      "entity_2": "alecto",
      "relationship_type": "stood_up_to",
      "description": "Neville stood up to Alecto, giving everyone hope."
    },
    {
      "entity_1": "harry",
      "entity_2": "alecto",
      "relationship_type": "stood_up_to",
      "description": "Harry stood up to Alecto in the past and gave everyone hope."
    }
  ]
}