{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is the headmaster of Hogwarts School of Witchcraft and Wizardry. He has taken trouble to get to know Harry, indicating a close relationship between them."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a student at Hogwarts who has discovered it was in his power to stop the death of others. He is known for not letting anyone else die for him."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is a dark wizard and the main antagonist of the story. He knows that Harry would not let anyone else die for him."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is one of Harry's friends who has died in the Great Hall, forcing their way back into Harry's mind's eye."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is a werewolf and one of Harry's teachers at Hogwarts. He has died in the Great Hall, forcing their way back into Harry's mind's eye."
    },
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is a Metamorphmagus and one of Harry's friends who has died in the Great Hall, forcing their way back into Harry's mind's eye."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is one of Harry's best friends. He and Hermione would know what needed to be done after Dumbledore's death."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is one of Harry's best friends. She and Ron would know what needed to be done after Dumbledore's death."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "knew",
      "description": "Dumbledore has taken trouble to get to know Harry, indicating a close relationship between them."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "harry",
      "relationship_type": "knew",
      "description": "Voldemort knows that Harry would not let anyone else die for him."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "ron",
      "relationship_type": "wanted_to_conﬁde_in",
      "description": "Dumbledore wanted Harry to confide in Ron and Hermione, so that if he fulfilled his true destiny a little early, they could carry on."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "hermione",
      "relationship_type": "wanted_to_conﬁde_in",
      "description": "Dumbledore wanted Harry to confide in Ron and Hermione, so that if he fulfilled his true destiny a little early, they could carry on."
    }
  ]
}