{
  "entities": [
    {
      "name": "dobby",
      "entity_type": "character",
      "singular": true,
      "description": "Dobby is a house-elf who is with Harry and Griphook when they hit the ground. He is described as being on his feet, swaying slightly, and having stars reflected in his eyes (\"The little elf stood feet from him.\" \"DOBBY!\" The elf swayed slightly, stars reﬂected in his wide, shining eyes.)."
    },
    {
      "name": "griphook",
      "entity_type": "character",
      "singular": true,
      "description": "Griphook is a goblin who is with Harry and Dobby when they hit the ground. He is described as stirring and whimpering (\"Harry squinted around through the darkness. There seemed to be a cottage a short way away under the wide starry sky, and he thought he saw movement outside it.\" \"Are you all right?\" he said as the goblin stirred, but Griphook merely whimpered.)."
    },
    {
      "name": "shell cottage",
      "entity_type": "location",
      "singular": true,
      "description": "Shell Cottage is a location that Harry and Dobby seem to have arrived at. It is described as being under the wide starry sky, with movement outside it (\"There seemed to be a cottage a short way away under the wide starry sky, and he thought he saw movement outside it.\" \"Dobby, is this Shell Cottage?\" he whispered...)."
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is a character who is with Dobby and Griphook when they hit the ground. He is described as squinting around through the darkness, looking for movement outside Shell Cottage (\"Harry squinted around through the darkness. There seemed to be a cottage a short way away under the wide starry sky, and he thought he saw movement outside it.\")."
    },
    {
      "name": "malfoys",
      "entity_type": "family",
      "singular": false,
      "description": "The Malfoys are a family that Harry has taken wands from. They are mentioned as the source of the two wands that Harry is holding (\"he whispered, clutching the two wands he had brought from the Malfoys’, ready to ﬁght if he needed to.\")."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "dobby",
      "relationship_type": "with",
      "description": "Harry and Dobby are together when they hit the ground. Harry is described as clutching Dobby's hand (\"Harry fell to his knees, relinquished Dobby’s hand...\"), and later he looks down at the knife protruding from Dobby's chest with him (\"Together, he and Harry looked down at the silver hilt of the knife protruding from the elf’s heaving chest.\")."
    },
    {
      "entity_1": "harry",
      "entity_2": "griphook",
      "relationship_type": "with",
      "description": "Harry and Griphook are together when they hit the ground. Harry is described as attempting to lower Griphook gently to the ground (\"Harry fell to his knees, relinquished Dobby’s hand, and attempted to lower Griphook gently to the ground.\")."
    },
    {
      "entity_1": "harry",
      "entity_2": "shell cottage",
      "relationship_type": "at",
      "description": "Harry is at Shell Cottage when he hits the ground. He looks around and sees a cottage under the wide starry sky (\"There seemed to be a cottage a short way away under the wide starry sky, and he thought he saw movement outside it.\")."
    },
    {
      "entity_1": "dobby",
      "entity_2": "shell cottage",
      "relationship_type": "at",
      "description": "Dobby is at Shell Cottage when Harry hits the ground. He is described as being on his feet near Harry (\"The little elf stood feet from him.\")."
    }
  ]
}