{
  "entities": [
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story, mentioned as 'the real Harry' by Mad-Eye. He is being protected and moved around by the Aurors."
    },
    {
      "name": "Mad-Eye",
      "entity_type": "person",
      "singular": true,
      "description": "An experienced Auror who has been tracking Voldemort's followers. He expects Harry to be with the toughest and most skilled Aurors."
    },
    {
      "name": "Tonks",
      "entity_type": "person",
      "singular": true,
      "description": "A sniffer who is part of the group protecting Harry. She mentions that Mad-Eye expected Harry to be with the toughest and most skilled Aurors."
    },
    {
      "name": "Fleur",
      "entity_type": "person",
      "singular": true,
      "description": "A member of the group who suspects that someone let slip the date of their plan to an outsider."
    },
    {
      "name": "Kingsley",
      "entity_type": "person",
      "singular": true,
      "description": "An Auror who was chased by Voldemort's followers."
    },
    {
      "name": "Mundungus",
      "entity_type": "person",
      "singular": true,
      "description": "A person who gave away the location of Mad-Eye and Kingsley to Voldemort's followers."
    },
    {
      "name": "Voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "The main antagonist of the story, also referred to as 'You-Know-Who'."
    },
    {
      "name": "Hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "A half-giant who has risked his life to save Harry's. He is trusted and loved by Harry."
    }
  ],
  "relationships": [
    {
      "entity_1": "Fleur",
      "entity_2": "Voldemort",
      "relationship_type": "suspect_of",
      "description": "Fleur suspects that someone let slip the date of their plan to an outsider, implying that Voldemort's followers might have been informed by this person."
    },
    {
      "entity_1": "Mad-Eye",
      "entity_2": "Harry",
      "relationship_type": "expectation_of",
      "description": "Mad-Eye expects Harry to be with the toughest and most skilled Aurors."
    },
    {
      "entity_1": "Tonks",
      "entity_2": "Mad-Eye",
      "relationship_type": "statement_about",
      "description": "Tonks mentions that Mad-Eye expected Harry to be with the toughest and most skilled Aurors."
    },
    {
      "entity_1": "Fleur",
      "entity_2": "Hagrid",
      "relationship_type": "accusation_of",
      "description": "Fleur glares at Hagrid, implying that she suspects him of being careless and letting slip the date of their plan."
    }
  ]
}