{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a member of Dumbledore's Army and one of Harry's best friends. He is described as coming up with a plan to deceive Griphook."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main protagonist of the story and a member of Dumbledore's Army. He is described as turning back to face Ron."
    },
    {
      "name": "griphook",
      "entity_type": "goblin",
      "singular": true,
      "description": "Griphook is a goblin who is knowledgeable about magic and has been hired by the trio to help them get into the vault. He is described as being able to tell the difference between real and fake swords."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a member of Dumbledore's Army and one of Harry's best friends. She is described as being upset with Ron's plan to deceive Griphook."
    },
    {
      "name": "vault",
      "entity_type": "location",
      "singular": true,
      "description": "The vault is a secure location that the trio needs to get into. It is mentioned as the reason for their plan to deceive Griphook."
    },
    {
      "name": "swords",
      "entity_type": "object",
      "singular": false,
      "description": "Swords are objects that are being discussed by the trio. There is a fake sword and an ancient goblin-made sword."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "griphook",
      "relationship_type": "deception",
      "description": "Ron plans to deceive Griphook by giving him a fake sword."
    },
    {
      "entity_1": "hermione",
      "entity_2": "ron",
      "relationship_type": "disapproval",
      "description": "Hermione disapproves of Ron's plan to deceive Griphook."
    },
    {
      "entity_1": "harry",
      "entity_2": "vault",
      "relationship_type": "goal",
      "description": "Harry and the trio are trying to get into the vault."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "argument",
      "description": "Ron and Hermione have an argument about how to deal with Griphook."
    }
  ]
}