{
  "entities": [
    {
      "name": "yaxley",
      "entity_type": "person",
      "singular": true,
      "description": "Yaxley's office is raining, indicating that Yaxley is a person who has an office."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron addressed Mr. Weasley and whispered to him, indicating that Ron is a person who interacts with others."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley was addressed by Ron and had papers he was reading, indicating that Mr. Weasley is a person who has responsibilities."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry felt sure he was scared that his father might recognize him if they looked directly into each other's eyes, indicating that Harry is a person who has a family connection."
    },
    {
      "name": "bernie pillsworth",
      "entity_type": "person",
      "singular": true,
      "description": "The Muggleborn Registration Commission sent Bernie Pillsworth to get something, indicating that Bernie Pillsworth is a person who works for the commission."
    },
    {
      "name": "percy weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Percy Weasley strode into the lift and realized he was in a lift with his father, indicating that Percy Weasley is a person who has family connections."
    },
    {
      "name": "muggleborn registration commission",
      "entity_type": "organization",
      "singular": false,
      "description": "The Muggleborn Registration Commission sent Bernie Pillsworth to get something, indicating that the commission is an organization that works with people like Bernie Pillsworth."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "mr weasley",
      "relationship_type": "addressed",
      "description": "Ron addressed Mr. Weasley and whispered to him, indicating a relationship of addressing."
    },
    {
      "entity_1": "harry",
      "entity_2": "mr weasley",
      "relationship_type": "related_to",
      "description": "Harry felt sure he was scared that his father might recognize him if they looked directly into each other's eyes, indicating a family connection between Harry and Mr. Weasley."
    },
    {
      "entity_1": "muggleborn registration commission",
      "entity_2": "bernie pillsworth",
      "relationship_type": "employs",
      "description": "The Muggleborn Registration Commission sent Bernie Pillsworth to get something, indicating that the commission employs people like Bernie Pillsworth."
    },
    {
      "entity_1": "percy weasley",
      "entity_2": "mr weasley",
      "relationship_type": "related_to",
      "description": "Percy Weasley strode into the lift and realized he was in a lift with his father, indicating a family connection between Percy Weasley and Mr. Weasley."
    }
  ]
}