{
  "entities": [
    {
      "name": "kendra",
      "entity_type": "person",
      "singular": true,
      "description": "Kendra is mentioned as the mother of Ariana and the one who made a decision to hide her daughter's existence. She is described as someone who would suffer shame if she admitted that she had produced a Squib."
    },
    {
      "name": "ariana",
      "entity_type": "person",
      "singular": true,
      "description": "Ariana is mentioned as Kendra's daughter who was hidden by her mother. It is stated that Ariana vanished from sight when she was seven years old and nobody remembers her demonstrating any magical ability."
    },
    {
      "name": "godric’s hollow",
      "entity_type": "location",
      "singular": true,
      "description": "Godric's Hollow is mentioned as the place where Kendra moved with Ariana. It seems that this move was a deliberate attempt to hide Ariana from others."
    },
    {
      "name": "squib",
      "entity_type": "term",
      "singular": true,
      "description": "Squib is mentioned as a term used to describe someone who does not have magical ability. Kendra's decision to hide Ariana was motivated by the fact that she had produced a Squib."
    },
    {
      "name": "godric’s hollow friends and neighbors",
      "entity_type": "group",
      "singular": false,
      "description": "Godric's Hollow friends and neighbors are mentioned as people who knew Ariana before Kendra moved her away. They would have been able to keep the secret of Ariana's existence."
    },
    {
      "name": "ariana’s two brothers",
      "entity_type": "group",
      "singular": false,
      "description": "Ariana's two brothers are mentioned as people who knew about Ariana's existence and could be counted upon to keep the secret."
    }
  ],
  "relationships": [
    {
      "entity_1": "kendra",
      "entity_2": "ariana",
      "relationship_type": "parent_child",
      "description": "Kendra is described as Ariana's mother, indicating a parent-child relationship between them."
    },
    {
      "entity_1": "kendra",
      "entity_2": "godric’s hollow",
      "relationship_type": "residence",
      "description": "It is stated that Kendra moved to Godric's Hollow with Ariana, indicating a residence relationship between Kendra and the location."
    },
    {
      "entity_1": "ariana",
      "entity_2": "squib",
      "relationship_type": "is_a",
      "description": "Ariana is described as a Squib, indicating that she does not have magical ability. This suggests an 'is-a' relationship between Ariana and the term Squib."
    },
    {
      "entity_1": "kendra",
      "entity_2": "godric’s hollow friends and neighbors",
      "relationship_type": "separation",
      "description": "Kendra moved to Godric's Hollow with Ariana, which implies a separation from her previous friends and neighbors who knew about Ariana."
    },
    {
      "entity_1": "kendra",
      "entity_2": "ariana’s two brothers",
      "relationship_type": "trust",
      "description": "It is stated that Kendra could count on Ariana's two brothers to keep the secret of her existence, indicating a trust relationship between them."
    }
  ]
}