{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as one of the individuals with a price on their head and walking into Hogwarts is dangerous. (\"there was a ten-thousand-Galleon price on his head, and that to walk into the Ministry of Magic.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as one of the individuals with a price on their head and walking into Hogwarts is dangerous. (\"there was a ten-thousand-Galleon price on his head, and that to walk into the Ministry of Magic.\")"
    },
    {
      "name": "phineas nigellus",
      "entity_type": "person",
      "singular": true,
      "description": "Phineas Nigellus is mentioned as someone who inadvertently emphasized the danger of walking into Hogwarts by slipping in leading questions about Harry and Hermione's whereabouts. (\"Indeed, Phineas Nigellus inadvertently emphasized this fact by slipping in leading questions about Harry and Hermione’s whereabouts.\")"
    },
    {
      "name": "hogwarts",
      "entity_type": "location",
      "singular": true,
      "description": "Hogwarts is mentioned as a place that is dangerous to walk into. (\"to walk into Hogwarts these days was just as dangerous as walking into the Ministry of Magic.\")"
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is mentioned as a place that is dangerous to walk into. (\"to walk into Hogwarts these days was just as dangerous as walking into the Ministry of Magic.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "phineas nigellus",
      "entity_2": "harry",
      "relationship_type": "asked_about",
      "description": "Phineas Nigellus asked about Harry's whereabouts. (\"Indeed, Phineas Nigellus inadvertently emphasized this fact by slipping in leading questions about Harry and Hermione’s whereabouts.\")"
    },
    {
      "entity_1": "phineas nigellus",
      "entity_2": "hermione",
      "relationship_type": "asked_about",
      "description": "Phineas Nigellus asked about Hermione's whereabouts. (\"Indeed, Phineas Nigellus inadvertently emphasized this fact by slipping in leading questions about Harry and Hermione’s whereabouts.\")"
    }
  ]
}