{
  "entities": [
    {
      "name": "lavender brown",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender Brown is introduced as a character who has been present in the scene, but Harry had not noticed her until now. She is described as supplying information to Harry."
    },
    {
      "name": "patil twins",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "The Patil twins are mentioned as being present in the scene, along with other familiar faces. They are not given individual names or descriptions."
    },
    {
      "name": "terry boot",
      "entity_type": "person",
      "singular": true,
      "description": "Terry Boot is introduced as a character who is part of the group of people present in the scene, along with other familiar faces."
    },
    {
      "name": "ernie macmillan",
      "entity_type": "person",
      "singular": true,
      "description": "Ernie Macmillan is mentioned as being part of the group of people present in the scene, and is quoted as asking Harry about his activities."
    },
    {
      "name": "anthony goldstein",
      "entity_type": "person",
      "singular": true,
      "description": "Anthony Goldstein is introduced as a character who is part of the group of people present in the scene, along with other familiar faces."
    },
    {
      "name": "michael corner",
      "entity_type": "person",
      "singular": true,
      "description": "Michael Corner is mentioned as being part of the group of people present in the scene, along with other familiar faces."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is quoted as confirming that Harry and his friends did break into Gringotts, and that the dragon's story is true."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "lavender brown",
      "relationship_type": "met",
      "description": "Harry had not noticed Lavender Brown until now, but he recognizes her as a familiar face. This suggests that Harry and Lavender have met before."
    },
    {
      "entity_1": "harry",
      "entity_2": "patil twins",
      "relationship_type": "met",
      "description": "The Patil twins are mentioned as being present in the scene, along with other familiar faces. This suggests that Harry has met them before."
    },
    {
      "entity_1": "harry",
      "entity_2": "terry boot",
      "relationship_type": "met",
      "description": "Terry Boot is introduced as a character who is part of the group of people present in the scene, along with other familiar faces. This suggests that Harry has met him before."
    },
    {
      "entity_1": "harry",
      "entity_2": "ernie macmillan",
      "relationship_type": "met",
      "description": "Ernie Macmillan is mentioned as being part of the group of people present in the scene, and is quoted as asking Harry about his activities. This suggests that Harry has met him before."
    },
    {
      "entity_1": "harry",
      "entity_2": "anthony goldstein",
      "relationship_type": "met",
      "description": "Anthony Goldstein is introduced as a character who is part of the group of people present in the scene, along with other familiar faces. This suggests that Harry has met him before."
    },
    {
      "entity_1": "harry",
      "entity_2": "michael corner",
      "relationship_type": "met",
      "description": "Michael Corner is mentioned as being part of the group of people present in the scene, along with other familiar faces. This suggests that Harry has met him before."
    },
    {
      "entity_1": "harry",
      "entity_2": "neville",
      "relationship_type": "spoke_to",
      "description": "Neville is quoted as confirming that Harry and his friends did break into Gringotts, and that the dragon's story is true. This suggests that Harry spoke to Neville about this."
    }
  ]
}