{
  "entities": [
    {
      "name": "goblins",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "Goblins are mentioned as having been treated brutally in the past by wizards, and they have a history of violence against humans. They are described as not being 'ﬂuﬀy little bunnies'."
    },
    {
      "name": "wizards",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "Wizards are mentioned as having treated goblins brutally in the past, and they have a history of violence against goblins."
    },
    {
      "name": "griphook",
      "entity_type": "person",
      "singular": true,
      "description": "Griphook is a specific goblin who is mentioned as being involved in an argument with Ron about whose race is most under-handed and violent. He is described as someone they need to convince to help them."
    },
    {
      "name": "dobby",
      "entity_type": "person",
      "singular": true,
      "description": "Dobby's grave is mentioned, indicating that he has passed away. Luna is seen arranging sea lavender beside his headstone."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as being involved in an argument with Griphook about whose race is most under-handed and violent."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as explaining to Ron why goblins have a reason to dislike wizards, citing their brutal treatment in the past."
    },
    {
      "name": "luna",
      "entity_type": "person",
      "singular": true,
      "description": "Luna is seen arranging sea lavender beside Dobby's headstone, indicating that she is paying her respects to him."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as looking out of the window at Dobby's grave, indicating that he is also paying his respects to him."
    }
  ],
  "relationships": [
    {
      "entity_1": "goblins",
      "entity_2": "wizards",
      "relationship_type": "have_conflict_with",
      "description": "Goblins and wizards have a history of conflict, with goblins being treated brutally in the past by wizards."
    },
    {
      "entity_1": "ron",
      "entity_2": "griphook",
      "relationship_type": "argue_with",
      "description": "Ron is arguing with Griphook about whose race is most under-handed and violent."
    }
  ]
}