{
  "entities": [
    {
      "name": "phineas nigellus",
      "entity_type": "person",
      "singular": true,
      "description": "Phineas Nigellus is a portrait of a person who can move between two locations, Grimmauld Place and Hogwarts. He is mentioned as being able to be sent by Snape to look inside the house."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is a person who is currently sitting in the headmaster's office at Hogwarts, possessing Dumbledore's collection of magical instruments. He has the ability to send Phineas Nigellus to look inside the house."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is a person whose collection of magical instruments, including the stone Pensieve and the Sorting Hat, are being possessed by Snape in his office at Hogwarts."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who explains to Ron that Snape could send Phineas Nigellus to look inside the house, but she has thought of a way to prevent this."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person who listens to Hermione's explanation and is impressed by her thinking."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who understands what Hermione is explaining and is the subject of their conversation about what else happened today."
    }
  ],
  "relationships": [
    {
      "entity_1": "snape",
      "entity_2": "phineas nigellus",
      "relationship_type": "can_send",
      "description": "Snape has the ability to send Phineas Nigellus to look inside the house."
    },
    {
      "entity_1": "hermione",
      "entity_2": "handbag",
      "relationship_type": "owns",
      "description": "Hermione owns a handbag that she uses to prevent Snape from sending Phineas Nigellus to look inside the house."
    }
  ]
}