{
  "entities": [
    {
      "name": "mulciber",
      "entity_type": "person",
      "singular": true,
      "description": "Mulciber is mentioned as one of the people who insulted James Potter. The text does not provide further information about Mulciber."
    },
    {
      "name": "avery",
      "entity_type": "person",
      "singular": true,
      "description": "Avery is mentioned as one of the people who insulted James Potter. The text does not provide further information about Avery."
    },
    {
      "name": "james potter",
      "entity_type": "person",
      "singular": true,
      "description": "James Potter is a main character in the story and is mentioned as being insulted by Mulciber and Avery. He is also mentioned as having hoisted Severus into the air and taunted him."
    },
    {
      "name": "severus snape",
      "entity_type": "person",
      "singular": true,
      "description": "Severus Snape is a main character in the story and is mentioned as being insulted by James Potter. He is also mentioned as shouting at Lily in his humiliation and fury."
    },
    {
      "name": "avery (again)",
      "entity_type": "person",
      "singular": true,
      "description": "Avery is mentioned again in the story, this time as one of the people who insulted James Potter. The text does not provide further information about Avery."
    },
    {
      "name": "lily",
      "entity_type": "person",
      "singular": true,
      "description": "Lily is a main character in the story and is mentioned as joining the group and going to Snape's defense. She is also mentioned as being shouted at by Snape."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is a main character in the story and is mentioned as sitting together with James, Lupin, and Pettigrew beneath the beech tree."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is a main character in the story and is mentioned as sitting together with James, Sirius, and Pettigrew beneath the beech tree."
    },
    {
      "name": "pettigrew",
      "entity_type": "person",
      "singular": true,
      "description": "Pettigrew is a main character in the story and is mentioned as sitting together with James, Sirius, and Lupin beneath the beech tree."
    }
  ],
  "relationships": [
    {
      "entity_1": "james potter",
      "entity_2": "severus snape",
      "relationship_type": "insulted",
      "description": "James Potter was insulted by Severus Snape. The text describes the scene where James and his friends were insulting Severus, and how Severus was humiliated and furious."
    },
    {
      "entity_1": "severus snape",
      "entity_2": "lily",
      "relationship_type": "shouted_at",
      "description": "Severus Snape shouted at Lily in his humiliation and fury. The text describes the scene where Severus was shouting at Lily, using the unforgivable word 'Mudblood'."
    },
    {
      "entity_1": "james potter",
      "entity_2": "avery",
      "relationship_type": "insulted",
      "description": "James Potter was insulted by Avery. The text describes the scene where James and his friends were insulting Severus, and how Avery was one of those who insulted him."
    },
    {
      "entity_1": "james potter",
      "entity_2": "mulciber",
      "relationship_type": "insulted",
      "description": "James Potter was insulted by Mulciber. The text describes the scene where James and his friends were insulting Severus, and how Mulciber was one of those who insulted him."
    },
    {
      "entity_1": "severus snape",
      "entity_2": "avery",
      "relationship_type": "insulted_by",
      "description": "Severus Snape was insulted by Avery. The text describes the scene where James and his friends were insulting Severus, and how Avery was one of those who insulted him."
    },
    {
      "entity_1": "severus snape",
      "entity_2": "mulciber",
      "relationship_type": "insulted_by",
      "description": "Severus Snape was insulted by Mulciber. The text describes the scene where James and his friends were insulting Severus, and how Mulciber was one of those who insulted him."
    }
  ]
}