{
  "entities": [
    {
      "name": "Scrimgeour",
      "entity_type": "person",
      "singular": true,
      "description": "The Minister who is questioning Harry, Ron, and Hermione. He is described as giving a cold, appraising look to Harry."
    },
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "One of the three students being questioned by Scrimgeour. He is described as speaking up against Scrimgeour's plan to question them individually."
    },
    {
      "name": "Ron",
      "entity_type": "person",
      "singular": true,
      "description": "One of the three students being questioned by Scrimgeour. He is described as not aware that Dumbledore had left him anything in his will."
    },
    {
      "name": "Hermione",
      "entity_type": "person",
      "singular": true,
      "description": "One of the three students being questioned by Scrimgeour. She is described as nodding vigorously against Scrimgeour's plan to question them individually."
    }
  ],
  "relationships": [
    {
      "entity_1": "Scrimgeour",
      "entity_2": "Harry",
      "relationship_type": "questioning",
      "description": "Scrimgeour is questioning Harry, as evident from the conversation where Scrimgeour asks Harry questions."
    },
    {
      "entity_1": "Scrimgeour",
      "entity_2": "Ron",
      "relationship_type": "questioning",
      "description": "Scrimgeour is also questioning Ron, as mentioned in the text where Scrimgeour points at Ron and says 'I will start with Ronald'."
    },
    {
      "entity_1": "Scrimgeour",
      "entity_2": "Hermione",
      "relationship_type": "questioning",
      "description": "Scrimgeour is questioning Hermione, as evident from the conversation where Scrimgeour asks her questions."
    },
    {
      "entity_1": "Harry",
      "entity_2": "Scrimgeour",
      "relationship_type": "being_questioned_by",
      "description": "Harry is being questioned by Scrimgeour, as mentioned in the text where Harry speaks up against Scrimgeour's plan to question them individually."
    },
    {
      "entity_1": "Ron",
      "entity_2": "Scrimgeour",
      "relationship_type": "being_questioned_by",
      "description": "Ron is being questioned by Scrimgeour, as mentioned in the text where Ron asks if he and Hermione were also left something in Dumbledore's will."
    },
    {
      "entity_1": "Hermione",
      "entity_2": "Scrimgeour",
      "relationship_type": "being_questioned_by",
      "description": "Hermione is being questioned by Scrimgeour, as evident from the conversation where Scrimgeour asks her questions."
    }
  ]
}