{
  "entities": [
    {
      "name": "hallway",
      "entity_type": "location",
      "singular": true,
      "description": "The hallway is described as eerie and cobwebbed with the outlines of house-elf heads on the wall throwing odd shadows up the staircase. It looked just as Harry remembered it."
    },
    {
      "name": "house-elf",
      "entity_type": "species",
      "singular": true,
      "description": "The house-elf heads are mentioned on the wall in the hallway, throwing odd shadows up the staircase."
    },
    {
      "name": "Sirius's mother",
      "entity_type": "person",
      "singular": true,
      "description": "The portrait of Sirius's mother is concealed by long dark curtains in the hallway."
    },
    {
      "name": "troll",
      "entity_type": "species",
      "singular": true,
      "description": "A troll's leg umbrella stand is mentioned as being out of place in the hallway."
    },
    {
      "name": "Tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is mentioned as possibly knocking over the troll's leg umbrella stand."
    },
    {
      "name": "Hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione whispers to Ron, pointing toward the troll's leg umbrella stand."
    },
    {
      "name": "Ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron murmurs back to Hermione, suggesting that the jinxes might only be activated if Snape shows up."
    },
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry asks about the jinxes and takes a step forward into the house."
    },
    {
      "name": "Snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as possibly being in the house, with jinxes put up against him."
    },
    {
      "name": "Mad-Eye Moody",
      "entity_type": "person",
      "singular": true,
      "description": "Mad-Eye Moody's voice whispers out of the darkness, making Harry and his friends jump back in fright."
    }
  ],
  "relationships": [
    {
      "entity_1": "Harry",
      "entity_2": "hallway",
      "relationship_type": "visited",
      "description": "The hallway is described as looking just as Harry remembered it, indicating that he has visited the hallway before."
    },
    {
      "entity_1": "Tonks",
      "entity_2": "troll's leg umbrella stand",
      "relationship_type": "knocked_over",
      "description": "Tonks is mentioned as possibly knocking over the troll's leg umbrella stand, indicating a relationship between Tonks and the umbrella stand."
    },
    {
      "entity_1": "Hermione",
      "entity_2": "troll's leg umbrella stand",
      "relationship_type": "pointed_at",
      "description": "Hermione whispers to Ron, pointing toward the troll's leg umbrella stand, indicating a relationship between Hermione and the umbrella stand."
    },
    {
      "entity_1": "Ron",
      "entity_2": "troll's leg umbrella stand",
      "relationship_type": "suggested_activation",
      "description": "Ron suggests that the jinxes might only be activated if Snape shows up, indicating a relationship between Ron and the umbrella stand."
    },
    {
      "entity_1": "Harry",
      "entity_2": "Snape",
      "relationship_type": "concerned_about",
      "description": "Harry asks about the jinxes put up against Snape, indicating that he is concerned about Snape's presence in the house."
    },
    {
      "entity_1": "Mad-Eye Moody",
      "entity_2": "Harry and friends",
      "relationship_type": "scared",
      "description": "Mad-Eye Moody's voice whispers out of the darkness, making Harry and his friends jump back in fright, indicating that Mad-Eye Moody is scared of them."
    }
  ]
}