{
  "entities": [
    {
      "name": "kendra dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Kendra Dumbledore is mentioned as the wife of Percival and she decided to uproot the family and relocate to Godric's Hollow. She was known for being proud and haughty."
    },
    {
      "name": "percival dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Percival Dumbledore is mentioned as Kendra's husband who was arrested and imprisoned in Azkaban."
    },
    {
      "name": "godric's hollow",
      "entity_type": "location",
      "singular": true,
      "description": "Godric's Hollow is a village where Kendra decided to relocate her family. It later gained fame as the scene of Harry Potter's strange escape from You-Know-Who."
    },
    {
      "name": "mould-on-the-wold",
      "entity_type": "location",
      "singular": true,
      "description": "Mould-on-the-Wold is a village where Kendra and her family previously lived. It was similar to Godric's Hollow in having Wizarding families."
    },
    {
      "name": "azkaban",
      "entity_type": "location",
      "singular": true,
      "description": "Azkaban is a prison where Percival Dumbledore was imprisoned after his arrest."
    },
    {
      "name": "bathilda bagshot",
      "entity_type": "person",
      "singular": true,
      "description": "Bathilda Bagshot is mentioned as someone who tried to welcome Kendra with homemade Cauldron Cakes but was rebuffed."
    }
  ],
  "relationships": [
    {
      "entity_1": "kendra dumbledore",
      "entity_2": "percival dumbledore",
      "relationship_type": "spouse",
      "description": "Kendra and Percival are mentioned as husband and wife. Kendra's decision to relocate was likely influenced by her husband's imprisonment in Azkaban."
    },
    {
      "entity_1": "kendra dumbledore",
      "entity_2": "godric's hollow",
      "relationship_type": "residence",
      "description": "Kendra decided to uproot the family and relocate to Godric's Hollow after her husband's arrest."
    },
    {
      "entity_1": "bathilda bagshot",
      "entity_2": "kendra dumbledore",
      "relationship_type": "attempted_friendship",
      "description": "Bathilda Bagshot tried to welcome Kendra with homemade Cauldron Cakes but was rebuffed by Kendra."
    }
  ]
}