{
  "entities": [
    {
      "name": "gringotts",
      "entity_type": "location",
      "singular": true,
      "description": "Gringotts is a location where Harry discovered that the sword was fake. (\"For the ﬁrst time since he had discovered that the sword in Gringotts was a fake, he felt excited.\")"
    },
    {
      "name": "godric's hollow",
      "entity_type": "location",
      "singular": true,
      "description": "Godric's Hollow is a place where Harry would have grown up and spent his school holidays. (\"It was in Godric’s Hollow that, but for Voldemort, he would have grown up and spent every school holiday.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who is reflecting on his past life. (\"He was about to go home, about to return to the place where he had had a family.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is Harry's friend who has gone to bed. (\"After Hermione had gone to bed that night, Harry quietly extracted his rucksack from Hermione’s beaded bag.\")"
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is the person who gave Harry a photograph album. (\"For the ﬁrst time in months, he pursued the old pictures of his parents, smiling and waving up at him from the images, which were all he had left of them now.\")"
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is a person who prevented Harry from growing up in Godric's Hollow. (\"It was in Godric’s Hollow that, but for Voldemort, he would have grown up and spent every school holiday.\")"
    },
    {
      "name": "harry's parents",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "Harry's parents are people who made his life happy. (\"The life he had lost had hardly ever seemed so real to him as at this moment, when he knew he was about to see the place were it had been taken from him.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "gringotts",
      "relationship_type": "visited",
      "description": "Harry visited Gringotts where he discovered that the sword was fake. (\"For the ﬁrst time since he had discovered that the sword in Gringotts was a fake, he felt excited.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "godric's hollow",
      "relationship_type": "would_have_lived",
      "description": "Harry would have lived in Godric's Hollow if Voldemort hadn't prevented him. (\"It was in Godric’s Hollow that, but for Voldemort, he would have grown up and spent every school holiday.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friend",
      "description": "Harry is friends with Hermione. (\"After Hermione had gone to bed that night, Harry quietly extracted his rucksack from Hermione’s beaded bag.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "hagrid",
      "relationship_type": "received_gift_from",
      "description": "Harry received a photograph album from Hagrid. (\"For the ﬁrst time in months, he pursued the old pictures of his parents, smiling and waving up at him from the images, which were all he had left of them now.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "voldemort",
      "relationship_type": "was_prevented_by",
      "description": "Voldemort prevented Harry from living in Godric's Hollow. (\"It was in Godric’s Hollow that, but for Voldemort, he would have grown up and spent every school holiday.\")"
    }
  ]
}