{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as speaking and having a plan to double-cross Griphook."
    },
    {
      "name": "griphook",
      "entity_type": "goblin",
      "singular": true,
      "description": "Griphook is mentioned as being on the watch for possible skulduggery."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as disapproving of the planned double-cross."
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill's warning is mentioned as being in mind for Harry."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character and has a plan to double-cross Griphook."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "griphook",
      "relationship_type": "watching",
      "description": "Ron is watching Griphook, as mentioned in the text: 'With Bill’s warning in mind, Harry could not help suspecting that Griphook was on the watch for possible skulduggery.'"
    },
    {
      "entity_1": "harry",
      "entity_2": "griphook",
      "relationship_type": "watching",
      "description": "Harry is watching Griphook, as mentioned in the text: 'With Bill’s warning in mind, Harry could not help suspecting that Griphook was on the watch for possible skulduggery.'"
    },
    {
      "entity_1": "hermione",
      "entity_2": "harry",
      "relationship_type": "disapproving",
      "description": "Hermione is disapproving of Harry's plan to double-cross Griphook, as mentioned in the text: 'Hermione disapproved so heartily of the planned double-cross that Harry had given up attempting to pick her brains on how best to do it:'"
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "planning",
      "description": "Ron and Harry are planning to double-cross Griphook, as mentioned in the text: 'Ron, on the rare occasions that they had been able to snatch a few Griphook-free moments, had come up with nothing better than “We’ll just have to wing it, mate.”'"
    }
  ]
}