{
  "entities": [
    {
      "name": "grindelwald",
      "entity_type": "person",
      "singular": true,
      "description": "Grindelwald is mentioned as the possible owner of a triangular, runelike shape. The text states \"Are you — er — quite sure it’s Grindelwald’s — ?\""
    },
    {
      "name": "krum",
      "entity_type": "person",
      "singular": true,
      "description": "Krum is mentioned as someone who has walked past the sign for several years and knows what it means. The text states \"I am not mistaken,\" said Krum coldly. \"I valked past that sign for several years, I know it vell.\""
    },
    {
      "name": "xenophilius",
      "entity_type": "person",
      "singular": true,
      "description": "Xenophilius is mentioned as someone who may not actually know what the symbol means. The text states \"Well, there’s a chance,\" said Harry, \"that Xenophilius doesn’t actually know what the symbol means.\""
    },
    {
      "name": "crumple-horned-snorkack",
      "entity_type": "creature",
      "singular": true,
      "description": "The Crumple-Horned Snorkack is mentioned as a possible explanation for the symbol. The text states \"He could easily have picked it up somewhere and think it’s a cross section of the head of a Crumple-Horned Snorkack or something.\""
    },
    {
      "name": "lovegood",
      "entity_type": "family",
      "singular": false,
      "description": "The Lovegoods are mentioned as being unusual. The text states \"The Lovegoods are quite . . . unusual.\""
    }
  ],
  "relationships": [
    {
      "entity_1": "krum",
      "entity_2": "grindelwald",
      "relationship_type": "ownership",
      "description": "Krum knows what the symbol means and implies that Grindelwald is its owner. The text states \"I am not mistaken,\" said Krum coldly. \"I valked past that sign for several years, I know it vell.\""
    },
    {
      "entity_1": "xenophilius",
      "entity_2": "crumple-horned-snorkack",
      "relationship_type": "possible association",
      "description": "Xenophilius may not actually know what the symbol means and Harry suggests that he may have picked it up somewhere, possibly thinking it's a cross section of the head of a Crumple-Horned Snorkack. The text states \"Well, there’s a chance,\" said Harry, \"that Xenophilius doesn’t actually know what the symbol means.\""
    }
  ]
}