{
  "entities": [
    {
      "name": "quidditch",
      "entity_type": "sports_team",
      "singular": true,
      "description": "Quidditch is mentioned as something the speaker thinks the other person has to do with. The text states \"he's got something to do with Quidditch\"."
    },
    {
      "name": "gorgovitch",
      "entity_type": "person",
      "singular": true,
      "description": "Dragomir Gorgovitch is mentioned as a Chaser who was transferred to the Chudley Cannons for a record fee. The text states \"Sure you're not thinking of Gorgovitch?\""
    },
    {
      "name": "dragomir gorgovitch",
      "entity_type": "person",
      "singular": true,
      "description": "Dragomir Gorgovitch is mentioned as a Chaser who was transferred to the Chudley Cannons for a record fee. The text states \"Sure you're not thinking of Gorgovitch?\""
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned in the conversation as suggesting that the speaker might be thinking of Gorgovitch instead of Quidditch. The text states \"Quidditch? Sure you're not thinking of Gorgovitch?\""
    },
    {
      "name": "chudley cannons",
      "entity_type": "sports_team",
      "singular": true,
      "description": "The Chudley Cannons are mentioned as the team that Dragomir Gorgovitch was transferred to for a record fee. The text states \"transferred to the Chudley Cannons for a record fee two years ago\""
    },
    {
      "name": "quaﬄe 112",
      "entity_type": "sports_equipment",
      "singular": true,
      "description": "Quaﬄe 112 is mentioned as something that Dragomir Gorgovitch holds the record for. The text states \"Record holder for most Quaﬄe 112\""
    }
  ],
  "relationships": [
    {
      "entity_1": "quidditch",
      "entity_2": "gorgovitch",
      "relationship_type": "connection",
      "description": "The speaker thinks there is a connection between Quidditch and Gorgovitch. The text states \"There’s some connection, but I can’t — I can’t think what it is.\""
    },
    {
      "entity_1": "ron",
      "entity_2": "gorgovitch",
      "relationship_type": "suggestion",
      "description": "Ron suggests that the speaker might be thinking of Gorgovitch instead of Quidditch. The text states \"Sure you're not thinking of Gorgovitch?\""
    },
    {
      "entity_1": "dragomir gorgovitch",
      "entity_2": "chudley cannons",
      "relationship_type": "transfer",
      "description": "Dragomir Gorgovitch was transferred to the Chudley Cannons for a record fee. The text states \"transferred to the Chudley Cannons for a record fee two years ago\""
    },
    {
      "entity_1": "dragomir gorgovitch",
      "entity_2": "quaﬄe 112",
      "relationship_type": "record_holder",
      "description": "Dragomir Gorgovitch holds the record for most Quaﬄe 112. The text states \"Record holder for most Quaﬄe 112\""
    }
  ]
}