{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a person who yells at Fang to calm down. He chases after the boarhound when it takes flight."
    },
    {
      "name": "fang",
      "entity_type": "animal",
      "singular": true,
      "description": "Fang is a great boarhound that takes flight and causes chaos in the castle."
    },
    {
      "name": "sir cadogan",
      "entity_type": "knight",
      "singular": true,
      "description": "Sir Cadogan is a little painted knight who rushes from painting to painting, clanking along in his armor and screaming encouragement to Harry Potter."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is one of the students standing beside an empty plinth with a secret passageway. He shouts at Harry that it's a nice night for their activities."
    },
    {
      "name": "lee jordan",
      "entity_type": "person",
      "singular": true,
      "description": "Lee Jordan is one of the students standing beside an empty plinth with a secret passageway."
    },
    {
      "name": "hannah abbott",
      "entity_type": "person",
      "singular": true,
      "description": "Hannah Abbott is one of the students standing beside an empty plinth with a secret passageway."
    },
    {
      "name": "the order",
      "entity_type": "group",
      "singular": false,
      "description": "The Order is mentioned as something that teachers are part of, but it's not clear what this refers to in the context of the story."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "fang",
      "relationship_type": "chases_after",
      "description": "Hagrid chases after Fang when it takes flight and causes chaos in the castle."
    },
    {
      "entity_1": "sir cadogan",
      "entity_2": "harry potter",
      "relationship_type": "accompanies",
      "description": "Sir Cadogan rushes from painting to painting beside Harry Potter, clanking along in his armor and screaming encouragement."
    },
    {
      "entity_1": "fred",
      "entity_2": "lee jordan",
      "relationship_type": "stands_with",
      "description": "Fred stands beside Lee Jordan and other students near an empty plinth with a secret passageway."
    },
    {
      "entity_1": "fred",
      "entity_2": "hannah abbott",
      "relationship_type": "stands_with",
      "description": "Fred stands beside Hannah Abbott and other students near an empty plinth with a secret passageway."
    }
  ]
}