{
  "entities": [
    {
      "name": "tufty-haired wizard",
      "entity_type": "character",
      "singular": true,
      "description": "The tufty-haired wizard is introduced as a character who waves his wand to create magical effects. He is described as having 'tufted' hair, suggesting that he has a distinctive hairstyle."
    },
    {
      "name": "bill",
      "entity_type": "character",
      "singular": true,
      "description": "Bill is introduced as one of the characters who receives a shower of silver stars from the wizard's wand. He is not described in detail, but his presence is noted along with Fleur."
    },
    {
      "name": "fleur",
      "entity_type": "character",
      "singular": true,
      "description": "Fleur is introduced as one of the characters who receives a shower of silver stars from the wizard's wand. She is not described in detail, but her presence is noted along with Bill."
    },
    {
      "name": "fred",
      "entity_type": "character",
      "singular": true,
      "description": "Fred is introduced as one of the characters who leads a round of applause after the wizard's wand creates a magical effect. He is not described in detail, but his presence is noted along with George."
    },
    {
      "name": "george",
      "entity_type": "character",
      "singular": true,
      "description": "George is introduced as one of the characters who leads a round of applause after the wizard's wand creates a magical effect. He is not described in detail, but his presence is noted along with Fred."
    },
    {
      "name": "auntie muriel",
      "entity_type": "character",
      "singular": true,
      "description": "Auntie Muriel is introduced as one of the characters who stands up when the wizard asks them to. She is described as grumbling audibly, suggesting that she may be resistant to the magical effects."
    },
    {
      "name": "marquee",
      "entity_type": "location",
      "singular": true,
      "description": "The marquee is introduced as a location where the characters are sitting. It is described as having canvas walls and seats, which rise into the air when the wizard waves his wand."
    },
    {
      "name": "orchard",
      "entity_type": "location",
      "singular": true,
      "description": "The orchard is introduced as a location that can be seen from beneath the canopy supported by golden poles. It is described as sunlit, suggesting that it is a pleasant and idyllic setting."
    },
    {
      "name": "countryside",
      "entity_type": "location",
      "singular": true,
      "description": "The countryside is introduced as a location that can be seen from beneath the canopy supported by golden poles. It is not described in detail, but its presence is noted along with the orchard."
    },
    {
      "name": "golden poles",
      "entity_type": "object",
      "singular": true,
      "description": "The golden poles are introduced as objects that support a canopy beneath which the characters stand. They are described as being made of gold, suggesting that they are decorative and ornate."
    },
    {
      "name": "golden balloons",
      "entity_type": "object",
      "singular": true,
      "description": "The golden balloons are introduced as objects that burst to release birds of paradise and tiny golden bells. They are described as being made of gold, suggesting that they are decorative and ornate."
    },
    {
      "name": "birds of paradise",
      "entity_type": "object",
      "singular": true,
      "description": "The birds of paradise are introduced as objects that fly out of the golden balloons. They are described as singing, suggesting that they have a musical quality."
    },
    {
      "name": "tiny golden bells",
      "entity_type": "object",
      "singular": true,
      "description": "The tiny golden bells are introduced as objects that fly out of the golden balloons. They are described as chiming, suggesting that they have a musical quality."
    }
  ],
  "relationships": [
    {
      "entity_1": "tufty-haired wizard",
      "entity_2": "bill",
      "relationship_type": "affects",
      "description": "The tufty-haired wizard waves his wand to create a shower of silver stars that falls upon Bill."
    },
    {
      "entity_1": "tufty-haired wizard",
      "entity_2": "fleur",
      "relationship_type": "affects",
      "description": "The tufty-haired wizard waves his wand to create a shower of silver stars that falls upon Fleur."
    },
    {
      "entity_1": "tufty-haired wizard",
      "entity_2": "fred",
      "relationship_type": "influences",
      "description": "The tufty-haired wizard's magical effect inspires Fred and George to lead a round of applause."
    },
    {
      "entity_1": "tufty-haired wizard",
      "entity_2": "george",
      "relationship_type": "influences",
      "description": "The tufty-haired wizard's magical effect inspires Fred and George to lead a round of applause."
    },
    {
      "entity_1": "tufty-haired wizard",
      "entity_2": "auntie muriel",
      "relationship_type": "influences",
      "description": "The tufty-haired wizard asks Auntie Muriel and the other characters to stand up, which they do."
    },
    {
      "entity_1": "tufty-haired wizard",
      "entity_2": "marquee",
      "relationship_type": "transforms",
      "description": "The tufty-haired wizard waves his wand to transform the marquee into a canopy supported by golden poles."
    }
  ]
}