{
  "entities": [
    {
      "name": "dark lord",
      "entity_type": "character",
      "singular": true,
      "description": "The Dark Lord is mentioned as a powerful figure who has been sought after by the characters. (\"the Dark Lord going to say?\", \"the Dark Lord gets hold of her\")"
    },
    {
      "name": "alecto",
      "entity_type": "character",
      "singular": true,
      "description": "Alecto is Professor McGonagall's sister, who has been Stunned. (\"standing over his sister and smacking himself on the forehead with his fist\", \"She'll be perfectly all right\")"
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "character",
      "singular": true,
      "description": "Professor McGonagall is a wise and experienced teacher who has examined Alecto. (\"said Professor McGonagall impatiently\", \"Why would Harry Potter try to get inside Ravenclaw Tower?\""
    },
    {
      "name": "amycus",
      "entity_type": "character",
      "singular": true,
      "description": "Amycus is Alecto's brother, who is angry and bellowing. (\"No she bludgering well won't!\", \"He told us Potter might try and get inside Ravenclaw Tower\")"
    },
    {
      "name": "harry potter",
      "entity_type": "character",
      "singular": true,
      "description": "Harry Potter is a student who has been mentioned as possibly trying to get into Ravenclaw Tower. (\"He told us Potter might try and get inside Ravenclaw Tower\", \"Potter belongs in my House\")"
    },
    {
      "name": "ravenclaw tower",
      "entity_type": "location",
      "singular": true,
      "description": "Ravenclaw Tower is a location where Harry Potter may be trying to get into. (\"Why would Harry Potter try to get inside Ravenclaw Tower?\", \"Potter belongs in my House\")"
    },
    {
      "name": "minerva mcgonagall",
      "entity_type": "character",
      "singular": true,
      "description": "Minerva McGonagall is Professor McGonagall's name, mentioned as a source of pride and affection for Harry. (\"Beneath the disbelief and anger, Harry heard a little strain of pride in her voice\")"
    },
    {
      "name": "carrow",
      "entity_type": "character",
      "singular": true,
      "description": "Carrow is mentioned as someone who has been told that Harry Potter might come into Ravenclaw Tower. (\"We was told he might come in here!\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "amycus",
      "entity_2": "dark lord",
      "relationship_type": "believes_in",
      "description": "Amycus believes that the Dark Lord will get hold of Alecto. (\"Not after the Dark Lord gets hold of her!\")"
    },
    {
      "entity_1": "amycus",
      "entity_2": "harry potter",
      "relationship_type": "believes_in",
      "description": "Amycus believes that Harry Potter has been sent for by the Dark Lord. (\"He told us Potter might try and get inside Ravenclaw Tower, and to send for him if we caught him!\")"
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "alecto",
      "relationship_type": "examines",
      "description": "Professor McGonagall has examined Alecto. (\"said Professor McGonagall impatiently, who had stooped down to examine Alecto\")"
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "harry potter",
      "relationship_type": "believes_in",
      "description": "Professor McGonagall believes that Harry Potter belongs in her House. (\"Potter belongs in my House\")"
    },
    {
      "entity_1": "carrow",
      "entity_2": "harry potter",
      "relationship_type": "believes_in",
      "description": "Carrow has been told that Harry Potter might come into Ravenclaw Tower. (\"We was told he might come in here!\")"
    }
  ]
}