{
  "entities": [
    {
      "name": "padfoot",
      "entity_type": "person",
      "singular": true,
      "description": "Padfoot is the recipient of the letter and is mentioned as someone who sent Harry a birthday present. The description mentions that Padfoot could not attend Harry's birthday due to the Order's priorities."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main subject of the letter and is described as being one year old and already showing interest in flying on a toy broomstick. The description mentions that Harry smashed a vase and nearly killed the cat while playing with his new toy."
    },
    {
      "name": "james",
      "entity_type": "person",
      "singular": true,
      "description": "James is mentioned as someone who finds Harry's behavior funny and thinks he will be a great Quidditch player. The description mentions that James is getting frustrated being shut up here."
    },
    {
      "name": "petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Petunia is mentioned as the one who sent a vase to the family for Christmas, which Harry smashed."
    },
    {
      "name": "bathilda",
      "entity_type": "person",
      "singular": true,
      "description": "Bathilda is mentioned as someone who has always been sweet to the family and dotes on Harry."
    },
    {
      "name": "the order",
      "entity_type": "organization",
      "singular": false,
      "description": "The Order is mentioned as a group that takes priority over attending Harry's birthday. The description mentions that the Order's priorities are why Padfoot could not attend."
    }
  ],
  "relationships": [
    {
      "entity_1": "padfoot",
      "entity_2": "harry",
      "relationship_type": "sent_gift",
      "description": "Padfoot sent a gift to Harry for his birthday, which is described as Harry's favorite present."
    },
    {
      "entity_1": "james",
      "entity_2": "harry",
      "relationship_type": "encourages_interest",
      "description": "James finds Harry's interest in flying on the toy broomstick funny and thinks he will be a great Quidditch player."
    }
  ]
}