{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who is about to tell Harry that she has had enough and is leaving. She is described as bringing out Phineas Nigellus's portrait to fill the gaping hole left by Ron's departure."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as having departed, leaving a gaping hole that Hermione tries to fill with Phineas Nigellus's portrait."
    },
    {
      "name": "phineas nigellus",
      "entity_type": "portrait",
      "singular": true,
      "description": "Phineas Nigellus is mentioned as a portrait that Hermione brings out and propps up in a chair. He reappears every few days to find out more about Harry's activities."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as the first Slytherin headmaster since Phineas Nigellus controlled the school. He is venerated by Phineas Nigellus."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who is being kept company by Phineas Nigellus's reappearances. He is glad to see Phineas Nigellus because he provides news about Hogwarts."
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "phineas nigellus",
      "relationship_type": "company",
      "description": "Hermione brings out Phineas Nigellus's portrait to keep Harry company, as he is glad to see him because he provides news about Hogwarts."
    },
    {
      "entity_1": "phineas nigellus",
      "entity_2": "snape",
      "relationship_type": "veneration",
      "description": "Phineas Nigellus venerated Snape, the first Slytherin headmaster since he controlled the school."
    },
    {
      "entity_1": "phineas nigellus",
      "entity_2": "harry",
      "relationship_type": "informant",
      "description": "Phineas Nigellus reappears every few days to find out more about Harry's activities and provide news about Hogwarts."
    }
  ]
}