{
  "entities": [
    {
      "name": "bellatrix",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix is described as looking down at Griphook and having a clear view of him. She is also mentioned as saying 'Well?' to Griphook, indicating that she is in charge."
    },
    {
      "name": "griphook",
      "entity_type": "person",
      "singular": true,
      "description": "Griphook is described as holding Gryﬃndor's sword and being questioned by Bellatrix. He is also mentioned as dropping with a yell at her feet after being slashed by her wand."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as lying at Bellatrix's feet and barely stirring. She is not mentioned as participating in the conversation or actions of the other characters."
    },
    {
      "name": "gryﬃndor's sword",
      "entity_type": "object",
      "singular": true,
      "description": "Gryﬃndor's sword is described as being held by Griphook and questioned by Bellatrix. It is also mentioned as a fake."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as waiting, holding his breath, and fighting against the prickling of his scar. He is not mentioned as participating in the conversation or actions of the other characters."
    },
    {
      "name": "the dark lord",
      "entity_type": "person",
      "singular": true,
      "description": "The Dark Lord is mentioned by Bellatrix as being called after Griphook's sword is confirmed to be fake. No further information about him is provided in the text."
    }
  ],
  "relationships": [
    {
      "entity_1": "bellatrix",
      "entity_2": "griphook",
      "relationship_type": "questioned_by",
      "description": "Bellatrix questions Griphook about Gryﬃndor's sword, indicating a relationship of questioning and answering."
    },
    {
      "entity_1": "bellatrix",
      "entity_2": "griphook",
      "relationship_type": "attacked_by",
      "description": "Bellatrix slashes Griphook with her wand, causing him to drop at her feet. This indicates a relationship of attack and defense."
    },
    {
      "entity_1": "bellatrix",
      "entity_2": "the dark lord",
      "relationship_type": "called_by",
      "description": "Bellatrix says 'And now, we call the Dark Lord!' after Griphook's sword is confirmed to be fake. This indicates a relationship of calling and being called."
    }
  ]
}