{
  "entities": [
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is introduced as the person leading the way. He is mentioned in the first sentence of the text."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as the person who has walked up several steps and is calling out to Ron and Hermione. He is mentioned in the second paragraph of the text."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is introduced as one of the people being called by Harry. He is mentioned in the second paragraph of the text."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is introduced as one of the people being called by Harry. She is also praised by Harry for coming up with a story to protect her from harm. She is mentioned in the second paragraph of the text."
    },
    {
      "name": "the wandmaker",
      "entity_type": "person",
      "singular": true,
      "description": "The Wandmaker is introduced as someone who was hurting Hermione, prompting Harry to come up with a story to protect her. He is mentioned in the second paragraph of the text."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "helped",
      "description": "Harry helped Hermione by coming up with a story to protect her from harm. This is mentioned in the second paragraph of the text."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "called",
      "description": "Harry called out to Ron, asking him and Hermione to join him. This is mentioned in the second paragraph of the text."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "praised",
      "description": "Harry praised Hermione for coming up with a story to protect her from harm. This is mentioned in the second paragraph of the text."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "comforted",
      "description": "Ron comforted Hermione by giving her a one-armed squeeze. This is mentioned in the second paragraph of the text."
    }
  ]
}