{
  "entities": [
    {
      "name": "bellatrix",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix is mentioned as the one who meant something, implying she has a certain level of importance or significance in the story. (\"I see what Bellatrix meant\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who understands what Bellatrix meant, implying he has a certain level of importance or significance in the story. (\"I see what Bellatrix meant\")"
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as being shocked and concerned about Harry's arrival, implying she has a certain level of importance or significance in the story. (\"Potter! Potter — you're here!\")"
    },
    {
      "name": "potter",
      "entity_type": "person",
      "singular": true,
      "description": "Potter is mentioned as being foolish and gallant, implying he has a certain level of importance or significance in the story. (\"Potter, that was foolish! Potter, I — that was very — very gallant of you\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "bellatrix",
      "entity_2": "harry",
      "relationship_type": "understands",
      "description": "Harry understands what Bellatrix meant, implying a relationship between the two. (\"I see what Bellatrix meant\")"
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "potter",
      "relationship_type": "concerned_about",
      "description": "Professor McGonagall is concerned about Potter's arrival, implying a relationship between the two. (\"Potter! Potter — you're here!\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "potter",
      "relationship_type": "defended",
      "description": "Harry defended Potter by saying he spat at Professor McGonagall, implying a relationship between Harry and Potter. (\"He spat at you\")"
    }
  ]
}