{
  "entities": [
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is described as being younger and less shabby than before, with thicker and darker hair. He looks happy to be back in a familiar place."
    },
    {
      "name": "lily",
      "entity_type": "person",
      "singular": true,
      "description": "Lily's smile is described as the widest of all, and her green eyes are compared to Lupin's. She searches his face hungrily."
    },
    {
      "name": "james",
      "entity_type": "person",
      "singular": true,
      "description": "James is mentioned as saying that Harry is nearly there and very close, and that they are proud of him."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry asks if dying hurts, and Lupin responds by saying it's quicker and easier than falling asleep. Harry also says he didn't want any of them to die."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as responding to Harry's question about dying, saying it doesn't hurt at all and is quicker than falling asleep."
    },
    {
      "name": "place",
      "entity_type": "location",
      "singular": true,
      "description": "The place where Lupin is standing is described as a familiar scene of many adolescent wanderings."
    }
  ],
  "relationships": [
    {
      "entity_1": "lupin",
      "entity_2": "lily",
      "relationship_type": "look_at",
      "description": "Lupin looks at Lily, and his eyes feast on her. He thinks he would like to stand and look at her forever."
    },
    {
      "entity_1": "james",
      "entity_2": "harry",
      "relationship_type": "praise",
      "description": "James praises Harry, saying he is nearly there and very close, and that they are proud of him."
    },
    {
      "entity_1": "sirius",
      "entity_2": "harry",
      "relationship_type": "respond_to_question",
      "description": "Sirius responds to Harry's question about dying by saying it doesn't hurt at all."
    },
    {
      "entity_1": "lupin",
      "entity_2": "harry",
      "relationship_type": "comfort",
      "description": "Lupin comforts Harry by telling him that dying is quicker and easier than falling asleep."
    }
  ]
}