{
  "entities": [
    {
      "name": "narcissa",
      "entity_type": "person",
      "singular": true,
      "description": "Narcissa is described as a pale, frozen figure in the drawing room. (\"of the pale, frozen figures of Narcissa and Draco\")"
    },
    {
      "name": "draco",
      "entity_type": "person",
      "singular": true,
      "description": "Draco is described as a pale, frozen figure in the drawing room. (\"of the pale, frozen figures of Narcissa and Draco\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron's hair is described as a streak of red. (\"a streak of red that was Ron’s hair\")"
    },
    {
      "name": "bellatrix",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix's knife is described as flying across the room. (\"as Bellatrix’s knife ﬂew across the room at the place where he was vanishing\")"
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill and Fleur are mentioned as owners of Shell Cottage. (\"Bill and Fleur’s . . . Shell Cottage . . .\")"
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is mentioned as owner of Shell Cottage. (\"Bill and Fleur’s . . . Shell Cottage . . .\")"
    },
    {
      "name": "dobby",
      "entity_type": "elf",
      "singular": true,
      "description": "Dobby's hand is described as jerking in Harry's. (\"Gryﬃndor’s sword bumping against his back: Dobby’s hand jerked in his\")"
    },
    {
      "name": "malfoy manor",
      "entity_type": "location",
      "singular": true,
      "description": "Malfoy Manor is mentioned as a location. (\"474 Malfoy Manor\")"
    },
    {
      "name": "gryffindor's sword",
      "entity_type": "object",
      "singular": true,
      "description": "Gryffindor's sword is described as bumping against Harry's back. (\"Gryﬃndor’s sword bumping against his back\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "bellatrix",
      "entity_2": "ron",
      "relationship_type": "attack",
      "description": "Bellatrix is attacking Ron, as her knife flies across the room. (\"as Bellatrix’s knife ﬂew across the room at the place where he was vanishing\")"
    },
    {
      "entity_1": "dobby",
      "entity_2": "harry",
      "relationship_type": "control",
      "description": "Dobby's hand is jerking in Harry's, suggesting Dobby may be trying to take control. (\"Gryﬃndor’s sword bumping against his back: Dobby’s hand jerked in his\")"
    }
  ]
}