{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is introduced as a character who has modified a motorcycle. He is described as being oblivious to Harry's discomfort."
    },
    {
      "name": "hedwig",
      "entity_type": "animal",
      "singular": true,
      "description": "Hedwig is mentioned as Hagrid's owl, whose cage is placed between his knees on the motorcycle."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as a character who is uncomfortable with the modified motorcycle."
    },
    {
      "name": "arthur weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur Weasley is mentioned as being concerned about the safety of the modified motorcycle."
    },
    {
      "name": "moody",
      "entity_type": "person",
      "singular": true,
      "description": "Moody is introduced as a character who wants everyone to leave at exactly the same time."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "hedwig",
      "relationship_type": "owns",
      "description": "Hagrid owns Hedwig, whose cage is placed between his knees on the motorcycle. (Excerpt: 'Hedwig’s cage between his knees.')"
    },
    {
      "entity_1": "hagrid",
      "entity_2": "motorcycle",
      "relationship_type": "modified",
      "description": "Hagrid has modified a motorcycle, which is described as having 'a few tricks up its hindquarters now'. (Excerpt: 'Arthur’s done a bit o’ tinkerin’... It’s got a few tricks up its hindquarters now. Tha’ one was my idea.')"
    },
    {
      "entity_1": "hagrid",
      "entity_2": "motorcycle",
      "relationship_type": "rides",
      "description": "Hagrid is riding the modified motorcycle, which creaks slightly and sinks into the ground. (Excerpt: 'He settled himself astride the motorcycle... It was extremely uncomfortable.')"
    },
    {
      "entity_1": "harry",
      "entity_2": "motorcycle",
      "relationship_type": "rides_on",
      "description": "Harry is riding on the modified motorcycle, which is described as being uncomfortable. (Excerpt: 'It was extremely uncomfortable.')"
    },
    {
      "entity_1": "moody",
      "entity_2": "group",
      "relationship_type": "leads",
      "description": "Moody is leading a group of people, including Harry and Hagrid, who are about to leave at exactly the same time. (Excerpt: 'I want 54 The Seven Potters us all to leave at exactly the same time or the whole point of the diversion’s lost.')"
    }
  ]
}