{
  "entities": [
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is described as carelessly handsome with a slightly arrogant face, which is much younger and happier than Harry has ever seen it. He is standing next to Pettigrew and is part of the coolest gang with James and Sirius."
    },
    {
      "name": "pettigrew",
      "entity_type": "person",
      "singular": true,
      "description": "Pettigrew is described as more than a head shorter, plump and watery-eyed. He is flushed with pleasure at being included in the coolest gang with James and Sirius."
    },
    {
      "name": "james",
      "entity_type": "person",
      "singular": true,
      "description": "James is mentioned as one of the much-admired rebels who had been part of the coolest gang with Sirius."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is described as even then a little shabby-looking but having an air of delighted surprise at being liked and included. Harry sees these things in the picture because he knows how it had been."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as looking around at the floor and seeing bits of paper, books, and small objects scattered over the carpet. He also tries to take a picture from the wall but it won’t budge."
    },
    {
      "name": "sky",
      "entity_type": "location",
      "singular": true,
      "description": "The sky outside is growing brighter."
    }
  ],
  "relationships": [
    {
      "entity_1": "sirius",
      "entity_2": "pettigrew",
      "relationship_type": "adjacent_to",
      "description": "Sirius and Pettigrew are standing next to each other."
    },
    {
      "entity_1": "james",
      "entity_2": "sirius",
      "relationship_type": "friend_of",
      "description": "James and Sirius were part of the coolest gang together."
    },
    {
      "entity_1": "lupin",
      "entity_2": "harry",
      "relationship_type": "known_by",
      "description": "Harry knows how it had been for Lupin, which is why he sees these things in the picture."
    }
  ]
}