{
  "entities": [
    {
      "name": "griphook",
      "entity_type": "person",
      "singular": true,
      "description": "Griphook is a goblin who has seen something and lunged at Harry, indicating that he did not expect them to keep their word. He is described as holding tightly to Harry's hair with one hand and seizing the hilt of the sword with the other."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who has kept his word, surprising Griphook. He is described as being held by Griphook and trying to catch the tiny golden cup."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person who is sliding uncontrollably on an expanding avalanche of fiery gold and silver along with Harry and Hermione."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who is sliding uncontrollably on an expanding avalanche of fiery gold and silver along with Ron and Harry."
    }
  ],
  "relationships": [
    {
      "entity_1": "griphook",
      "entity_2": "harry",
      "relationship_type": "held_by",
      "description": "Griphook is holding tightly to Harry's hair, making sure he does not fall into the sea of burning gold."
    },
    {
      "entity_1": "griphook",
      "entity_2": "harry",
      "relationship_type": "attacked",
      "description": "Griphook lunged at Harry, indicating that he did not expect them to keep their word."
    },
    {
      "entity_1": "harry",
      "entity_2": "griphook",
      "relationship_type": "held_by",
      "description": "Harry is being held by Griphook as he tries to catch the tiny golden cup."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "along_with",
      "description": "Ron is sliding uncontrollably on an expanding avalanche of fiery gold and silver along with Harry and Hermione."
    },
    {
      "entity_1": "hermione",
      "entity_2": "ron",
      "relationship_type": "along_with",
      "description": "Hermione is sliding uncontrollably on an expanding avalanche of fiery gold and silver along with Ron and Harry."
    }
  ]
}