{
  "entities": [
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is the main character in this scene, trying to avoid being attacked by the suit of armor and later running away from his attackers. (\"Snape avoided them only be forcing the suit of armor in front of him...\", \"When Harry looked up again, Snape was in full flight...\")"
    },
    {
      "name": "minerva",
      "entity_type": "person",
      "singular": true,
      "description": "Minerva is mentioned as a name called out by an unknown person. (\"—‘Minerva!’ said a squeaky voice...\")"
    },
    {
      "name": "luna",
      "entity_type": "person",
      "singular": true,
      "description": "Luna is the companion of Harry in this scene, being shielded by him from flying spells. (\"still shielding Luna from ﬂying spells...\")"
    },
    {
      "name": "flitwick",
      "entity_type": "person",
      "singular": true,
      "description": "Flitwick is a professor who tries to stop Snape's actions, shouting \"You'll do more murder at Hogwarts!\" and casting a spell. (\"No!” squeaking Flitwick, raising his wand...\")"
    },
    {
      "name": "sprout",
      "entity_type": "person",
      "singular": true,
      "description": "Sprout is another professor who sprints up the corridor with Flitwick and Slughorn to stop Snape. (\"Professor Flitwick and Sprout sprinting up the corridor toward them...\")"
    },
    {
      "name": "slughorn",
      "entity_type": "person",
      "singular": true,
      "description": "Slughorn is a professor who is panting along behind Flitwick and Sprout. (\"with the enormous Professor Slughorn panting along at the rear.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a character who observes Snape's actions, sees Flitwick and Sprout coming to stop him, and has to dive sideways to avoid the suit of armor. (\"Harry saw Professor Flitwick and Sprout sprinting up the corridor toward them...\", \"Harry looked up again...\")"
    },
    {
      "name": "mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "McGonagall is a professor who is thundering after Snape. (\"When Harry looked up again, Snape was in full ﬂight, McGonagall, Flitwick, and Sprout all thundering after him.\")"
    },
    {
      "name": "minerva mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Minerva McGonagall is a professor who is mentioned as being present in the scene. (\"McGonagall, Flitwick, and Sprout all thundering after him.\")"
    },
    {
      "name": "hogwarts",
      "entity_type": "location",
      "singular": true,
      "description": "Hogwarts is mentioned as a place where Snape's actions will cause more murder. (\"You’ll do more murder at Hogwarts!\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "snape",
      "entity_2": "hagwarts",
      "relationship_type": "location_of_action",
      "description": "Snape's actions are taking place at Hogwarts. (\"You’ll do more murder at Hogwarts!\")"
    },
    {
      "entity_1": "flitwick",
      "entity_2": "snape",
      "relationship_type": "trying_to_stop",
      "description": "Flitwick is trying to stop Snape's actions, shouting \"You'll do more murder at Hogwarts!\" and casting a spell. (\"No!” squeaking Flitwick, raising his wand...\")"
    },
    {
      "entity_1": "sprout",
      "entity_2": "snape",
      "relationship_type": "trying_to_stop",
      "description": "Sprout is also trying to stop Snape's actions, sprinting up the corridor with Flitwick and Slughorn. (\"Professor Flitwick and Sprout sprinting up the corridor toward them...\")"
    },
    {
      "entity_1": "slughorn",
      "entity_2": "snape",
      "relationship_type": "trying_to_stop",
      "description": "Slughorn is also trying to stop Snape's actions, panting along behind Flitwick and Sprout. (\"with the enormous Professor Slughorn panting along at the rear.\")"
    },
    {
      "entity_1": "mcgonagall",
      "entity_2": "snape",
      "relationship_type": "chasing_after",
      "description": "McGonagall is chasing after Snape, thundering with Flitwick and Sprout. (\"When Harry looked up again, Snape was in full ﬂight, McGonagall, Flitwick, and Sprout all thundering after him.\")"
    }
  ]
}