{
  "entities": [
    {
      "name": "surrounding mountains",
      "entity_type": "location",
      "singular": false,
      "description": "The text describes the surrounding environment, mentioning mountains. The description is brief and does not provide further details about the mountains."
    },
    {
      "name": "ceiling",
      "entity_type": "object",
      "singular": true,
      "description": "The ceiling of a room or building is described as being domed and painted with stars, indicating it's an architectural feature."
    },
    {
      "name": "stars",
      "entity_type": "object",
      "singular": false,
      "description": "Stars are mentioned as being painted on the ceiling, suggesting they're part of a decorative design or mural."
    },
    {
      "name": "midnight-blue carpet",
      "entity_type": "object",
      "singular": true,
      "description": "The midnight-blue carpet is described as echoing the stars on the ceiling, indicating it's a matching or complementary feature in the room's decor."
    },
    {
      "name": "tables",
      "entity_type": "furniture",
      "singular": false,
      "description": "Tables are mentioned as being present in the room, but no further details are provided about their design or purpose."
    },
    {
      "name": "chairs",
      "entity_type": "furniture",
      "singular": false,
      "description": "Chairs are also mentioned as being present in the room, similar to tables, with no additional information about their characteristics."
    },
    {
      "name": "bookcases",
      "entity_type": "furniture",
      "singular": false,
      "description": "Bookcases are mentioned alongside tables and chairs, indicating they're part of the room's furniture, but no further details are provided."
    },
    {
      "name": "statue",
      "entity_type": "object",
      "singular": true,
      "description": "A statue made of white marble is described as standing in a niche opposite the door, indicating it's a prominent feature in the room."
    }
  ],
  "relationships": [
    {
      "entity_1": "ceiling",
      "entity_2": "stars",
      "relationship_type": "has_pattern",
      "description": "The ceiling is described as being painted with stars, establishing a relationship between the two entities."
    },
    {
      "entity_1": "midnight-blue carpet",
      "entity_2": "stars",
      "relationship_type": "echoes",
      "description": "The midnight-blue carpet is said to echo the stars on the ceiling, indicating a visual or aesthetic connection between the two entities."
    }
  ]
}