{
  "entities": [
    {
      "name": "peaceful pureblood society",
      "entity_type": "group",
      "singular": true,
      "description": "The pamphlet is addressed to a peaceful PureBlood society. The text describes the society as being beneath the title of the pamphlet."
    },
    {
      "name": "red rose",
      "entity_type": "object",
      "singular": true,
      "description": "A picture of a red rose with a simpering face in the middle of its petals is shown on the pamphlet. The rose is being strangled by a green weed with fangs and a scowl."
    },
    {
      "name": "green weed",
      "entity_type": "object",
      "singular": true,
      "description": "A green weed with fangs and a scowl is strangling the red rose in the picture on the pamphlet."
    },
    {
      "name": "pamphlet",
      "entity_type": "document",
      "singular": true,
      "description": "The text describes the pamphlet as being examined by Harry. The pamphlet has no author's name but has scars on the back of its cover that seem to tingle when Harry examines it."
    },
    {
      "name": "mudbloods",
      "entity_type": "group",
      "singular": false,
      "description": "The witch beside Harry mentions interrogating Mudbloods, suggesting that they are a group being targeted by the old hag."
    },
    {
      "name": "old hag",
      "entity_type": "person",
      "singular": true,
      "description": "The text describes an old hag who is interrogating Mudbloods. The old hag has magic ears and eyes."
    },
    {
      "name": "mahogany door",
      "entity_type": "object",
      "singular": true,
      "description": "A shining mahogany door with a large, round eye facing the space full of pamphlet-makers is described in the text."
    },
    {
      "name": "peephole",
      "entity_type": "object",
      "singular": true,
      "description": "The text mentions that where there might have been a peephole on a Muggle front door, a large, round eye with a bright blue iris has been set into the mahogany door."
    },
    {
      "name": "muggle front door",
      "entity_type": "object",
      "singular": true,
      "description": "The text compares the mahogany door to a Muggle front door, suggesting that it is similar but with some magical features."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as examining the pamphlet and looking at the mahogany door. He feels rage when he sees the eye on the door."
    },
    {
      "name": "wizard",
      "entity_type": "person",
      "singular": false,
      "description": "A wizard beside the witch warns her to be careful about the old hag's magic ears and eyes."
    }
  ],
  "relationships": [
    {
      "entity_1": "old hag",
      "entity_2": "mudbloods",
      "relationship_type": "interrogates",
      "description": "The text describes the old hag as interrogating Mudbloods, suggesting a relationship of interrogation between them."
    },
    {
      "entity_1": "wizard",
      "entity_2": "witch",
      "relationship_type": "cautioning",
      "description": "A wizard beside the witch warns her to be careful about the old hag's magic ears and eyes, indicating a cautionary relationship between the two."
    }
  ]
}