{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as having shown a dozen more people to their places. He is described as helping with the preparations for the event."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as talking about his great-aunt Muriel and her dislike of him and his brothers. He is described as mopping his forehead on his sleeve due to the heat."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as coming hurrying toward Ron and Harry, complimenting them on their appearance. She is described as wearing a lilac-colored dress and high heels."
    },
    {
      "name": "muriel",
      "entity_type": "person",
      "singular": true,
      "description": "Muriel is mentioned as being at the event, giving Fleur the tiara. She is described as disapproving of Ron's appearance and posture."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as one of the people who set off a Dungbomb under Muriel's chair at dinner, causing her to take offense."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as one of the people who set off a Dungbomb under Muriel's chair at dinner, causing her to take offense."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is mentioned as receiving the tiara from Muriel. She is described as being present at the event."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "muriel",
      "relationship_type": "dislike",
      "description": "Ron mentions that his great-aunt Muriel dislikes him and his brothers, as evidenced by her past behavior of taking offense at their pranks."
    },
    {
      "entity_1": "fred",
      "entity_2": "muriel",
      "relationship_type": "dislike",
      "description": "Fred is mentioned as one of the people who set off a Dungbomb under Muriel's chair, causing her to take offense."
    },
    {
      "entity_1": "george",
      "entity_2": "muriel",
      "relationship_type": "dislike",
      "description": "George is mentioned as one of the people who set off a Dungbomb under Muriel's chair, causing her to take offense."
    },
    {
      "entity_1": "harry",
      "entity_2": "muriel",
      "relationship_type": "acquaintance",
      "description": "Harry is mentioned as having shown people to their places, including Muriel. They are described as being at the same event."
    },
    {
      "entity_1": "hermione",
      "entity_2": "ron",
      "relationship_type": "friendship",
      "description": "Hermione is mentioned as coming hurrying toward Ron, complimenting him on his appearance. They are described as being friends."
    }
  ]
}