{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as whispering a question, indicating she is one of the survivors and present in the scene."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is leading the way to the Great Hall, showing he is also a survivor and part of the group."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as stopping in the doorway, indicating he is present in the scene and observing the aftermath."
    },
    {
      "name": "madam pomfrey",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Pomfrey is treating the injured on the raised platform, showing she is a medical professional and part of the group."
    },
    {
      "name": "firenze",
      "entity_type": "person",
      "singular": true,
      "description": "Firenze is mentioned as being amongst the injured, indicating he was present in the scene but suffered an injury."
    },
    {
      "name": "fred weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Fred's body is mentioned as being surrounded by his family, showing he has passed away and is part of the scene."
    },
    {
      "name": "george weasley",
      "entity_type": "person",
      "singular": true,
      "description": "George is kneeling at Fred's head, indicating he is mourning the loss of his brother and present in the scene."
    },
    {
      "name": "mr. weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is stroking Mrs. Weasley's hair while tears are cascading down his cheeks, showing he is mourning the loss of his son and present in the scene."
    },
    {
      "name": "mrs. weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is lying across Fred's chest, her body shaking, indicating she is mourning the loss of her son and part of the scene."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "great hall",
      "relationship_type": "location",
      "description": "Harry stopped in the doorway, indicating he is present in the Great Hall."
    },
    {
      "entity_1": "hermione",
      "entity_2": "ron",
      "relationship_type": "acquaintance",
      "description": "Hermione and Ron are mentioned as being together, showing they have a relationship with each other."
    },
    {
      "entity_1": "madam pomfrey",
      "entity_2": "injured",
      "relationship_type": "treatment",
      "description": "Madam Pomfrey is treating the injured on the raised platform, indicating she has a relationship of treatment with them."
    },
    {
      "entity_1": "firenze",
      "entity_2": "injured",
      "relationship_type": "victim",
      "description": "Firenze is mentioned as being amongst the injured, showing he is a victim of the event."
    },
    {
      "entity_1": "fred weasley",
      "entity_2": "dead",
      "relationship_type": "status",
      "description": "Fred's body is mentioned as being surrounded by his family, indicating he has passed away and is part of the scene."
    },
    {
      "entity_1": "mr. weasley",
      "entity_2": "mrs. weasley",
      "relationship_type": "family",
      "description": "Mr. Weasley is stroking Mrs. Weasley's hair while tears are cascading down his cheeks, showing he has a relationship of family with her."
    }
  ]
}