{
  "entities": [
    {
      "name": "gargoyle",
      "entity_type": "gargoyle",
      "singular": true,
      "description": "The gargoyle is described as being knocked aside and looking a little punch-drunk. It is also mentioned that Harry wondered whether it would be able to distinguish passwords anymore."
    },
    {
      "name": "headmaster’s study",
      "entity_type": "study",
      "singular": true,
      "description": "The headmaster's study is where the gargoyle was guarding the entrance and where Harry had left his Pensieve."
    },
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who is navigating through the castle and interacting with the gargoyle and other entities."
    },
    {
      "name": "Pensieve",
      "entity_type": "object",
      "singular": true,
      "description": "The Pensieve is a stone object that Harry had left on the desk in the headmaster's study."
    },
    {
      "name": "Hogwarts",
      "entity_type": "school",
      "singular": false,
      "description": "Hogwarts is mentioned as the school where the headmasters and headmistresses are giving Harry a standing ovation."
    },
    {
      "name": "Dilys Derwent",
      "entity_type": "person",
      "singular": true,
      "description": "Dilys Derwent is one of the headmistresses of Hogwarts who is giving Harry a standing ovation and sobbing."
    }
  ],
  "relationships": [
    {
      "entity_1": "Harry",
      "entity_2": "gargoyle",
      "relationship_type": "interact_with",
      "description": "Harry interacted with the gargoyle by asking it if they could go up and then clambering over it to get onto the spiral staircase."
    },
    {
      "entity_1": "Harry",
      "entity_2": "Pensieve",
      "relationship_type": "left_on_desk",
      "description": "Harry had left his Pensieve on the desk in the headmaster's study."
    },
    {
      "entity_1": "headmasters and headmistresses of Hogwarts",
      "entity_2": "Harry",
      "relationship_type": "give_standing_ovation_to",
      "description": "The headmasters and headmistresses of Hogwarts were giving Harry a standing ovation, waving their hats and wigs and dancing on the chairs."
    },
    {
      "entity_1": "Dilys Derwent",
      "entity_2": "Harry",
      "relationship_type": "give_standing_ovation_to",
      "description": "Dilys Derwent was also giving Harry a standing ovation and sobbing."
    }
  ]
}