{
  "entities": [
    {
      "name": "runcorn",
      "entity_type": "person",
      "singular": true,
      "description": "Runcorn is mentioned as a person that Harry wants to impersonate. He is described as someone who might be important enough to get away with entering the courtroom without being noticed."
    },
    {
      "name": "mafalda",
      "entity_type": "person",
      "singular": true,
      "description": "Mafalda is mentioned as a person that Harry wants to meet in the courtroom. She is not described further in this passage, but her name suggests she might be someone important."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione's non-reappearance is mentioned as a potential problem for Harry. This implies that Hermione was supposed to meet Harry, but she did not show up."
    },
    {
      "name": "decody detonators",
      "entity_type": "object",
      "singular": false,
      "description": "Decoy Detonators are mentioned as objects that Harry still has with him. They seem to be some kind of tool or device, but their purpose is not described in this passage."
    },
    {
      "name": "courtroom door",
      "entity_type": "location",
      "singular": true,
      "description": "The courtroom door is mentioned as a location that Harry considers entering. He wants to enter it as Runcorn and ask for a quick word with Mafalda."
    },
    {
      "name": "court chambers",
      "entity_type": "location",
      "singular": true,
      "description": "The court chambers are mentioned as a location that Harry is descending into. They seem to be some kind of official or governmental building."
    }
  ],
  "relationships": [
    {
      "entity_1": "runcorn",
      "entity_2": "mafalda",
      "relationship_type": "want_to_meet",
      "description": "Harry wants to meet Mafalda in the courtroom, and he considers entering as Runcorn to do so."
    },
    {
      "entity_1": "runcorn",
      "entity_2": "courtroom door",
      "relationship_type": "enter_through",
      "description": "Harry considers entering the courtroom through the doorway as Runcorn."
    }
  ]
}