{
  "entities": [
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is mentioned as a character in the story, specifically as the one who was talking about Barty Crouch. (\"Yeah,\" said Harry.)"
    },
    {
      "name": "barty crouch",
      "entity_type": "character",
      "singular": true,
      "description": "Barty Crouch is mentioned as a character in the story, specifically as someone who was turned into a bone and buried. (\"Like Barty Crouch, turned into a bone and buried in Hagrid’s front garden.\")"
    },
    {
      "name": "hagrid",
      "entity_type": "character",
      "singular": true,
      "description": "Hagrid is mentioned as a character in the story, specifically as the one whose front garden has Barty Crouch buried. (\"Like Barty Crouch, turned into a bone and buried in Hagrid’s front garden.\")"
    },
    {
      "name": "hermione",
      "entity_type": "character",
      "singular": true,
      "description": "Hermione is mentioned as a character in the story, specifically as the one who burst into tears over her copy of Spellman’s Syllabary. (\"Startled, Harry looked over just in time to see her burst into tears over her copy of Spellman’s Syllabary.\")"
    },
    {
      "name": "ron",
      "entity_type": "character",
      "singular": true,
      "description": "Ron is mentioned as a character in the story, specifically as the one who bounded off the bed to comfort Hermione. (\"But with a great creaking of rusty bedsprings, Ron bounded oﬀ the bed and got there ﬁrst.\")"
    },
    {
      "name": "moody",
      "entity_type": "character",
      "singular": true,
      "description": "Moody is mentioned as a character in the story, specifically as someone who was transfigured. (\"They probably transﬁgured Moody and stuffed him —\")"
    },
    {
      "name": "spellman’s syllabary",
      "entity_type": "book",
      "singular": true,
      "description": "Spellman’s Syllabary is mentioned as a book in the story, specifically as something Hermione was reading. (\"Startled, Harry looked over just in time to see her burst into tears over her copy of Spellman’s Syllabary.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "barty crouch",
      "relationship_type": "mentioned_together",
      "description": "Harry and Barty Crouch are mentioned together in the story, specifically as someone who was turned into a bone and buried. (\"Like Barty Crouch, turned into a bone and buried in Hagrid’s front garden.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "concerned_for",
      "description": "Harry is concerned for Hermione when she bursts into tears. (\"Oh no,\" said Harry, struggling to get up from the old camp bed.\")"
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "comforted",
      "description": "Ron comforts Hermione when she bursts into tears. (\"But with a great creaking of rusty bedsprings, Ron bounded oﬀ the bed and got there ﬁrst.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "moody",
      "relationship_type": "mentioned_together",
      "description": "Harry and Moody are mentioned together in the story, specifically as someone who was transfigured. (\"They probably transﬁgured Moody and stuffed him —\")"
    }
  ]
}