{
  "entities": [
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is introduced as the one who cries 'Maman!' when she sees her mother, indicating that Fleur's mother has arrived. (\"cried Fleur, rushing forward to embrace her.\")"
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is introduced as the one who is being greeted by Monsieur Delacour and his wife, Apolline. (\"Bouncing toward Mrs. Weasley on high-heeled boots, he kissed her twice on each cheek,\")"
    },
    {
      "name": "monsieur delacour",
      "entity_type": "person",
      "singular": true,
      "description": "Monsieur Delacour is introduced as the husband of Apolline and the father of Fleur. (\"Monsieur Delacour was nowhere near as attractive as his wife; he was a head shorter and extremely plump,\")"
    },
    {
      "name": "apolline",
      "entity_type": "person",
      "singular": true,
      "description": "Apolline is introduced as the wife of Monsieur Delacour. (\"Let me present my wife, Apolline.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "monsieur delacour",
      "entity_2": "apolline",
      "relationship_type": "spouse",
      "description": "Monsieur Delacour presents his wife, Apolline, indicating that they are married. (\"Let me present my wife, Apolline.\")"
    },
    {
      "entity_1": "monsieur delacour",
      "entity_2": "fleur",
      "relationship_type": "parent_child",
      "description": "Monsieur Delacour is referred to as Fleur's father, indicating a parent-child relationship. (\"Fleur tells us you ’ave been working very ’ard.\")"
    },
    {
      "entity_1": "fleur",
      "entity_2": "mrs weasley",
      "relationship_type": "family_member_family_member",
      "description": "Fleur and Mrs. Weasley are introduced as members of two families that are about to be united, indicating a family relationship. (\"We are most honored at the approaching union of our two families!\")"
    }
  ]
}