{
  "entities": [
    {
      "name": "gringotts",
      "entity_type": "location",
      "singular": true,
      "description": "Gringotts is a location mentioned in the text as the target of their attempted assault. It is described as a place where they will be using Hermione's actual wand."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who is part of the group attempting to assault Gringotts. She is mentioned as being frightened of her own wand and feeling that it doesn't work properly for her."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who is part of the group attempting to assault Gringotts. He is mentioned as trying to reassure Hermione about using her own wand."
    },
    {
      "name": "malfoy manor",
      "entity_type": "location",
      "singular": true,
      "description": "Malfoy Manor is a location where Hermione was wearing a sweater from which a black hair was plucked."
    },
    {
      "name": "hermione's wand",
      "entity_type": "object",
      "singular": true,
      "description": "Hermione's wand is an object that is mentioned as being used by Hermione. It is described as feeling 'all wrong' and not working properly for her."
    },
    {
      "name": "blackthorn wand",
      "entity_type": "object",
      "singular": true,
      "description": "The blackthorn wand is an object that is mentioned as being disliked by Harry. It is described as not working as well as his own wand."
    },
    {
      "name": "glass phial",
      "entity_type": "object",
      "singular": true,
      "description": "A glass phial is an object where a single long, coarse black hair was placed."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "reassure",
      "description": "Harry tries to reassure Hermione about using her own wand."
    },
    {
      "entity_1": "hermione",
      "entity_2": "blackthorn wand",
      "relationship_type": "dislike",
      "description": "Hermione dislikes the blackthorn wand and feels that it doesn't work properly for her."
    },
    {
      "entity_1": "harry",
      "entity_2": "blackthorn wand",
      "relationship_type": "dislike",
      "description": "Harry also dislikes the blackthorn wand, which he felt didn't work as well as his own wand."
    },
    {
      "entity_1": "hermione",
      "entity_2": "glass phial",
      "relationship_type": "contain",
      "description": "A single long, coarse black hair was placed in a glass phial."
    }
  ]
}