{
  "entities": [
    {
      "name": "auntie muriel",
      "entity_type": "character",
      "singular": true,
      "description": "Auntie Muriel is a character in the story who is delighted at the effect she has produced on Barry. She says that Harry's mother was a Squib and that Dumbledore kept his sister quiet for a long time."
    },
    {
      "name": "barry",
      "entity_type": "character",
      "singular": true,
      "description": "Barry is a character in the story who is corrected by Auntie Muriel about Harry's mother being a Squib."
    },
    {
      "name": "skeeter",
      "entity_type": "character",
      "singular": true,
      "description": "Skeeter is a character in the story who has unearthed information that Dumbledore kept his sister quiet for a long time."
    },
    {
      "name": "dumbledore",
      "entity_type": "character",
      "singular": true,
      "description": "Dumbledore is a character in the story who kept his sister quiet for a long time. He never told Harry about his sister being a Squib."
    },
    {
      "name": "ariana",
      "entity_type": "person",
      "singular": true,
      "description": "Ariana is Dumbledore's sister who was a Squib and died. Her death devastated Albus (Dumbledore)."
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is the main character in the story who learns about his mother being a Squib and Dumbledore keeping his sister quiet."
    },
    {
      "name": "doge",
      "entity_type": "character",
      "singular": true,
      "description": "Doge is a character in the story who denies that Dumbledore kept his sister quiet for a long time."
    },
    {
      "name": "elphias",
      "entity_type": "character",
      "singular": true,
      "description": "Elphias is a character in the story who explains why Dumbledore never spoke about Ariana's death."
    },
    {
      "name": "muriel",
      "entity_type": "character",
      "singular": false,
      "description": "Muriel is a character in the story who asks questions and corrects others. She has multiple instances in the text."
    },
    {
      "name": "albus",
      "entity_type": "person",
      "singular": true,
      "description": "Albus is Dumbledore's first name mentioned in the context of his sister Ariana's death."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "ariana",
      "relationship_type": "sister",
      "description": "Dumbledore and Ariana are siblings. This relationship is described as Dumbledore keeping his sister quiet for a long time."
    },
    {
      "entity_1": "harry",
      "entity_2": "dumbledore",
      "relationship_type": "family_member",
      "description": "Harry is a family member of Dumbledore's, but the exact nature of their relationship is not specified in this context. However, it can be inferred that Harry is related to Dumbledore through his sister Ariana."
    },
    {
      "entity_1": "skeeter",
      "entity_2": "dumbledore",
      "relationship_type": "discoverer_of_secret",
      "description": "Skeeter has unearthed information about Dumbledore keeping his sister quiet for a long time. This relationship is described as Skeeter discovering a secret about Dumbledore."
    },
    {
      "entity_1": "muriel",
      "entity_2": "barry",
      "relationship_type": "corrector",
      "description": "Muriel corrects Barry's understanding of Harry's mother being a Squib. This relationship is described as Muriel correcting someone else's mistake."
    },
    {
      "entity_1": "muriel",
      "entity_2": "harry",
      "relationship_type": "questioner",
      "description": "Muriel asks questions to Harry about his mother being a Squib and Dumbledore keeping his sister quiet. This relationship is described as Muriel asking questions of someone else."
    },
    {
      "entity_1": "doge",
      "entity_2": "dumbledore",
      "relationship_type": "denier_of_secret",
      "description": "Doge denies that Dumbledore kept his sister quiet for a long time. This relationship is described as Doge denying a secret about Dumbledore."
    }
  ]
}