{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a student at Hogwarts School of Witchcraft and Wizardry. He is being shepherded from class to class by teachers."
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Draco Malfoy is a student at Hogwarts School of Witchcraft and Wizardry. He seems to be enjoying the atmosphere of terror and suspicion."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is the former Headmaster of Hogwarts School of Witchcraft and Wizardry. Draco Malfoy thinks he might have been removed by his father."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a gamekeeper at Hogwarts School of Witchcraft and Wizardry. He left the school with Dumbledore."
    },
    {
      "name": "mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "McGonagall is an interim Headmaster at Hogwarts School of Witchcraft and Wizardry. Draco Malfoy thinks she won't last long."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is a student at Hogwarts School of Witchcraft and Wizardry. He is one of Draco's friends."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is a student at Hogwarts School of Witchcraft and Wizardry. He is one of Draco's friends."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a student at Hogwarts School of Witchcraft and Wizardry. Snape passes by her during the Potions lesson."
    }
  ],
  "relationships": [
    {
      "entity_1": "draco malfoy",
      "entity_2": "dumbledore",
      "relationship_type": "gloats_about",
      "description": "Draco Malfoy is gloating about Dumbledore's removal from Hogwarts School of Witchcraft and Wizardry."
    },
    {
      "entity_1": "draco malfoy",
      "entity_2": "mcgonagall",
      "relationship_type": "thinks_will_not_last_long",
      "description": "Draco Malfoy thinks McGonagall will not last long as Headmaster at Hogwarts School of Witchcraft and Wizardry."
    },
    {
      "entity_1": "draco malfoy",
      "entity_2": "chamber_of_secrets",
      "relationship_type": "wants_open",
      "description": "Draco Malfoy wants the Chamber of Secrets to remain open."
    }
  ]
}