{
  "entities": [
    {
      "name": "dobby",
      "entity_type": "character",
      "singular": true,
      "description": "Dobby is a character in the story who must do something for Harry Potter's own good."
    },
    {
      "name": "harry potter",
      "entity_type": "character",
      "singular": true,
      "description": "Harry Potter is the main character in the story, and Dobby is doing something for his own good."
    },
    {
      "name": "uncle vernon",
      "entity_type": "character",
      "singular": true,
      "description": "Uncle Vernon is a character who tries to gloss over the situation with Harry Potter."
    },
    {
      "name": "aunt petunia",
      "entity_type": "character",
      "singular": true,
      "description": "Aunt Petunia is a character who helps clean up the kitchen after the incident."
    },
    {
      "name": "masons",
      "entity_type": "family",
      "singular": false,
      "description": "The Masons are Harry Potter's relatives, and they are present in the dining room during the incident."
    }
  ],
  "relationships": [
    {
      "entity_1": "dobby",
      "entity_2": "harry potter",
      "relationship_type": "helping",
      "description": "Dobby is helping Harry Potter by doing something for his own good, as mentioned in the sentence 'Then Dobby must do it, sir, for Harry Potter’s own good'."
    },
    {
      "entity_1": "uncle vernon",
      "entity_2": "harry potter",
      "relationship_type": "anger",
      "description": "Uncle Vernon is angry with Harry Potter and threatens to flay him when the Masons leave, as mentioned in the sentence 'promised Harry he would flay him to within an inch of his life when the Masons had left'."
    },
    {
      "entity_1": "aunt petunia",
      "entity_2": "harry potter",
      "relationship_type": "helping",
      "description": "Aunt Petunia is helping Harry Potter by giving him ice-cream to clean up the kitchen, as mentioned in the sentence 'Aunt Petunia dug some ice-cream out of the freezer and Ha rry , still shaking, started scrubbing the kitchen clean'."
    }
  ]
}