{
  "entities": [
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Weasley is described as being in a bad mood and looking for spare socks and quills. She is also mentioned as glancing into the back seat of the car to check on her children."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr Weasley is described as tripping over a stray chicken while carrying Ginny's trunk to the car. He also shows Harry how he has magically expanded the boot of the car to fit all their belongings."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as having a trunk that Mr Weasley is carrying to the car."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as being in the car with his friends and trying to figure out how they will all fit. He also sees the magically expanded boot of the car."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as sitting comfortably in the back seat of the car with his friends."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as sitting comfortably in the back seat of the car with his friends."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as sitting comfortably in the back seat of the car with his friends."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is mentioned as sitting comfortably in the back seat of the car with his friends."
    },
    {
      "name": "molly",
      "entity_type": "person",
      "singular": true,
      "description": "Molly is mentioned as being Mrs Weasley and is told not to say anything by Mr Weasley."
    },
    {
      "name": "chicken",
      "entity_type": "animal",
      "singular": true,
      "description": "A stray chicken is described as causing trouble for Mr Weasley in the yard."
    }
  ],
  "relationships": [
    {
      "entity_1": "mr weasley",
      "entity_2": "car",
      "relationship_type": "owns",
      "description": "Mr Weasley owns a car that he has magically expanded to fit all their belongings."
    },
    {
      "entity_1": "mrs weasley",
      "entity_2": "children",
      "relationship_type": "parent_of",
      "description": "Mrs Weasley is the parent of her children who are sitting in the back seat of the car."
    },
    {
      "entity_1": "mr weasley",
      "entity_2": "ginny",
      "relationship_type": "carries_belongings_of",
      "description": "Mr Weasley is carrying Ginny's trunk to the car."
    }
  ]
}