{
  "entities": [
    {
      "name": "errol",
      "entity_type": "owl",
      "singular": true,
      "description": "Errol is an owl who delivered a letter and packages to the Hall, but was injured in the process. He fell into Hermione's jug, spraying milk and feathers everywhere."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is one of Harry's friends who helped care for Errol after he was injured. She prodded Errol gently with her finger to check if he was still alive."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is one of Harry's friends who helped care for Errol after he was injured. He pulled Errol out by the feet and was concerned about the red envelope in Errol's beak."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is one of Harry's friends who helped care for Errol after he was injured. He looked at the red envelope as though it might explode."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is one of the main characters in the story, but he does not play a direct role in this scene. He looks at the red envelope and seems unconcerned."
    },
    {
      "name": "hall",
      "entity_type": "location",
      "singular": true,
      "description": "The Hall is where Errol delivered the letter and packages, and where Harry's friends were gathered when Errol fell into Hermione's jug."
    }
  ],
  "relationships": [
    {
      "entity_1": "errol",
      "entity_2": "hall",
      "relationship_type": "delivered_to",
      "description": "Errol delivered a letter and packages to the Hall, circling around before dropping them into the crowd."
    },
    {
      "entity_1": "ron",
      "entity_2": "errol",
      "relationship_type": "cared_for",
      "description": "Ron helped care for Errol after he was injured, pulling him out by the feet and being concerned about the red envelope in his beak."
    },
    {
      "entity_1": "hermione",
      "entity_2": "errol",
      "relationship_type": "cared_for",
      "description": "Hermione helped care for Errol after he was injured, prodding him gently with her finger to check if he was still alive."
    },
    {
      "entity_1": "neville",
      "entity_2": "red envelope",
      "relationship_type": "looked_at",
      "description": "Neville looked at the red envelope as though it might explode, showing his concern about its contents."
    }
  ]
}