{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as the one who is scanning the recipe and murmuring the ingredients. She is described as a person who is part of the group that is trying to make the potion."
    },
    {
      "name": "lacewing flies",
      "entity_type": "ingredient",
      "singular": false,
      "description": "Lacewing flies are mentioned as one of the ingredients in the recipe. They are described as something that can be found in the student store-cupboard."
    },
    {
      "name": "leeches",
      "entity_type": "ingredient",
      "singular": false,
      "description": "Leeches are mentioned as another ingredient in the recipe. Like lacewing flies, they are described as something that can be found in the student store-cupboard."
    },
    {
      "name": "fluxweed",
      "entity_type": "ingredient",
      "singular": true,
      "description": "Fluxweed is mentioned as one of the ingredients in the recipe. It is not specified where it can be found, but it is described as something that needs to be included."
    },
    {
      "name": "knotgrass",
      "entity_type": "ingredient",
      "singular": true,
      "description": "Knotgrass is mentioned as another ingredient in the recipe. Like fluxweed, its source is not specified, but it is described as something that needs to be included."
    },
    {
      "name": "powdered horn of a bicorn",
      "entity_type": "ingredient",
      "singular": true,
      "description": "The powdered horn of a Bicorn is mentioned as one of the ingredients in the recipe. It is described as something that will be tricky to obtain."
    },
    {
      "name": "shredded skin of a boomslang",
      "entity_type": "ingredient",
      "singular": true,
      "description": "The shredded skin of a Boomslang is mentioned as another ingredient in the recipe. Like the powdered horn of a Bicorn, it is described as something that will be tricky to obtain."
    },
    {
      "name": "whoever we want to change into",
      "entity_type": "ingredient",
      "singular": true,
      "description": "The person or thing that they want to change into is mentioned as one of the ingredients in the recipe. It is described as something that needs to be included, but its source is not specified."
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "lacewing flies",
      "relationship_type": "has",
      "description": "Hermione has access to lacewing flies as they are mentioned as something that can be found in the student store-cupboard."
    },
    {
      "entity_1": "hermione",
      "entity_2": "leeches",
      "relationship_type": "has",
      "description": "Hermione has access to leeches as they are mentioned as something that can be found in the student store-cupboard."
    },
    {
      "entity_1": "hermione",
      "entity_2": "fluxweed",
      "relationship_type": "needs",
      "description": "Hermione needs fluxweed as it is described as one of the ingredients in the recipe, but its source is not specified."
    },
    {
      "entity_1": "hermione",
      "entity_2": "knotgrass",
      "relationship_type": "needs",
      "description": "Hermione needs knotgrass as it is described as one of the ingredients in the recipe, but its source is not specified."
    },
    {
      "entity_1": "hermione",
      "entity_2": "powdered horn of a bicorn",
      "relationship_type": "needs",
      "description": "Hermione needs the powdered horn of a Bicorn as it is described as one of the ingredients in the recipe, but its source is not specified."
    },
    {
      "entity_1": "hermione",
      "entity_2": "shredded skin of a boomslang",
      "relationship_type": "needs",
      "description": "Hermione needs the shredded skin of a Boomslang as it is described as one of the ingredients in the recipe, but its source is not specified."
    },
    {
      "entity_1": "hermione",
      "entity_2": "whoever we want to change into",
      "relationship_type": "needs",
      "description": "Hermione needs whoever they want to change into as it is described as one of the ingredients in the recipe, but its source is not specified."
    }
  ]
}