{
  "entities": [
    {
      "name": "nearly headless nick",
      "entity_type": "person",
      "singular": true,
      "description": "Nearly Headless Nick is a character who has had his head almost completely severed from his body. He is mentioned in the letter as not meeting the requirements for huntsmen, specifically because he does not have his head fully separated from his body."
    },
    {
      "name": "sir patrick delaney-podmore",
      "entity_type": "person",
      "singular": true,
      "description": "Sir Patrick Delaney-Podmore is a character who has written the letter to Nearly Headless Nick. He is mentioned as being very particular about the requirements for huntsmen, specifically that their heads must be fully separated from their bodies."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a character who is being spoken to by Nearly Headless Nick. He is not mentioned as having any significant role in the conversation, but is rather an audience for Nearly Headless Nick's words."
    },
    {
      "name": "horseback head-juggling",
      "entity_type": "activity",
      "singular": false,
      "description": "Horseback Head-Juggling is a hunt activity that requires participants to have their heads fully separated from their bodies. It is mentioned in the letter as one of the activities that Nearly Headless Nick does not meet the requirements for."
    },
    {
      "name": "head polo",
      "entity_type": "activity",
      "singular": false,
      "description": "Head Polo is a hunt activity that requires participants to have their heads fully separated from their bodies. It is mentioned in the letter as one of the activities that Nearly Headless Nick does not meet the requirements for."
    }
  ],
  "relationships": [
    {
      "entity_1": "nearly headless nick",
      "entity_2": "sir patrick delaney-podmore",
      "relationship_type": "recipient_of_letter",
      "description": "Nearly Headless Nick is the recipient of a letter from Sir Patrick Delaney-Podmore, in which he is informed that he does not meet the requirements for huntsmen."
    },
    {
      "entity_1": "nearly headless nick",
      "entity_2": "harry",
      "relationship_type": "speaking_to",
      "description": "Nearly Headless Nick is speaking to Harry, who is an audience for his words."
    }
  ]
}