{
  "entities": [
    {
      "name": "madam pomfrey",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Pomfrey is described as the matron who is kept busy by a sudden spate of colds among the staff and students. She is also mentioned to have created a potion called Pepperup Potion."
    },
    {
      "name": "pepperup potion",
      "entity_type": "potion",
      "singular": true,
      "description": "Pepperup Potion is described as working instantly, but leaving the drinker smoking at the ears for several hours afterwards. It was created by Madam Pomfrey."
    },
    {
      "name": "ginny weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny Weasley is described as looking peaky and being bullied into taking some Pepperup Potion by Percy. She has vivid hair that gives the impression of her whole head being on fire when she takes the potion."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is described as bullying Ginny Weasley into taking some Pepperup Potion."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid's pumpkins are mentioned to have swelled to the size of garden sheds due to the rain."
    },
    {
      "name": "oliver wood",
      "entity_type": "person",
      "singular": true,
      "description": "Oliver Wood is described as having enthusiasm for regular training sessions, which is why Harry was found returning to Gryffindor Tower late one stormy Saturday afternoon."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned to be returning to Gryffindor Tower late one stormy Saturday afternoon, drenched to the skin."
    }
  ],
  "relationships": [
    {
      "entity_1": "madam pomfrey",
      "entity_2": "pepperup potion",
      "relationship_type": "created",
      "description": "Madam Pomfrey created Pepperup Potion, which is described as working instantly but leaving the drinker smoking at the ears for several hours afterwards."
    },
    {
      "entity_1": "percy",
      "entity_2": "ginny weasley",
      "relationship_type": "bullied",
      "description": "Percy bullied Ginny Weasley into taking some Pepperup Potion."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "pumpkins",
      "relationship_type": "owned",
      "description": "Hagrid's pumpkins swelled to the size of garden sheds due to the rain."
    },
    {
      "entity_1": "oliver wood",
      "entity_2": "harry",
      "relationship_type": "influenced",
      "description": "Oliver Wood's enthusiasm for regular training sessions is why Harry was found returning to Gryffindor Tower late one stormy Saturday afternoon."
    }
  ]
}