{
  "entities": [
    {
      "name": "whomping willow",
      "entity_type": "tree",
      "singular": true,
      "description": "The Whomping Willow is a magical tree that is mentioned in the text. It is described as being 61 years old and is likely a significant landmark at Hogwarts School of Witchcraft and Wizardry."
    },
    {
      "name": "harry potter",
      "entity_type": "student",
      "singular": true,
      "description": "Harry Potter is the main character of the story. He is called over to look at the Sorting Hat with Ron."
    },
    {
      "name": "ron weasley",
      "entity_type": "student",
      "singular": true,
      "description": "Ron Weasley is Harry's friend and a student at Hogwarts School of Witchcraft and Wizardry."
    },
    {
      "name": "great hall",
      "entity_type": "location",
      "singular": true,
      "description": "The Great Hall is the main dining hall at Hogwarts School of Witchcraft and Wizardry. It is described as having innumerable candles hovering in mid-air over four long tables."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "teacher",
      "singular": true,
      "description": "Professor McGonagall is a bespectacled witch who is placing the Sorting Hat on a stool before the newcomers. She has her hair in a tight bun."
    },
    {
      "name": "harry potter (again)",
      "entity_type": "student",
      "singular": true,
      "description": "Harry Potter is mentioned again as remembering how the Sorting Hat works."
    },
    {
      "name": "gryffindor",
      "entity_type": "house",
      "singular": true,
      "description": "Gryffindor is one of the four houses at Hogwarts School of Witchcraft and Wizardry. It is mentioned as being one of the houses that the Sorting Hat sorts students into."
    },
    {
      "name": "hufflepuff",
      "entity_type": "house",
      "singular": true,
      "description": "Hufflepuff is another house at Hogwarts School of Witchcraft and Wizardry. It is mentioned alongside Gryffindor as being one of the houses that the Sorting Hat sorts students into."
    },
    {
      "name": "ravenclaw",
      "entity_type": "house",
      "singular": true,
      "description": "Ravenclaw is a house at Hogwarts School of Witchcraft and Wizardry. It is mentioned alongside Gryffindor and Hufflepuff as being one of the houses that the Sorting Hat sorts students into."
    },
    {
      "name": "slytherin",
      "entity_type": "house",
      "singular": true,
      "description": "Slytherin is a house at Hogwarts School of Witchcraft and Wizardry. It is mentioned alongside Gryffindor, Hufflepuff, and Ravenclaw as being one of the houses that the Sorting Hat sorts students into."
    },
    {
      "name": "ginny weasley",
      "entity_type": "student",
      "singular": true,
      "description": "Ginny Weasley is a student at Hogwarts School of Witchcraft and Wizardry. She is mentioned as being amongst the first-years filing into the Great Hall."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "great hall",
      "relationship_type": "location_of",
      "description": "Harry Potter looks at the Sorting Hat with Ron in the Great Hall."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "sorting hat",
      "relationship_type": "placement_of",
      "description": "Professor McGonagall places the Sorting Hat on a stool before the newcomers."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "ginny weasley",
      "relationship_type": "friendship_with",
      "description": "Harry Potter is friends with Ginny Weasley, who is amongst the first-years filing into the Great Hall."
    }
  ]
}