{
  "entities": [
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is described as one of Harry's friends who finds the situation funny and teases him about being Slytherin's heir. He shouts 'Make way for the heir of Slytherin, seriously evil wizard coming through...'"
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is described as one of Harry's friends who finds the situation funny and teases him about being Slytherin's heir. He pretends to ward Harry off with a large clove of garlic."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as the main character who is being teased by Fred and George about being Slytherin's heir. He is in a hurry and is planning to go to the Chamber of Secrets for a cup of tea with his fanged servant."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is described as Harry's disapproving relative who thinks Fred and George's behavior is not funny. He says 'It is not a laughing matter.'"
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is described as one of Harry's friends who doesn't find the situation amusing. She wails every time Fred asks Harry loudly who he is planning to attack next."
    },
    {
      "name": "slytherin",
      "entity_type": "house",
      "singular": true,
      "description": "Slytherin is described as a house at Hogwarts that Harry is supposedly the heir of. Fred and George think it's ludicrous."
    }
  ],
  "relationships": [
    {
      "entity_1": "fred",
      "entity_2": "harry",
      "relationship_type": "teasing",
      "description": "Fred teases Harry about being Slytherin's heir by shouting 'Make way for the heir of Slytherin, seriously evil wizard coming through...'"
    },
    {
      "entity_1": "george",
      "entity_2": "harry",
      "relationship_type": "teasing",
      "description": "George teases Harry about being Slytherin's heir by pretending to ward him off with a large clove of garlic."
    },
    {
      "entity_1": "percy",
      "entity_2": "fred and george",
      "relationship_type": "disapproval",
      "description": "Percy disapproves of Fred and George's behavior saying 'It is not a laughing matter.'"
    },
    {
      "entity_1": "ginny",
      "entity_2": "fred",
      "relationship_type": "distress",
      "description": "Ginny is distressed every time Fred asks Harry loudly who he is planning to attack next."
    },
    {
      "entity_1": "harry",
      "entity_2": "slytherin",
      "relationship_type": "heirship",
      "description": "Harry is described as the heir of Slytherin, although Fred and George think it's ludicrous."
    }
  ]
}