{
  "entities": [
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a student who is working on his homework. He is described as grabbing the tape measure and unrolling his own homework."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as Harry's friend who is also working on his homework. He is described as letting go of his parchment and scribbling away."
    },
    {
      "name": "hermione granger",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as a student who has completed her homework and is looking for another book to read. She is described as emerging from between the bookshelves and looking irritable."
    },
    {
      "name": "professor binns",
      "entity_type": "teacher",
      "singular": true,
      "description": "Professor Binns is mentioned as assigning a three-foot long composition on ‘The Medieval Assembly of European Wizards’."
    },
    {
      "name": "lockhart",
      "entity_type": "person",
      "singular": true,
      "description": "Lockhart is mentioned as someone who is being talked about by Ron. He is described as being considered great by Justin Finch-Fletchley."
    },
    {
      "name": "justin finch-fletchley",
      "entity_type": "person",
      "singular": true,
      "description": "Justin is mentioned as running away from Harry and talking about Lockhart being great."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "hermione granger",
      "relationship_type": "comparative_size",
      "description": "Harry compares the size of his homework to Hermione's, saying she has done four feet seven inches and her writing is tiny."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "harry potter",
      "relationship_type": "concerned_about",
      "description": "Ron shows concern for Harry when he tells him about Justin running away from him."
    },
    {
      "entity_1": "hermione granger",
      "entity_2": "book",
      "relationship_type": "looking_for",
      "description": "Hermione is described as looking for another book to read."
    }
  ]
}