{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who had bustled off to check on the Polyjuice Potion again. She is described as having a plan that went smoothly."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as turning to Harry with a doom-laden expression and later whispering ecstatically about Crabbe and Goyle's stupidity."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who had perched the chocolate cakes on the end of the banisters and hid behind a suit of armour next to the front door with Ron."
    },
    {
      "name": "polyjuice potion",
      "entity_type": "object",
      "singular": true,
      "description": "The Polyjuice Potion is mentioned as something Hermione had bustled off to check on again."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is mentioned as someone who remained alone at the Slytherin table and later pointed out the chocolate cakes to Goyle."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is mentioned as someone who remained alone at the Slytherin table with Crabbe and later stuffed the chocolate cakes whole into his mouth."
    },
    {
      "name": "slytherin",
      "entity_type": "house",
      "singular": true,
      "description": "Slytherin is mentioned as a house where Crabbe and Goyle remained alone at the table."
    },
    {
      "name": "chocolate cakes",
      "entity_type": "object",
      "singular": false,
      "description": "The chocolate cakes are mentioned as something Harry perched on the end of the banisters and later Crabbe and Goyle ate greedily."
    },
    {
      "name": "entrance hall",
      "entity_type": "location",
      "singular": true,
      "description": "The Entrance Hall is mentioned as a place where Harry and Ron lurked in after Christmas tea, waiting for Crabbe and Goyle."
    },
    {
      "name": "great hall",
      "entity_type": "location",
      "singular": true,
      "description": "The Great Hall is mentioned as a place from which Crabbe and Goyle came out of to spot the chocolate cakes on the banisters."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "crabbe",
      "relationship_type": "amazed_by",
      "description": "Ron was amazed by how stupid Crabbe and Goyle were for eating the chocolate cakes whole without checking if they were poisoned."
    },
    {
      "entity_1": "harry",
      "entity_2": "goyle",
      "relationship_type": "amazed_by",
      "description": "Harry was also amazed by how stupid Goyle was for eating the chocolate cakes whole without checking if they were poisoned."
    }
  ]
}