{
  "entities": [
    {
      "name": "dron",
      "entity_type": "person",
      "singular": true,
      "description": "Dron is mentioned as a person who started towards Malfoy but was grabbed by Harry and Hermione. (\"dron, too, and started towards Malfoy\")"
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as the one that dron started towards. He is also mentioned with his son Draco. (\"towards Malfoy\", \"Mr Malfoy . He stood with his hand on Draco’s shoulder\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as one of the people who grabbed dron's jacket. (\"Harry and Hermione grabbed the back of his jacket\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as one of the people who grabbed dron's jacket. (\"Harry and Hermione grabbed the back of his jacket\")"
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as someone who helped Mr Weasley struggle over to grab dron. (\"struggling over with Fred and George\")"
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as someone who helped Mr Weasley struggle over to grab dron. (\"struggling over with Fred and George\")"
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr Weasley is mentioned as the one who struggled over to grab dron along with his sons Fred and George. (\"‘Ron!’ said Mr Weasley , struggling over with Fred and George\")"
    },
    {
      "name": "draco",
      "entity_type": "person",
      "singular": true,
      "description": "Draco is mentioned as Malfoy's son who stood next to him. (\"He stood with his hand on Draco’s shoulder\")"
    },
    {
      "name": "arthur weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur Weasley is mentioned as Mr Weasley. He is also mentioned in a separate sentence. (\"‘Well, well, well – Arthur Weasley .’ It was Mr Malfoy\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "dron",
      "relationship_type": "grabbed",
      "description": "Harry and Hermione grabbed the back of dron's jacket. (\"‘Harry and Hermione grabbed the back of his jacket.\")"
    },
    {
      "entity_1": "mr weasley",
      "entity_2": "dron",
      "relationship_type": "grabbed",
      "description": "Mr Weasley struggled over to grab dron along with Fred and George. (\"struggling over with Fred and George\")"
    },
    {
      "entity_1": "malfoy",
      "entity_2": "draco",
      "relationship_type": "stood_with",
      "description": "Malfoy stood next to his son Draco. (\"He stood with his hand on Draco’s shoulder\")"
    }
  ]
}