{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as one of the characters in the story. He is referred to by name and is described as sitting down with Ron."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as one of the characters in the story. He is referred to by name and is described as sitting down with Harry."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as a character in the story. He is referred to by name and is described as going to get something for Harry and Ron."
    },
    {
      "name": "daily prophet",
      "entity_type": "newspaper",
      "singular": true,
      "description": "The Daily Prophet is mentioned as a newspaper that has published an article about Arthur Weasley's fine."
    },
    {
      "name": "arthur weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Arthur Weasley is mentioned in the story as being fined for bewitching a Muggle car. He is referred to by name and title (Head of the Misuse of Muggle Artefacts Office)."
    },
    {
      "name": "lucius malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Lucius Malfoy is mentioned in the story as being a governor of Hogwarts School of Witchcraft and Wizardry. He is referred to by name and title."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "sat_with",
      "description": "Harry and Ron are described as sitting down together in the story."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "daily prophet",
      "relationship_type": "got_from",
      "description": "Malfoy is described as going to get something from the Daily Prophet, which he then shows to Harry and Ron."
    },
    {
      "entity_1": "arthur weasley",
      "entity_2": "daily prophet",
      "relationship_type": "mentioned_in",
      "description": "Arthur Weasley is mentioned in an article published in the Daily Prophet."
    },
    {
      "entity_1": "lucius malfoy",
      "entity_2": "hogwarts school of witchcraft and wizardry",
      "relationship_type": "governor_of",
      "description": "Lucius Malfoy is described as being a governor of Hogwarts School of Witchcraft and Wizardry."
    }
  ]
}