{
  "entities": [
    {
      "name": "cornelius fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Cornelius Fudge is mentioned as the headmaster who is being threatened and blackmailed by Malfoy. He is described as having a temper that will lead him into trouble one of these days."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as having a temper and shouting at the Azkaban guards. He is also mentioned as being against Dumbledore's removal."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone who will not be removed by the governors. He is described as having bright blue eyes that are locked on Lucius Malfoy's cold grey ones."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as someone who is blackmailing and threatening Cornelius Fudge. He is also described as having a cold grey gaze that Dumbledore locks onto."
    },
    {
      "name": "fang",
      "entity_type": "animal",
      "singular": true,
      "description": "Fang is mentioned as the boarhound that cowers and whimpers in his basket when Hagrid yells."
    },
    {
      "name": "azkaban guards",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "The Azkaban guards are mentioned as people who will not like it if Hagrid shouts at them."
    },
    {
      "name": "muggle-borns",
      "entity_type": "group_of_people",
      "singular": false,
      "description": "Muggle-borns are mentioned as a group of people who will stand no chance if Dumbledore is removed."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "malfoy",
      "relationship_type": "threatens",
      "description": "Hagrid threatens Malfoy, saying 'Yeh can't take Dumbledore!' and making Fang cower in his basket."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "lucius malfoy",
      "relationship_type": "locks_gaze_on",
      "description": "Dumbledore locks his bright blue eyes onto Lucius Malfoy's cold grey ones, indicating a tense and confrontational relationship between the two."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "dumbledore",
      "relationship_type": "supports",
      "description": "Hagrid supports Dumbledore by saying 'Yeh can't take him away' and warning of killings if he is removed."
    }
  ]
}