{
  "entities": [
    {
      "name": "nearly headless nick",
      "entity_type": "character",
      "singular": true,
      "description": "Nearly Headless Nick is a ghost who works as the Gryffindor house's Fat Friar's assistant. He is described as having been hit forty-five times in the neck with a blunt axe and not being able to join the Headless Hunt due to not fulfilling requirements."
    },
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "Harry is a young boy who can see right through Nearly Headless Nick. He is described as looking troubled by Nick's situation."
    },
    {
      "name": "the headless hunt",
      "entity_type": "organization",
      "singular": true,
      "description": "The Headless Hunt is an organization that consists of ghosts who have had their heads cut off. Nearly Headless Nick wants to join it but is not allowed due to not fulfilling requirements."
    },
    {
      "name": "the gryffindor house",
      "entity_type": "location",
      "singular": true,
      "description": "The Gryffindor house is a location where Nearly Headless Nick works as the Fat Friar's assistant."
    }
  ],
  "relationships": [
    {
      "entity_1": "nearly headless nick",
      "entity_2": "the headless hunt",
      "relationship_type": "want_to_join",
      "description": "Nearly Headless Nick wants to join the Headless Hunt but is not allowed due to not fulfilling requirements. He says 'I thought I’d apply, but apparently I “don’t fulfil requirements”.'"
    },
    {
      "entity_1": "nearly headless nick",
      "entity_2": "harry",
      "relationship_type": "can_see_through",
      "description": "Harry can see right through Nearly Headless Nick. He says 'He was pale as smoke, and Harry could see right through him to the dark sky and torrential rain outside.'"
    },
    {
      "entity_1": "nearly headless nick",
      "entity_2": "harry",
      "relationship_type": "can_see_troubled",
      "description": "Harry can see that Nearly Headless Nick is troubled. He says 'You look troubled, young Potter,'"
    }
  ]
}