{
  "entities": [
    {
      "name": "eton",
      "entity_type": "school",
      "singular": true,
      "description": "The speaker mentions that their name was down for Eton, indicating it is a prestigious school they were considering attending."
    },
    {
      "name": "lockhart's books",
      "entity_type": "books",
      "singular": false,
      "description": "The speaker mentions Lockhart's books, which suggests that the books are written by a person named Lockhart and are being read by the mother to understand the value of having a wizard in the family."
    },
    {
      "name": "mother",
      "entity_type": "person",
      "singular": true,
      "description": "The speaker mentions their mother, who is slightly disappointed that they did not attend Eton but has begun to see the benefits of having a fully trained wizard in the family after reading Lockhart's books."
    },
    {
      "name": "i",
      "entity_type": "person",
      "singular": true,
      "description": "The speaker mentions themselves, indicating that they are a person who is glad they came to Hogwarts instead of Eton."
    }
  ],
  "relationships": [
    {
      "entity_1": "eton",
      "entity_2": "i",
      "relationship_type": "considered_attending",
      "description": "The speaker mentions that their name was down for Eton, indicating a relationship between the speaker and Eton where they were considering attending."
    },
    {
      "entity_1": "lockhart's books",
      "entity_2": "mother",
      "relationship_type": "read_by",
      "description": "The speaker mentions that their mother read Lockhart's books, indicating a relationship between the mother and the books where she is reading them."
    },
    {
      "entity_1": "i",
      "entity_2": "eton",
      "relationship_type": "rejected_in_favor_of",
      "description": "The speaker mentions that they are glad they came to Hogwarts instead of Eton, indicating a relationship between the speaker and Eton where they rejected attending in favor of coming to Hogwarts."
    },
    {
      "entity_1": "mother",
      "entity_2": "lockhart's books",
      "relationship_type": "influenced_by",
      "description": "The speaker mentions that their mother has begun to see the benefits of having a fully trained wizard in the family after reading Lockhart's books, indicating a relationship between the mother and the books where she was influenced by them."
    }
  ]
}