{
  "entities": [
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story. He is mentioned as 'Harry' throughout the text."
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "A person who is part of Harry's group. She is mentioned as giving instructions to Ginny and warning the twins not to go down Knockturn Alley."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Weasley's daughter, who is part of Harry's group. She is mentioned as going off with Mrs Weasley at the beginning of the text."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "One of Harry's friends. He is mentioned as strolling off along the street with Harry and Hermione."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "One of Harry's friends. She is mentioned as dragging Ron away from a shop window to buy ink and parchment next door."
    },
    {
      "name": "knockturn alley",
      "entity_type": "location",
      "singular": false,
      "description": "A street in the wizarding world where shops are located. It is mentioned as being off-limits by Mrs Weasley."
    },
    {
      "name": "chudley cannon robes",
      "entity_type": "item",
      "singular": true,
      "description": "A set of Quidditch robes that Ron longingly looks at in a shop window."
    },
    {
      "name": "quality quidditch supplies",
      "entity_type": "store",
      "singular": false,
      "description": "A store where Harry, Ron, and Hermione go to buy things. It is mentioned as having Chudley Cannon robes in the window."
    },
    {
      "name": "gambol and japes wizarding joke shop",
      "entity_type": "store",
      "singular": false,
      "description": "A store where Harry, Ron, and Hermione meet Fred, George, and Lee Jordan. It is mentioned as selling 'Dr Filibuster's Fabulous Wet-Start, No-Heat Fireworks'."
    },
    {
      "name": "dr filibuster's fabulous wet-start, no-heat fireworks",
      "entity_type": "item",
      "singular": true,
      "description": "A type of firework that Fred, George, and Lee Jordan are stocking up on in Gambol and Japes Wizarding Joke Shop."
    },
    {
      "name": "fred jordan",
      "entity_type": "person",
      "singular": true,
      "description": "One of the twins who is part of Harry's group. He is mentioned as being in Gambol and Japes Wizarding Joke Shop with his brother George."
    },
    {
      "name": "george jordan",
      "entity_type": "person",
      "singular": true,
      "description": "One of the twins who is part of Harry's group. He is mentioned as being in Gambol and Japes Wizarding Joke Shop with his brother Fred."
    },
    {
      "name": "lee jordan",
      "entity_type": "person",
      "singular": true,
      "description": "A person who is part of Harry's group. He is mentioned as being in Gambol and Japes Wizarding Joke Shop with the twins."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "mrs weasley",
      "relationship_type": "associated_with",
      "description": "Harry Potter is associated with Mrs Weasley, as they are both part of the same group and she gives instructions to him at the beginning of the text."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "ginny",
      "relationship_type": "associated_with",
      "description": "Harry Potter is associated with Ginny, as they are both part of the same group and she goes off with Mrs Weasley at the beginning of the text."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "ron",
      "relationship_type": "associated_with",
      "description": "Harry Potter is associated with Ron, as they are both part of the same group and strolling off along the street together at the beginning of the text."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "hermione",
      "relationship_type": "associated_with",
      "description": "Harry Potter is associated with Hermione, as they are both part of the same group and strolling off along the street together at the beginning of the text."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry potter",
      "relationship_type": "associated_with",
      "description": "Ron is associated with Harry Potter, as they are both part of the same group and strolling off along the street together at the beginning of the text."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "associated_with",
      "description": "Ron is associated with Hermione, as they are both part of the same group and strolling off along the street together at the beginning of the text."
    },
    {
      "entity_1": "hermione",
      "entity_2": "harry potter",
      "relationship_type": "associated_with",
      "description": "Hermione is associated with Harry Potter, as they are both part of the same group and strolling off along the street together at the beginning of the text."
    },
    {
      "entity_1": "hermione",
      "entity_2": "ron",
      "relationship_type": "associated_with",
      "description": "Hermione is associated with Ron, as they are both part of the same group and strolling off along the street together at the beginning of the text."
    },
    {
      "entity_1": "fred jordan",
      "entity_2": "gambol and japes wizarding joke shop",
      "relationship_type": "associated_with",
      "description": "Fred Jordan is associated with Gambol and Japes Wizarding Joke Shop, as he is stocking up on 'Dr Filibuster's Fabulous Wet-Start, No-Heat Fireworks' there."
    },
    {
      "entity_1": "george jordan",
      "entity_2": "gambol and japes wizarding joke shop",
      "relationship_type": "associated_with",
      "description": "George Jordan is associated with Gambol and Japes Wizarding Joke Shop, as he is stocking up on 'Dr Filibuster's Fabulous Wet-Start, No-Heat Fireworks' there."
    },
    {
      "entity_1": "lee jordan",
      "entity_2": "gambol and japes wizarding joke shop",
      "relationship_type": "associated_with",
      "description": "Lee Jordan is associated with Gambol and Japes Wizarding Joke Shop, as he is stocking up on 'Dr Filibuster's Fabulous Wet-Start, No-Heat Fireworks' there."
    }
  ]
}