{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a gamekeeper at Hogwarts and is known for his love of magical creatures. He is described as proudly making Hermione go a brilliant shade of magenta."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a student at Hogwarts and is known for her exceptional magical abilities. She is described as being made to go a brilliant shade of magenta by Hagrid."
    },
    {
      "name": "neville longbottom",
      "entity_type": "person",
      "singular": true,
      "description": "Neville Longbottom is a pure-blood wizard who is struggling with magic. He is mentioned as an example of someone who doesn't have to be a good wizard just because they are pure-blood."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is a student at Hogwarts and is known for his loyalty and bravery. He is described as wiping his sweaty brow with a shaking hand."
    },
    {
      "name": "lucius malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Lucius Malfoy is the father of Draco Malfoy and is a pure-blood wizard. He is mentioned as someone who would come marching up to school if Ron had cursed his son."
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Draco Malfoy is the son of Lucius Malfoy and is a Slytherin student at Hogwarts. He is mentioned as someone who would be in trouble if Ron had cursed him."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "hermione",
      "relationship_type": "made_to_go_magenta",
      "description": "Hagrid makes Hermione go a brilliant shade of magenta."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "lucius malfoy",
      "relationship_type": "would_have_cursed",
      "description": "Ron would have cursed Lucius Malfoy's son if his wand hadn't backfired."
    }
  ]
}