{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as speaking to Harry and explaining why he was placed in Gryffindor. He is described as beaming and having a moustache that quivers."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who is being spoken to by Dumbledore. He is mentioned as having determination and resourcefulness."
    },
    {
      "name": "gryffindor",
      "entity_type": "house",
      "singular": true,
      "description": "Gryffindor is a house at Hogwarts that Harry is a part of. It is mentioned as being associated with bravery and daring."
    },
    {
      "name": "tom riddle",
      "entity_type": "person",
      "singular": true,
      "description": "Tom Riddle is mentioned as someone who was placed in Slytherin, unlike Harry who asked not to go there."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "teacher",
      "singular": true,
      "description": "Professor McGonagall is mentioned as having a desk where Dumbledore picks up the blood-stained silver sword from."
    },
    {
      "name": "godric gryffindor",
      "entity_type": "person",
      "singular": true,
      "description": "Godric Gryffindor is mentioned as being associated with the blood-stained silver sword that Harry sees engraved on it."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "speaks_to",
      "description": "Dumbledore speaks to Harry and explains why he was placed in Gryffindor."
    },
    {
      "entity_1": "harry",
      "entity_2": "gryffindor",
      "relationship_type": "belongs_to",
      "description": "Harry is a part of the house Gryffindor at Hogwarts."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "professor mcgonagall",
      "relationship_type": "reaches_across_desk_of",
      "description": "Dumbledore reaches across Professor McGonagall's desk to pick up the blood-stained silver sword."
    },
    {
      "entity_1": "harry",
      "entity_2": "godric gryffindor",
      "relationship_type": "associated_with",
      "description": "Harry is associated with Godric Gryffindor through the blood-stained silver sword that he sees engraved on it."
    }
  ]
}