{
  "entities": [
    {
      "name": "severus",
      "entity_type": "person",
      "singular": true,
      "description": "Severus is mentioned as the one who wants to take Harry off the Gryffindor Quidditch team until he is ready to tell the whole story. He is described as saying 'Really' in response to Professor McGonagall's comment."
    },
    {
      "name": "gryffindor",
      "entity_type": "team",
      "singular": true,
      "description": "Gryffindor Quidditch team is mentioned as the one that Harry is a part of. Severus wants him taken off this team until he is ready to tell the whole story."
    },
    {
      "name": "potter",
      "entity_type": "person",
      "singular": true,
      "description": "Potter is mentioned as another name for Harry. Professor McGonagall mentions that there is no evidence at all that Potter was hit over the head with a broomstick."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as saying 'Really' in response to Severus's comment. She also mentions that there is no evidence at all that Potter was hit over the head with a broomstick."
    },
    {
      "name": "quidditch",
      "entity_type": "sport",
      "singular": true,
      "description": "Quidditch team is mentioned as the one that Harry is a part of. Severus wants him taken off this team until he is ready to tell the whole story."
    }
  ],
  "relationships": [
    {
      "entity_1": "severus",
      "entity_2": "gryffindor",
      "relationship_type": "membership",
      "description": "Severus wants Harry, who is a part of Gryffindor Quidditch team, to be taken off the team until he is ready to tell the whole story."
    },
    {
      "entity_1": "severus",
      "entity_2": "potter",
      "relationship_type": "membership",
      "description": "Severus wants Harry, who is also known as Potter, to be taken off Gryffindor Quidditch team until he is ready to tell the whole story."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "potter",
      "relationship_type": "involvement",
      "description": "Professor McGonagall mentions that there is no evidence at all that Potter was hit over the head with a broomstick, indicating her involvement in the situation."
    },
    {
      "entity_1": "severus",
      "entity_2": "professor mcgonagall",
      "relationship_type": "disagreement",
      "description": "Severus and Professor McGonagall have different opinions on whether Harry should be taken off Gryffindor Quidditch team until he is ready to tell the whole story."
    }
  ]
}