{
  "entities": [
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as a teacher who flared her nostrils and gave instructions to other teachers. She is described as 'whose nostrils were flared'."
    },
    {
      "name": "heads of houses",
      "entity_type": "group",
      "singular": false,
      "description": "The Heads of Houses are mentioned as a group that should inform their students about the situation. They are not explicitly named but referred to as a collective entity."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as one of the students who sat in the Gryffindor common room with Ron, Fred, and George. He is described as unable to say anything to his friends."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is mentioned as one of Harry's friends who sat in the Gryffindor common room with him, Fred, and George. He is described as unable to say anything to his friends."
    },
    {
      "name": "fred weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Fred Weasley is mentioned as one of Harry's friends who sat in the Gryffindor common room with him, Ron, and George. He went up to bed unable to sit there any longer."
    },
    {
      "name": "george weasley",
      "entity_type": "person",
      "singular": true,
      "description": "George Weasley is mentioned as one of Harry's friends who sat in the Gryffindor common room with him, Ron, and Fred. He went up to bed unable to sit there any longer."
    },
    {
      "name": "percy weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Percy Weasley is mentioned as one of Harry's friends who was not present in the Gryffindor common room. He had gone to send an owl to Mr and Mrs Weasley."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr Weasley is mentioned as Percy's father whom Percy sent an owl to inform about the situation."
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Weasley is mentioned as Mr Weasley's wife whom Percy sent an owl to inform about the situation."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "heads of houses",
      "relationship_type": "instructed",
      "description": "Professor McGonagall instructed the Heads of Houses to inform their students about the situation."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "harry potter",
      "relationship_type": "concerned",
      "description": "Professor McGonagall was concerned about Harry Potter's well-being and gave instructions to other teachers to inform him about the situation."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "harry potter",
      "relationship_type": "friend",
      "description": "Ron Weasley is a friend of Harry Potter who sat with him in the Gryffindor common room."
    },
    {
      "entity_1": "fred weasley",
      "entity_2": "harry potter",
      "relationship_type": "friend",
      "description": "Fred Weasley is a friend of Harry Potter who sat with him in the Gryffindor common room."
    },
    {
      "entity_1": "george weasley",
      "entity_2": "harry potter",
      "relationship_type": "friend",
      "description": "George Weasley is a friend of Harry Potter who sat with him in the Gryffindor common room."
    },
    {
      "entity_1": "percy weasley",
      "entity_2": "mr weasley",
      "relationship_type": "child",
      "description": "Percy Weasley is the child of Mr Weasley whom he sent an owl to inform about the situation."
    },
    {
      "entity_1": "percy weasley",
      "entity_2": "mrs weasley",
      "relationship_type": "child",
      "description": "Percy Weasley is the child of Mrs Weasley whom he sent an owl to inform about the situation."
    }
  ]
}