{
  "entities": [
    {
      "name": "slytherin",
      "entity_type": "person",
      "singular": true,
      "description": "Slytherin is mentioned as 'himself Serpent-tongue' indicating he has some sort of connection or reputation. (\"Slytherin himself Serpent-tongue.\")"
    },
    {
      "name": "ernie",
      "entity_type": "person",
      "singular": true,
      "description": "Ernie is a member of the Hufflepuffs and is speaking to his fellow students about Harry Potter. (\"There was some heavy murmuring at this, and Ernie went on,\")"
    },
    {
      "name": "hannah",
      "entity_type": "person",
      "singular": true,
      "description": "Hannah is a student who expresses uncertainty about Harry Potter's character. (\"He always seems so nice, though,\" said Hannah uncertainly, \"and, well, he’s the one who made You Know Who disappear.\")"
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as having a run-in with Filch and being attacked by You Know Who. (\"Potter had some sort of run-in with Filch. Next thing we know , Filch’s cat’s attacked.\")"
    },
    {
      "name": "filch",
      "entity_type": "person",
      "singular": true,
      "description": "Filch is mentioned as having a run-in with Harry Potter and his cat being attacked. (\"Potter had some sort of run-in with Filch. Next thing we know , Filch’s cat’s attacked.\")"
    },
    {
      "name": "creevey",
      "entity_type": "person",
      "singular": true,
      "description": "Creevey is a first-year student who was annoying Harry Potter at the Quidditch match and was later attacked. (\"That first-year, Creevey , was annoying Potter at the Quidditch match, taking pictures of him while he was lying in the mud.\")"
    },
    {
      "name": "you know who",
      "entity_type": "person",
      "singular": true,
      "description": "You Know Who is mentioned as being defeated by Harry Potter. (\"He can’t be all bad, can he?’ Ernie lowered his voice mysteriously , the Hufflepuffs bent closer, and Harry edged nearer so that he could catch Ernie’s words.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "ernie",
      "entity_2": "harry potter",
      "relationship_type": "speaks_about",
      "description": "Ernie is speaking about Harry Potter to his fellow students. (\"There was some heavy murmuring at this, and Ernie went on,\")"
    },
    {
      "entity_1": "ernie",
      "entity_2": "filch",
      "relationship_type": "mentions_in_connection_with",
      "description": "Ernie mentions Filch in connection with Harry Potter. (\"Potter had some sort of run-in with Filch.\")"
    },
    {
      "entity_1": "hannah",
      "entity_2": "harry potter",
      "relationship_type": "expresses_uncertainty_about",
      "description": "Hannah expresses uncertainty about Harry Potter's character. (\"He always seems so nice, though,\" said Hannah uncertainly, \"and, well, he’s the one who made You Know Who disappear.\")"
    },
    {
      "entity_1": "ernie",
      "entity_2": "hufflepuffs",
      "relationship_type": "speaks_to",
      "description": "Ernie is speaking to his fellow Hufflepuffs. (\"Ernie lowered his voice mysteriously , the Hufflepuffs bent closer,\")"
    },
    {
      "entity_1": "creevey",
      "entity_2": "harry potter",
      "relationship_type": "was_attacked_by",
      "description": "Creevey was attacked by Harry Potter. (\"That first-year, Creevey , was annoying Potter at the Quidditch match, taking pictures of him while he was lying in the mud.\")"
    },
    {
      "entity_1": "filch",
      "entity_2": "harry potter",
      "relationship_type": "had_run_in_with",
      "description": "Filch had a run-in with Harry Potter. (\"Potter had some sort of run-in with Filch.\")"
    }
  ]
}