{
  "entities": [
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as one of the twins who had been spying on the Slytherin team. He is described as being involved in an activity (spying) and having a specific role (reporting to Harry)."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as one of the twins who had been spying on the Slytherin team. He is described as being involved in an activity (spying) and having a specific role (reporting to Harry)."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who had been at the practice session. He is described as coming across Nearly Headless Nick in the corridor."
    },
    {
      "name": "nearly headless nick",
      "entity_type": "ghost",
      "singular": true,
      "description": "Nearly Headless Nick is mentioned as a ghost of Gryffindor Tower. He is described as staring morosely out of a window and muttering under his breath."
    },
    {
      "name": "slytherin team",
      "entity_type": "team",
      "singular": false,
      "description": "The Slytherin team is mentioned as being fast and skilled at flying on their new broomsticks. They are described as shooting through the air like jump-jets."
    }
  ],
  "relationships": [
    {
      "entity_1": "fred",
      "entity_2": "george",
      "relationship_type": "sibling",
      "description": "Fred and George are mentioned as twins, indicating a sibling relationship."
    },
    {
      "entity_1": "harry",
      "entity_2": "nearly headless nick",
      "relationship_type": "encounter",
      "description": "Harry comes across Nearly Headless Nick in the corridor, indicating an encounter between the two."
    },
    {
      "entity_1": "fred",
      "entity_2": "slytherin team",
      "relationship_type": "observed",
      "description": "Fred and George report on the speed of the Slytherin team, indicating that they observed them."
    },
    {
      "entity_1": "george",
      "entity_2": "slytherin team",
      "relationship_type": "observed",
      "description": "George reports on the speed of the Slytherin team, indicating that he observed them."
    }
  ]
}