{
  "entities": [
    {
      "name": "muggles",
      "entity_type": "people",
      "singular": false,
      "description": "The text mentions 'two Muggles' and 'six or seven Muggles', indicating that Muggles is a group of people. They are described as ordinary non-magical individuals who witnessed something unusual."
    },
    {
      "name": "london",
      "entity_type": "location",
      "singular": true,
      "description": "The text mentions 'London' as the location where two Muggles saw an old car flying over the Post Office tower. London is a city in England, UK."
    },
    {
      "name": "post office tower",
      "entity_type": "location",
      "singular": true,
      "description": "The text mentions 'the Post Office tower' as a location in London where two Muggles saw an old car flying. The Post Office Tower is a famous landmark in London."
    },
    {
      "name": "norfolk",
      "entity_type": "location",
      "singular": true,
      "description": "The text mentions 'Norfolk' as the location where Mrs Hetty Bayliss saw something unusual at noon. Norfolk is a county in England, UK."
    },
    {
      "name": "hetty bayliss",
      "entity_type": "people",
      "singular": true,
      "description": "The text mentions 'Mrs Hetty Bayliss' as one of the Muggles who saw something unusual. She is described as a person hanging out her washing at noon in Norfolk."
    },
    {
      "name": "angus fleet",
      "entity_type": "people",
      "singular": true,
      "description": "The text mentions 'Mr Angus Fleet' as one of the Muggles who reported to police. He is described as a person from Peebles."
    },
    {
      "name": "peebles",
      "entity_type": "location",
      "singular": true,
      "description": "The text mentions 'Peebles' as the location where Mr Angus Fleet is from. Peebles is a town in Scotland, UK."
    }
  ],
  "relationships": [
    {
      "entity_1": "muggles",
      "entity_2": "london",
      "relationship_type": "location_of",
      "description": "The text mentions that two Muggles saw an old car flying over the Post Office tower in London. This indicates a relationship between the Muggles and the location of London."
    },
    {
      "entity_1": "muggles",
      "entity_2": "post office tower",
      "relationship_type": "location_of",
      "description": "The text mentions that two Muggles saw an old car flying over the Post Office tower. This indicates a relationship between the Muggles and the location of the Post Office Tower."
    },
    {
      "entity_1": "hetty bayliss",
      "entity_2": "norfolk",
      "relationship_type": "location_of",
      "description": "The text mentions that Mrs Hetty Bayliss saw something unusual at noon in Norfolk. This indicates a relationship between Mrs Bayliss and the location of Norfolk."
    },
    {
      "entity_1": "angus fleet",
      "entity_2": "peebles",
      "relationship_type": "location_of",
      "description": "The text mentions that Mr Angus Fleet is from Peebles. This indicates a relationship between Mr Fleet and the location of Peebles."
    }
  ]
}