{
  "entities": [
    {
      "name": "gryffindor",
      "entity_type": "team",
      "singular": true,
      "description": "Gryffindor is mentioned as the team that Harry is a part of. (\"And you’re Gryffindor Seeker, aren’t you?‘ said Colin in awe.\")"
    },
    {
      "name": "colin",
      "entity_type": "person",
      "singular": true,
      "description": "Colin is mentioned as someone who is questioning Harry about being the Gryffindor Seeker. (‘And you’re Gryffindor Seeker, aren’t you?’ said Colin in awe.)"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the Gryffindor Seeker. (‘Yes,’ said Harry , as they left the castle and started across the dew-drenched grass.)"
    },
    {
      "name": "keeper",
      "entity_type": "position",
      "singular": true,
      "description": "The Keeper is mentioned as someone who guards the goalposts. (‘And there’s the Keeper, too. He guards the goalposts.’)"
    },
    {
      "name": "fred weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Fred Weasley is mentioned as one of the players on the Gryffindor team who are in the changing room. (The rest of the Gryffindor team were already in the changing room.)"
    },
    {
      "name": "george weasley",
      "entity_type": "person",
      "singular": true,
      "description": "George Weasley is mentioned as one of the players on the Gryffindor team who are in the changing room. (The rest of the Gryffindor team were already in the changing room.)"
    },
    {
      "name": "alicia spinnet",
      "entity_type": "person",
      "singular": true,
      "description": "Alicia Spinnet is mentioned as one of the Chasers on the Gryffindor team who are in the changing room. (The rest of the Gryffindor team were already in the changing room.)"
    },
    {
      "name": "katie bell",
      "entity_type": "person",
      "singular": true,
      "description": "Katie Bell is mentioned as one of the Chasers on the Gryffindor team who are in the changing room. (The rest of the Gryffindor team were already in the changing room.)"
    },
    {
      "name": "angelina johnson",
      "entity_type": "person",
      "singular": true,
      "description": "Angelina Johnson is mentioned as one of the Chasers on the Gryffindor team who are in the changing room. (The rest of the Gryffindor team were already in the changing room.)"
    },
    {
      "name": "wood",
      "entity_type": "person",
      "singular": true,
      "description": "Wood is mentioned as the person who looks truly awake in the changing room. (The rest of the Gryffindor team were already in the changing room. Wood was the only person who looked truly awake.)"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "gryffindor",
      "relationship_type": "member_of",
      "description": "Harry is a member of the Gryffindor team. (‘And you’re Gryffindor Seeker, aren’t you?’ said Colin in awe.)"
    },
    {
      "entity_1": "colin",
      "entity_2": "harry",
      "relationship_type": "questioning",
      "description": "Colin is questioning Harry about being the Gryffindor Seeker. (‘And you’re Gryffindor Seeker, aren’t you?’ said Colin in awe.)"
    },
    {
      "entity_1": "wood",
      "entity_2": "gryffindor",
      "relationship_type": "coach_of",
      "description": "Wood is the coach of the Gryffindor team. (The rest of the Gryffindor team were already in the changing room. Wood was the only person who looked truly awake.)"
    },
    {
      "entity_1": "fred weasley",
      "entity_2": "gryffindor",
      "relationship_type": "member_of",
      "description": "Fred Weasley is a member of the Gryffindor team. (The rest of the Gryffindor team were already in the changing room.)"
    },
    {
      "entity_1": "george weasley",
      "entity_2": "gryffindor",
      "relationship_type": "member_of",
      "description": "George Weasley is a member of the Gryffindor team. (The rest of the Gryffindor team were already in the changing room.)"
    },
    {
      "entity_1": "alicia spinnet",
      "entity_2": "gryffindor",
      "relationship_type": "member_of",
      "description": "Alicia Spinnet is a member of the Gryffindor team. (The rest of the Gryffindor team were already in the changing room.)"
    },
    {
      "entity_1": "katie bell",
      "entity_2": "gryffindor",
      "relationship_type": "member_of",
      "description": "Katie Bell is a member of the Gryffindor team. (The rest of the Gryffindor team were already in the changing room.)"
    },
    {
      "entity_1": "angelina johnson",
      "entity_2": "gryffindor",
      "relationship_type": "member_of",
      "description": "Angelina Johnson is a member of the Gryffindor team. (The rest of the Gryffindor team were already in the changing room.)"
    }
  ]
}