{
  "entities": [
    {
      "name": "madam pince",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Pince is the librarian of Hogwarts. She is mentioned as someone to hand a book back in to."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron Weasley is one of Harry's best friends and a student at Hogwarts. He is mentioned as being hesitant about breaking rules."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is the main protagonist and a student at Hogwarts. He is mentioned as asking how long it will take to make something."
    },
    {
      "name": "hermione granger",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione Granger is one of Harry's best friends and a student at Hogwarts. She is mentioned as opening the book again and checking that the coast is clear."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is a student at Hogwarts who is known for being mean to Muggle-borns. He is mentioned as someone Ron is worried about attacking half of the Muggle-borns in the school by the time they finish making something."
    },
    {
      "name": "fluxweed",
      "entity_type": "plant",
      "singular": true,
      "description": "Fluxweed is a plant that has to be picked at the full moon. It is mentioned as one of the ingredients needed for something."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron weasley",
      "entity_2": "harry potter",
      "relationship_type": "mutual_support",
      "description": "Ron and Harry are supporting each other in their plan to make something, as evidenced by Ron's comment 'But it's the best plan we've got, so full steam ahead, I say.'"
    },
    {
      "entity_1": "hermione granger",
      "entity_2": "book",
      "relationship_type": "has",
      "description": "Hermione has a book that she is checking to see if it is clear for them to leave the bathroom."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "malfoy",
      "relationship_type": "concerned_about",
      "description": "Ron is concerned about Malfoy attacking half of the Muggle-borns in the school by the time they finish making something."
    }
  ]
}