{
  "entities": [
    {
      "name": "gnome",
      "entity_type": "gnomes",
      "singular": false,
      "description": "The text describes gnomes as small creatures that can fly and have razor-sharp teeth. They are being caught by Harry, Fred, George, and Ron in a game of 'de-gnoming'."
    },
    {
      "name": "fred",
      "entity_type": "people",
      "singular": true,
      "description": "Fred is one of the players who is participating in the game of de-gnoming. He claims he can get his gnome beyond a stump."
    },
    {
      "name": "harry",
      "entity_type": "people",
      "singular": true,
      "description": "Harry is another player who is participating in the game of de-gnoming. He learns to drop the gnomes over the hedge instead of trying to catch them."
    },
    {
      "name": "george",
      "entity_type": "people",
      "singular": true,
      "description": "George is one of the players who is participating in the game of de-gnoming. He claims that gnomes are not too bright and will storm up to have a look when they know the de-gnoming is on."
    },
    {
      "name": "ron",
      "entity_type": "people",
      "singular": true,
      "description": "Ron is one of the players who is participating in the game of de-gnoming. He claims that the gnomes will be back and that they love it."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "gnome",
      "relationship_type": "catches",
      "description": "Harry is catching gnomes in the game of de-gnoming. The text describes how Harry has a hard job shaking off one gnome that sinks its teeth into his finger."
    },
    {
      "entity_1": "fred",
      "entity_2": "gnome",
      "relationship_type": "catches",
      "description": "Fred is also catching gnomes in the game of de-gnoming. He claims he can get his gnome beyond a stump."
    },
    {
      "entity_1": "george",
      "entity_2": "gnome",
      "relationship_type": "catches",
      "description": "George is catching multiple gnomes at once in the game of de-gnoming. He claims that gnomes are not too bright and will storm up to have a look when they know the de-gnoming is on."
    },
    {
      "entity_1": "ron",
      "entity_2": "gnome",
      "relationship_type": "catches",
      "description": "Ron is also catching gnomes in the game of de-gnoming. He claims that the gnomes will be back and that they love it."
    },
    {
      "entity_1": "harry",
      "entity_2": "fred",
      "relationship_type": "competing",
      "description": "Harry and Fred are competing with each other in the game of de-gnoming. The text describes how Harry learns to drop the gnomes over the hedge instead of trying to catch them, implying that he is trying to outdo Fred."
    }
  ]
}