{
  "entities": [
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Draco Malfoy is mentioned as someone Harry and Mr Weasley followed using the Invisibility Cloak. He is described as having given his mother the slip and being up to something suspicious."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who used the Invisibility Cloak to follow Draco Malfoy. He is described as wanting to know why Malfoy was behaving suspiciously."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr Weasley is mentioned as looking on with a mixture of exasperation and amusement at Harry's actions. He sounds resigned when talking about Harry's decision to follow Malfoy."
    },
    {
      "name": "borgin",
      "entity_type": "person",
      "singular": true,
      "description": "Borgin is mentioned as being bullied by Draco Malfoy in the shop Borgin and Burkes. Malfoy asked him to help fix something and keep something else for him."
    },
    {
      "name": "madam malkin",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Malkin is mentioned as trying to touch Draco Malfoy's left arm, causing him to jump about a mile. This suggests that Malfoy has been branded with the Dark Mark."
    },
    {
      "name": "borgin and burkes",
      "entity_type": "location",
      "singular": false,
      "description": "Borgin and Burkes is mentioned as a shop where Draco Malfoy went to bully Borgin into helping him fix something."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "draco malfoy",
      "relationship_type": "followed",
      "description": "Harry followed Draco Malfoy using the Invisibility Cloak."
    },
    {
      "entity_1": "harry",
      "entity_2": "borgin and burkes",
      "relationship_type": "visited",
      "description": "Harry visited Borgin and Burkes with Mr Weasley to see what Draco Malfoy was doing."
    },
    {
      "entity_1": "draco malfoy",
      "entity_2": "borgin",
      "relationship_type": "bullied",
      "description": "Draco Malfoy bullied Borgin in the shop Borgin and Burkes."
    },
    {
      "entity_1": "madam malkin",
      "entity_2": "draco malfoy",
      "relationship_type": "touched",
      "description": "Madam Malkin tried to touch Draco Malfoy's left arm, causing him to jump about a mile."
    }
  ]
}