{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a student who is concerned about Dumbledore's funeral and wants to attend it."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is the headmaster of Hogwarts who has passed away and will be laid to rest at Hogwarts."
    },
    {
      "name": "hogwarts express",
      "entity_type": "vehicle",
      "singular": true,
      "description": "The Hogwarts Express is a train that transports students from Platform 9 3/4 to Hogwarts."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a gamekeeper and teacher at Hogwarts who speaks up in support of keeping the students at Hogwarts for Dumbledore's funeral."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is a teacher at Hogwarts who is discussing the arrangements for Dumbledore's funeral with Harry and others."
    },
    {
      "name": "ministry",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry is an external organization that has some say in the decision-making process regarding Dumbledore's funeral."
    },
    {
      "name": "professor flitwick",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Flitwick is a teacher at Hogwarts who agrees with Harry and others that Hogwarts should be Dumbledore's final resting place."
    },
    {
      "name": "professor sprout",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Sprout is a teacher at Hogwarts who agrees with Harry and others that Hogwarts should be Dumbledore's final resting place."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "dumbledore",
      "relationship_type": "concerned_about",
      "description": "Harry is concerned about Dumbledore's funeral and wants to attend it."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "dumbledore",
      "relationship_type": "respected",
      "description": "Hagrid speaks up in support of keeping the students at Hogwarts for Dumbledore's funeral, showing his respect for Dumbledore."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "ministry",
      "relationship_type": "influenced_by",
      "description": "Professor McGonagall is discussing the arrangements for Dumbledore's funeral with Harry and others, and mentions that the Ministry has some say in the decision-making process."
    },
    {
      "entity_1": "professor flitwick",
      "entity_2": "dumbledore",
      "relationship_type": "respected",
      "description": "Professor Flitwick agrees with Harry and others that Hogwarts should be Dumbledore's final resting place, showing his respect for Dumbledore."
    },
    {
      "entity_1": "professor sprout",
      "entity_2": "dumbledore",
      "relationship_type": "respected",
      "description": "Professor Sprout agrees with Harry and others that Hogwarts should be Dumbledore's final resting place, showing her respect for Dumbledore."
    }
  ]
}