{
  "entities": [
    {
      "name": "borgin",
      "entity_type": "person",
      "singular": true,
      "description": "Borgin is a person who slammed the door behind Hermione. (‘As the bell tinkled again, Borgin slammed the door behind her and put up the ‘Closed’ sign.’)"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person who threw the Cloak back over Hermione. (‘Ah well,’ said Ron, throwing the Cloak back over Hermione.)"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who was with Ron and Harry. (‘Well, next time you can show me how it’s done, Master of Mystery!’ she snapped.)"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who joined in with Ron and Hermione when they insisted that they had been in the back room all along. (Once in the shop, Harry whipped off the Invisibility Cloak, hid it in his bag, and joined in with the other two...)"
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Weasley is a person who had clearly noticed their absence. (where they were forced to stop so that they could dodge undetected around a very anxious-looking Mrs Weasley and Hagrid...)"
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a person who was with Mrs Weasley. (where they were forced to stop so that they could dodge undetected around a very anxious-looking Mrs Weasley and Hagrid...)"
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "teased",
      "description": "Ron teased Hermione by saying she was obvious. (‘Worth a try , but you were a bit obvious –’)"
    },
    {
      "entity_1": "harry",
      "entity_2": "invisibility cloak",
      "relationship_type": "hid",
      "description": "Harry hid the Invisibility Cloak in his bag. (Once in the shop, Harry whipped off the Invisibility Cloak, hid it in his bag...)"
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "defended",
      "description": "Ron defended Hermione by saying they had been in the back room all along. (Once in the shop, Harry joined in with the other two when they insisted, in answer to Mrs Weasley’s accusations...)"
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "defended",
      "description": "Harry defended Ron by saying they had been in the back room all along. (Once in the shop, Harry joined in with the other two when they insisted, in answer to Mrs Weasley’s accusations...)"
    },
    {
      "entity_1": "hermione",
      "entity_2": "ron",
      "relationship_type": "teased",
      "description": "Hermione teased Ron by saying he was a Master of Mystery. (‘Well, next time you can show me how it’s done, Master of Mystery!’ she snapped.)"
    }
  ]
}