{
  "entities": [
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is described as running away from the enormous beast, indicating that he is trying to escape. (\"he saw Snape running as hard as he could\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as struggling to his feet and looking around for his wand, indicating that he is trying to give chase. (\"Harry struggled to his feet, looking around groggily for his wand\")"
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is described as emerging from the burning house with Fang on his back, indicating that he has arrived to help Harry. (\"With a cry of thankfulness, Harry sank to his knees; he stumbled towards the burn ing house as an enormous figure emerged from out of the flames carrying Fang on his back\")"
    },
    {
      "name": "fang",
      "entity_type": "animal",
      "singular": true,
      "description": "Fang is described as being carried by Hagrid, indicating that it is a loyal companion. (\"With a cry of thankfulness, Harry sank to his knees; he stumbled towards the burn ing house as an enormous figure emerged from out of the flames carrying Fang on his back\")"
    },
    {
      "name": "hippogriff",
      "entity_type": "animal",
      "singular": true,
      "description": "The Hippogriff is described as circling the gates, indicating that it has been awakened by Snape's escape. (\"by the time he had located his wand he turned only to see th e Hippogriff circling the gates\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "chase",
      "description": "Harry is trying to give chase to Snape, but it's too late. (\"he knew it would be too late, and sure enough, by the time he had located his wand he turned only to see th e Hippogriff circling the gates: Snape had managed to Disapparate just beyond the school’s boundaries\")"
    },
    {
      "entity_1": "hagrid",
      "entity_2": "fang",
      "relationship_type": "carry",
      "description": "Hagrid is carrying Fang on his back. (\"With a cry of thankfulness, Harry sank to his knees; he stumbled towards the burn ing house as an enormous figure emerged from out of the flames carrying Fang on his back\")"
    }
  ]
}