{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character, described as remaining within the confines of The Burrow's garden over the next few weeks."
    },
    {
      "name": "the burrow",
      "entity_type": "location",
      "singular": true,
      "description": "The Burrow is Harry's temporary home, mentioned as having a garden where he spends most of his days playing Quidditch."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is one of the players in the two-a-side Quidditch game, described as being 'dreadful' at it."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is another player in the two-a-side Quidditch game, mentioned as being well-matched against Harry and Hermione."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is Ron's sister and a player in the two-a-side Quidditch game, described as being 'good' at it."
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Weasley is Harry's host mother, mentioned as putting out food for him to eat in the evenings."
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is one of Mr. Weasley's sons and a member of the household, mentioned as bringing home news before it reaches the paper."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is Harry's host father, mentioned as bringing home news before it reaches the paper."
    },
    {
      "name": "remus lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Remus Lupin is a guest at Harry's sixteenth birthday party, described as looking gaunt and grim with grey streaks in his hair."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "the burrow",
      "relationship_type": "residence",
      "description": "Harry is residing within the confines of The Burrow's garden over the next few weeks."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry and Hermione are playing Quidditch together, indicating a friendly relationship between them."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "friendship",
      "description": "Harry and Ron are playing Quidditch together, indicating a friendly relationship between them."
    },
    {
      "entity_1": "harry",
      "entity_2": "ginny",
      "relationship_type": "friendship",
      "description": "Harry and Ginny are playing Quidditch together, indicating a friendly relationship between them."
    },
    {
      "entity_1": "bill",
      "entity_2": "mr weasley",
      "relationship_type": "family_relationship",
      "description": "Bill is one of Mr. Weasley's sons, indicating a family relationship between them."
    }
  ]
}