{
  "entities": [
    {
      "name": "katie",
      "entity_type": "person",
      "singular": true,
      "description": "Katie is a student at Hogwarts who has been cursed. She is not the intended target of the curse, but rather an unintended victim."
    },
    {
      "name": "st mungo's hospital for magical maladies and injuries",
      "entity_type": "location",
      "singular": true,
      "description": "St Mungo's Hospital is a place where wizards and witches go to receive treatment for magical ailments. Katie was taken there after being cursed."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a student at Hogwarts who has been investigating the possibility that Draco Malfoy is a Death Eater."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is Harry's friend and classmate at Hogwarts. He and Hermione are pretending to be deaf when Harry mentions his theory about Malfoy being a Death Eater."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is Harry's friend and classmate at Hogwarts. She and Ron are pretending to be deaf when Harry mentions his theory about Malfoy being a Death Eater."
    },
    {
      "name": "leanne",
      "entity_type": "person",
      "singular": true,
      "description": "Leanne is a student at Hogwarts who knows that Katie was not the intended target of the curse."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is a student at Hogwarts who Harry suspects may be a Death Eater. He is aware of the curse on Katie, but it's unclear if he knows more about it."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is the headmaster of Hogwarts who has been absent for a while. He returns to teach his lesson on Monday night and seems tired but smiling."
    }
  ],
  "relationships": [
    {
      "entity_1": "katie",
      "entity_2": "st mungo's hospital for magical maladies and injuries",
      "relationship_type": "was_taken_to",
      "description": "Katie was taken to St Mungo's Hospital after being cursed."
    },
    {
      "entity_1": "harry",
      "entity_2": "malfoy",
      "relationship_type": "suspects",
      "description": "Harry suspects that Malfoy may be a Death Eater and is aware of the curse on Katie."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "teacher_student",
      "description": "Dumbledore is Harry's teacher at Hogwarts, and he returns to teach his lesson on Monday night."
    }
  ]
}