{
  "entities": [
    {
      "name": "lord voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Lord Voldemort is mentioned as a person who will become a powerful wizard. He is described as having 'beginnings' which implies that he has a history or past."
    },
    {
      "name": "tom riddle",
      "entity_type": "person",
      "singular": true,
      "description": "Tom Riddle is mentioned as a handsome Muggle who abandoned his witch wife, Merope. He is described as having returned to his family home in Little Hangleton."
    },
    {
      "name": "merope",
      "entity_type": "person",
      "singular": true,
      "description": "Merope is mentioned as a witch who was abandoned by her husband, Tom Riddle. She is described as being left alone in London, expecting the baby who would become Lord Voldemort."
    },
    {
      "name": "caractacus burke",
      "entity_type": "person",
      "singular": true,
      "description": "Caractacus Burke is mentioned as a person who helped found the shop whence came the necklace they have been discussing. He is described as providing evidence that Merope was in London."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as a person who knows about Merope's location and provides evidence from Caractacus Burke to support his claim."
    }
  ],
  "relationships": [
    {
      "entity_1": "tom riddle",
      "entity_2": "merope",
      "relationship_type": "abandoned",
      "description": "Tom Riddle abandoned his witch wife, Merope. This is described as a past event that has significance for the story of Lord Voldemort's beginnings."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "caractacus burke",
      "relationship_type": "provided_evidence",
      "description": "Dumbledore provided evidence from Caractacus Burke to support his claim that Merope was in London. This is described as a present-day event where Dumbledore uses historical information to inform the story."
    }
  ]
}