{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as the one who is explaining the story of Merope and Tom Riddle. He is described as saying that Merope was a witch and that she was able to give full rein to her abilities once she was alone and free."
    },
    {
      "name": "merope",
      "entity_type": "person",
      "singular": true,
      "description": "Merope is mentioned as the one who was in love with Tom Riddle. She is described as being a witch and as having been terrorized by her father for 18 years."
    },
    {
      "name": "tom riddle",
      "entity_type": "person",
      "singular": true,
      "description": "Tom Riddle is mentioned as the one who was in love with Merope. He is described as being a Muggle companion of Merope."
    },
    {
      "name": "marvolo",
      "entity_type": "person",
      "singular": true,
      "description": "Marvolo is mentioned as the father of Merope and Morfin. He is described as terrorizing his daughter for 18 years."
    },
    {
      "name": "morfin",
      "entity_type": "person",
      "singular": true,
      "description": "Morfin is mentioned as the brother of Merope. He is also mentioned as being in Azkaban with Marvolo."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who is asking questions about Merope and Tom Riddle. He is described as being unable to imagine two people less likely to fall in love."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "merope",
      "relationship_type": "explanation",
      "description": "Dumbledore explains the story of Merope and Tom Riddle. He is describing how Merope was able to give full rein to her abilities once she was alone and free."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "marvolo",
      "relationship_type": "terrorized_by",
      "description": "Dumbledore mentions that Marvolo terrorized his daughter Merope for 18 years."
    },
    {
      "entity_1": "harry",
      "entity_2": "merope",
      "relationship_type": "questioned_about",
      "description": "Harry asks questions about Merope and Tom Riddle. He is trying to understand how Merope was able to make Tom fall in love with her."
    },
    {
      "entity_1": "harry",
      "entity_2": "tom riddle",
      "relationship_type": "questioned_about",
      "description": "Harry asks questions about Tom Riddle and his relationship with Merope. He is trying to understand how Merope was able to make Tom fall in love with her."
    },
    {
      "entity_1": "merope",
      "entity_2": "tom riddle",
      "relationship_type": "fell_in_love_with",
      "description": "Merope fell in love with Tom Riddle. She is described as being a witch and as having been able to give full rein to her abilities once she was alone and free."
    },
    {
      "entity_1": "marvolo",
      "entity_2": "morfin",
      "relationship_type": "in_azkaban_with",
      "description": "Marvolo and Morfin were in Azkaban together. They are mentioned as being safely locked away from Merope."
    }
  ]
}