{
  "entities": [
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is the main character in this scene. He gasped and gulped before looking up into the cracked mirror and saw Harry staring at him over his shoulder."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the other main character in this scene. He instinctively pulled out his wand when Malfoy drew his, and they began to cast spells at each other."
    },
    {
      "name": "moaning myrtle",
      "entity_type": "person",
      "singular": true,
      "description": "Moaning Myrtle is a character who appears in the scene. She screams loudly when Harry's Leg-Locker Curse backfires and smashes the cistern beneath her."
    }
  ],
  "relationships": [
    {
      "entity_1": "malfoy",
      "entity_2": "harry",
      "relationship_type": "cast_spell_against",
      "description": "Malfoy cast a hex at Harry, but it missed him by inches. Harry then threw himself sideways and attempted to cast a jinx at Malfoy."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "harry",
      "relationship_type": "cast_spell_against",
      "description": "Malfoy blocked the jinx that Harry tried to cast at him, and then raised his wand for another spell. Harry attempted a Leg-Locker Curse that backfired off the wall behind Malfoy's ear."
    },
    {
      "entity_1": "harry",
      "entity_2": "malfoy",
      "relationship_type": "cast_spell_against",
      "description": "Harry threw himself sideways and attempted to cast a jinx at Malfoy, but it was blocked. Harry then attempted a Leg-Locker Curse that backfired off the wall behind Malfoy's ear."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "moaning myrtle",
      "relationship_type": "affect",
      "description": "Malfoy's spell caused water to pour everywhere, and Moaning Myrtle screamed loudly as a result."
    }
  ]
}