{
  "entities": [
    {
      "name": "professor flitwick",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Flitwick was making squeaky attempts to position a few Ravenclaws. He is described as trying to organize the students, indicating his role as a teacher."
    },
    {
      "name": "professor sprout",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Sprout was chivvying the Hufflepuffs into line. She is described as trying to get the students in order, indicating her role as a teacher."
    },
    {
      "name": "ernie macmillan",
      "entity_type": "person",
      "singular": true,
      "description": "Ernie Macmillan was someone Harry had to dodge around. He is not described in detail, but his presence is noted as an obstacle for Harry."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy was taking advantage of the general upheaval to continue his argument with Crabbe. He is described as being confrontational and dismissive of others' concerns."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe was standing five feet away from Malfoy, looking mutinous. He is described as being in a confrontational mood and engaged in an argument with Malfoy."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle was mentioned by Malfoy as someone who should be keeping a lookout. He is not described in detail, but his presence is noted as part of the group."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry was standing right behind Malfoy, unaware that he was being spoken to. He is not described in detail, but his presence is noted as a witness to the argument."
    },
    {
      "name": "ravenclaws",
      "entity_type": "group",
      "singular": false,
      "description": "The Ravenclaws were mentioned as wanting to be near the front of the crowd. They are described as a group, but not individually."
    },
    {
      "name": "hufflepuffs",
      "entity_type": "group",
      "singular": false,
      "description": "The Hufflepuffs were being chivvied into line by Professor Sprout. They are described as a group, but not individually."
    }
  ],
  "relationships": [
    {
      "entity_1": "malfoy",
      "entity_2": "crabbe",
      "relationship_type": "argument",
      "description": "Malfoy and Crabbe were engaged in an argument. Malfoy was dismissive of Crabbe's concerns, indicating a confrontational relationship."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "goyle",
      "relationship_type": "order",
      "description": "Malfoy told Goyle to keep a lookout, indicating that he was giving orders to his group members."
    }
  ]
}