{
  "entities": [
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as someone who the narrator believes was being helped by the main character, and is associated with the Death Eaters. The text states: 'Curse, she was helping Malfoy and the Death Eaters'."
    },
    {
      "name": "death eaters",
      "entity_type": "group",
      "singular": false,
      "description": "The Death Eaters are mentioned as a group that Malfoy is associated with. The text states: 'Curse, she was helping Malfoy and the Death Eaters'."
    },
    {
      "name": "rosmerta",
      "entity_type": "person",
      "singular": true,
      "description": "Rosmerta is mentioned by Professor McGonagall as someone who might be involved in the situation. The text states: '‘Rosmerta?’ said Professor McGonagall incredulously'."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as a character who is present in the scene and is reacting to the situation. The text states: '‘Rosmerta?’ said Professor McGonagall incredulously'."
    },
    {
      "name": "professor sprout",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Sprout is mentioned as one of the professors who enters the room along with Hagrid. The text states: 'Professors Sprout, F litwick and Slughorn traipsed into the room'."
    },
    {
      "name": "f litwick",
      "entity_type": "person",
      "singular": true,
      "description": "F Litwick is mentioned as one of the professors who enters the room along with Hagrid. The text states: 'Professors Sprout, F litwick and Slughorn traipsed into the room'."
    },
    {
      "name": "slughorn",
      "entity_type": "person",
      "singular": true,
      "description": "Slughorn is mentioned as one of the professors who enters the room along with Hagrid. The text states: 'Professors Sprout, F litwick and Slughorn traipsed into the room'."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as someone who enters the room along with the other professors. The text states: 'Professors Sprout, F litwick and Slughorn traipsed into the room, followed by Hagrid'."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as someone who has caused a reaction in Professor Slughorn. The text states: '‘Snape!’ ejaculated Slughorn, who looked the most shaken, pale and sweating'."
    },
    {
      "name": "everard",
      "entity_type": "person",
      "singular": true,
      "description": "Everard is mentioned as someone who speaks from high on the wall. The text states: 'a sallow-faced wizard with a short black fringe had just walked back into his empty canvas. ‘Minerva, the Minister will be here within seconds, he has just Disapparated from the Ministry .’"
    },
    {
      "name": "minister",
      "entity_type": "position",
      "singular": true,
      "description": "The Minister is mentioned as someone who will be arriving soon. The text states: '‘Minerva, the Minister will be here within seconds'."
    }
  ],
  "relationships": [
    {
      "entity_1": "mcgonagall",
      "entity_2": "everard",
      "relationship_type": "informant",
      "description": "Professor McGonagall is informed by Everard that the Minister will arrive soon. The text states: '‘Thank you, Everard,’ said Professor McGonagall'."
    }
  ]
}