{
  "entities": [
    {
      "name": "celestina",
      "entity_type": "person",
      "singular": true,
      "description": "Celestina is the one who ended her song on a very long, high-pitched note. She is described as singing and receiving loud applause from Mrs Weasley."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is the one who asked if it's over after Celestina finished her song. She is described as being enthusiastic and joining in with loud applause."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr Weasley is the one who suggested having a nightcap after Celestina finished her song. He is described as leaping to his feet and asking if anyone wants egg-nog."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the one who asked Lupin what he's been up to lately. He is described as having a conversation with Lupin and others in the room."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is the one who has been living among werewolves. He is described as being a spy for Dumbledore and trying to keep his activities secret from Harry."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": false,
      "description": "Dumbledore is the one who wanted a spy and chose Lupin for the job. He is not physically present in the scene but mentioned by Lupin."
    }
  ],
  "relationships": [
    {
      "entity_1": "mr weasley",
      "entity_2": "harry",
      "relationship_type": "asked",
      "description": "Mr Weasley asked Harry if anyone wants egg-nog."
    },
    {
      "entity_1": "lupin",
      "entity_2": "dumbledore",
      "relationship_type": "spy_for",
      "description": "Lupin is a spy for Dumbledore, as mentioned by Lupin in the conversation with Harry."
    }
  ]
}