{
  "entities": [
    {
      "name": "gregory goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Gregory Goyle is the person standing guard outside the Room of Requirement. He is described as giving a high-pitched scream of terror and sprinting away."
    },
    {
      "name": "room 435",
      "entity_type": "location",
      "singular": true,
      "description": "Room 435 is the location where Gregory Goyle is standing guard. It is not explicitly mentioned what this room is for or its significance."
    },
    {
      "name": "room of requirement",
      "entity_type": "location",
      "singular": true,
      "description": "The Room of Requirement is a mysterious room that can only be accessed by those who need it. Harry believes that if Goyle is standing guard outside it, the room is open."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is the person who is sneaking around and trying to get into the Room of Requirement. He is described as sprinting up the stairs and creeping towards a little girl."
    },
    {
      "name": "hermione granger",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione Granger is mentioned as having helped a little girl with her heavy brass scales a fortnight before. She is not present in the scene but is mentioned to provide context."
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Draco Malfoy is described as standing frozen behind a blank wall, aware that someone unwelcome was out."
    },
    {
      "name": "little girl",
      "entity_type": "person",
      "singular": true,
      "description": "The little girl is clutching her heavy brass scales and is being watched by Harry. She is not explicitly named but is described as being pretty."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "room of requirement",
      "relationship_type": "access",
      "description": "Harry believes that if Goyle is standing guard outside the Room of Requirement, it means the room is open and he can access it."
    },
    {
      "entity_1": "gregory goyle",
      "entity_2": "room of requirement",
      "relationship_type": "guardian",
      "description": "Gregory Goyle is standing guard outside the Room of Requirement, indicating that he has some kind of responsibility or connection to the room."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "little girl",
      "relationship_type": "observer",
      "description": "Harry is watching the little girl from behind and trying not to be seen by her."
    }
  ]
}