{
  "entities": [
    {
      "name": "shacklebolt",
      "entity_type": "person",
      "singular": true,
      "description": "Shacklebolt is mentioned as a person who works for the Prime Minister, indicating that he has some sort of position or role in the government. (\"I thought you were happy with Shacklebolt? said Scrim-geour coldly.\")"
    },
    {
      "name": "scrimgeour",
      "entity_type": "person",
      "singular": true,
      "description": "Scrimgeour is mentioned as a person who is interacting with the Prime Minister, indicating that he has some sort of position or role in the government. (\"I thought you were happy with Shacklebolt? said Scrim-geour coldly.\")"
    },
    {
      "name": "herbert chorley",
      "entity_type": "person",
      "singular": true,
      "description": "Herbert Chorley is mentioned as a person who has been impersonating a duck and has reacted to a poorly performed Imperius Curse. (\"Now, about Herbert Chorley – your Junior Minister, he continued.\")"
    },
    {
      "name": "st mungo's hospital for magical maladies and injuries",
      "entity_type": "organization",
      "singular": true,
      "description": "St Mungo's Hospital is mentioned as an organization that is sending a team of Healers to examine Herbert Chorley. (\"A team of Healers from St Mungo’s Hospital for Magical Maladies and Injuries is examining him as we speak.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "scrimgeour",
      "entity_2": "shacklebolt",
      "relationship_type": "works_for",
      "description": "Scrimgeour mentions that the Prime Minister was happy with Shacklebolt, indicating that Scrimgeour is aware of Shackelbolt's position or role in the government. (\"I thought you were happy with Shacklebolt? said Scrim-geour coldly.\")"
    },
    {
      "entity_1": "scrimgeour",
      "entity_2": "herbert chorley",
      "relationship_type": "concerned_about",
      "description": "Scrimgeour is concerned about Herbert Chorley's behavior and believes that he could still be dangerous. (\"He has clearly reacted to a poorly performed Imperius Curse, said Scrimgeour. It’s addled his brains, but he could still be dangerous.\")"
    },
    {
      "entity_1": "st mungo's hospital for magical maladies and injuries",
      "entity_2": "herbert chorley",
      "relationship_type": "examining",
      "description": "St Mungo's Hospital is examining Herbert Chorley, as mentioned by Scrimgeour. (\"A team of Healers from St Mungo’s Hospital for Magical Maladies and Injuries is examining him as we speak.\")"
    }
  ]
}