{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who cannot perform Legilimency. (\"could not perform Legilimency\")"
    },
    {
      "name": "romilda vane",
      "entity_type": "person",
      "singular": true,
      "description": "Romilda Vane is mentioned as someone who looked like she meant business with love potions. (\"looked like she meant business\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who is writing an Arithmancy essay and knows about the Owl Order Service. (\"writing her Arithmancy essay\", \"Fred and George send them disguised as perfumes and cough potions\")"
    },
    {
      "name": "filch",
      "entity_type": "person",
      "singular": true,
      "description": "Filch is mentioned as someone who banned items bought at Weasleys' Wizard Wheezes. (\"I thought Filch had banned anything bought at Weasleys'\")"
    },
    {
      "name": "fred and george",
      "entity_type": "group",
      "singular": false,
      "description": "Fred and George are mentioned as the ones who send love potions disguised as perfumes and cough potions through their Owl Order Service. (\"Fred and George send them disguised as perfumes and cough potions\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who is watching Hermione write her essay. (\"Harry watched her with his mind a long way away\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "fred and george",
      "relationship_type": "knows_about",
      "description": "Hermione knows about the Owl Order Service, which is run by Fred and George. (\"Fred and George send them disguised as perfumes and cough potions\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "watches",
      "description": "Harry watches Hermione write her essay. (\"Harry watched her with his mind a long way away\")"
    }
  ]
}