{
  "entities": [
    {
      "name": "bellatrix lestrange",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix Lestrange is mentioned as Sirius's killer and the one who might inherit his house. (\"Bellatrix Lestrange, Sirius’s killer, inherit his house?\")"
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as Bellatrix's victim and the owner of a house with enchantments placed upon it. (\"Bellatrix Lestrange, Sirius’s killer, inherit his house?\")"
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone who has placed enchantments on the house and is trying to clarify the position of ownership. (\"We do not kn ow whether the enchantments we ourselves have placed upon it...\")"
    },
    {
      "name": "uncle vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Uncle Vernon is mentioned as someone who shouts at Dumbledore and the Dursleys to remove their glasses. (\"‘Will you get these ruddy things off us?’\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who looks around when Uncle Vernon shouts. (\"Harry looked round; all three of the Dursleys were cower- ing with their arms over their heads...\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "bellatrix lestrange",
      "relationship_type": "concerned_about",
      "description": "Dumbledore is concerned about Bellatrix Lestrange inheriting Sirius's house. (\"‘Well, obviously we would prefer that she didn’t get it, either,’ said Dumbledore calmly.\")"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "sirius",
      "relationship_type": "concerned_about",
      "description": "Dumbledore is concerned about the enchantments placed on Sirius's house. (\"We do not kn ow whether the enchantments we ourselves have placed upon it...\")"
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "uncle vernon",
      "relationship_type": "interacted_with",
      "description": "Dumbledore interacts with Uncle Vernon when he shouts at him and the Dursleys. (\"‘Will you get these ruddy things off us?’\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "uncle vernon",
      "relationship_type": "observed",
      "description": "Harry observes Uncle Vernon shouting at Dumbledore and the Dursleys. (\"Harry looked round; all three of the Dursleys were cower- ing with their arms over their heads...\")"
    }
  ]
}