{
  "entities": [
    {
      "name": "morfin",
      "entity_type": "person",
      "singular": true,
      "description": "Morfin is the father of Tom and Merope, as mentioned in the text. He is described as getting out of his armchair and speaking in Parseltongue."
    },
    {
      "name": "tom",
      "entity_type": "person",
      "singular": true,
      "description": "Tom is the son of Morfin and Merope, as mentioned in the text. He is described as not being right in the head by his father."
    },
    {
      "name": "merope",
      "entity_type": "person",
      "singular": true,
      "description": "Merope is the daughter of Morfin and the sister of Tom, as mentioned in the text. She is described as being white and on the verge of fainting."
    },
    {
      "name": "gaunt",
      "entity_type": "person",
      "singular": true,
      "description": "Gaunt is likely a surname for Morfin, as he is referred to as 'Mr. Gaunt' in some contexts. In this text, he is speaking in Parseltongue and looking at his son and daughter."
    },
    {
      "name": "parseltongue",
      "entity_type": "language",
      "singular": true,
      "description": "Parseltongue is a language spoken by wizards and magical creatures, as mentioned in the text. Morfin and Gaunt are speaking in Parseltongue to communicate with each other."
    },
    {
      "name": "cecilia",
      "entity_type": "person",
      "singular": true,
      "description": "Cecilia is a person who is being spoken to by her father, as mentioned in the text. She is referred to as 'darling' and is advised not to look at something."
    }
  ],
  "relationships": [
    {
      "entity_1": "morfin",
      "entity_2": "tom",
      "relationship_type": "parent_child",
      "description": "Morfin is the parent of Tom, as mentioned in the text. He is described as saying that his son is not right in the head."
    },
    {
      "entity_1": "morfin",
      "entity_2": "merope",
      "relationship_type": "parent_child",
      "description": "Morfin is the parent of Merope, as mentioned in the text. He is described as speaking to her and looking at her."
    },
    {
      "entity_1": "gaunt",
      "entity_2": "tom",
      "relationship_type": "parent_child",
      "description": "Gaunt (likely a surname for Morfin) is the parent of Tom, as mentioned in the text. He is described as looking at his son and speaking to him."
    },
    {
      "entity_1": "gaunt",
      "entity_2": "merope",
      "relationship_type": "parent_child",
      "description": "Gaunt (likely a surname for Morfin) is the parent of Merope, as mentioned in the text. He is described as looking at his daughter and speaking to her."
    },
    {
      "entity_1": "morfin",
      "entity_2": "parseltongue",
      "relationship_type": "speaks_language",
      "description": "Morfin speaks Parseltongue, as mentioned in the text. He is described as speaking to his family and others."
    },
    {
      "entity_1": "gaunt",
      "entity_2": "parseltongue",
      "relationship_type": "speaks_language",
      "description": "Gaunt (likely a surname for Morfin) speaks Parseltongue, as mentioned in the text. He is described as speaking to his family and others."
    }
  ]
}