{
  "entities": [
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "The name 'Harry Potter' is mentioned in the text as a proper noun, indicating that it refers to a specific person. However, Harry Potter is not present in this scene."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is introduced as a character who pours out glasses of blood-red wine and hands them to the sisters. He is also mentioned as being amused by Bellatrix's glower."
    },
    {
      "name": "narcissa",
      "entity_type": "person",
      "singular": true,
      "description": "Narcissa is introduced as one of the sisters who receives a glass of blood-red wine from Snape. She apologizes for coming to see him and asks for his help."
    },
    {
      "name": "bellatrix",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix is introduced as one of the sisters who receives a glass of blood-red wine from Snape. She glowers at Snape, but does not speak."
    },
    {
      "name": "wormtail",
      "entity_type": "person",
      "singular": true,
      "description": "Wormtail is mentioned as someone who has been listening at doors and scurries back up the stairs after being caught by Snape."
    }
  ],
  "relationships": [
    {
      "entity_1": "snape",
      "entity_2": "narcissa",
      "relationship_type": "helped_by",
      "description": "Narcissa asks Snape for his help, indicating that she believes he is the only one who can assist her."
    },
    {
      "entity_1": "snape",
      "entity_2": "bellatrix",
      "relationship_type": "amused_by",
      "description": "Snape looks rather amused by Bellatrix's glower, indicating that there is a relationship between the two characters."
    },
    {
      "entity_1": "snape",
      "entity_2": "wormtail",
      "relationship_type": "caught_by",
      "description": "Wormtail is caught by Snape while listening at doors, indicating that Snape has authority over Wormtail."
    }
  ]
}