{
  "entities": [
    {
      "name": "bellatrix",
      "entity_type": "character",
      "singular": true,
      "description": "Bellatrix is a character in the story, specifically a witch who is questioning Snape. She is described as having a high color in her cheeks and her chest rising and falling rapidly."
    },
    {
      "name": "snape",
      "entity_type": "character",
      "singular": true,
      "description": "Snape is a character in the story, specifically a wizard who is being questioned by Bellatrix. He is described as smiling."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is a person mentioned in the story, specifically someone whose pocket Snape has lived in for years."
    },
    {
      "name": "harry potter",
      "entity_type": "character",
      "singular": true,
      "description": "Harry Potter is a character in the story, specifically someone who is still alive despite being at Snape's mercy for five years."
    },
    {
      "name": "narcissa",
      "entity_type": "character",
      "singular": true,
      "description": "Narcissa is a character in the story, specifically a witch who is sitting motionless behind Bellatrix. Her face is hidden in her hands."
    },
    {
      "name": "dark lord",
      "entity_type": "title",
      "singular": true,
      "description": "The Dark Lord is a title mentioned in the story, specifically someone who has fallen and been reborn."
    },
    {
      "name": "philosopher's stone",
      "entity_type": "object",
      "singular": true,
      "description": "The Philosopher's Stone is an object mentioned in the story, specifically something that Snape stopped the Dark Lord from procuring."
    },
    {
      "name": "prophecy",
      "entity_type": "object",
      "singular": true,
      "description": "The prophecy is an object mentioned in the story, specifically something that was retrieved for the Dark Lord a few weeks ago."
    }
  ],
  "relationships": [
    {
      "entity_1": "bellatrix",
      "entity_2": "snape",
      "relationship_type": "questioning",
      "description": "Bellatrix is questioning Snape about his actions and whereabouts over the years."
    },
    {
      "entity_1": "snape",
      "entity_2": "dumbledore",
      "relationship_type": "living_in",
      "description": "Snape has been living in Dumbledore's pocket for years."
    },
    {
      "entity_1": "snape",
      "entity_2": "dark lord",
      "relationship_type": "stopping",
      "description": "Snape stopped the Dark Lord from procuring the Philosopher's Stone."
    },
    {
      "entity_1": "snape",
      "entity_2": "harry potter",
      "relationship_type": "having_at_mercy",
      "description": "Snape has had Harry Potter at his mercy for five years, but he is still alive."
    }
  ]
}