{
  "entities": [
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Weasley is mentioned as a character who is anxious and torn between finishing the shopping quickly and sticking together in a pack. She is described as scurrying off towards Flourish and Blotts with her husband and Ginny."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as a character who is soothingly telling Mrs Weasley not to fret, and that the three children will be fine with him. He is described as waving an airy hand the size of a dustbin lid."
    },
    {
      "name": "malkin's",
      "entity_type": "store",
      "singular": true,
      "description": "Malkin's is mentioned as a store where Harry, Ron, and Hermione are going to buy school books. It is described as a place where people go to buy school supplies."
    },
    {
      "name": "flourish and blotts",
      "entity_type": "store",
      "singular": true,
      "description": "Flourish and Blotts is mentioned as a store where Mrs Weasley, Mr Weasley, and Ginny are going to buy school books. It is described as a place where people go to buy school supplies."
    },
    {
      "name": "madam malkin's",
      "entity_type": "store",
      "singular": true,
      "description": "Madam Malkin's is mentioned as the store that Harry, Ron, Hermione, and Hagrid are going to. It is described as a place where people go to buy school supplies."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as one of the children who is going with Hagrid to Madam Malkin's. He notices that many people have a harried, anxious look and are staying together in groups."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as one of the children who is going with Hagrid to Madam Malkin's. He is not described in detail, but is mentioned alongside Harry and Hermione."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as one of the children who is going with Hagrid to Madam Malkin's. She is not described in detail, but is mentioned alongside Harry and Ron."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as Mrs Weasley's daughter who is going with her to Flourish and Blotts. She is not described in detail, but is mentioned alongside her mother."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr Weasley is mentioned as a character who is going with his wife and Ginny to Flourish and Blotts. He is not described in detail, but is mentioned alongside his family."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "madam malkin's",
      "relationship_type": "goes_to",
      "description": "Hagrid and the three children go to Madam Malkin's. This is mentioned in the sentence 'Harry, Ron, Hermione and Hagrid set off for Madam Malkin’s'."
    },
    {
      "entity_1": "mrs weasley",
      "entity_2": "flourish and blotts",
      "relationship_type": "goes_to",
      "description": "Mrs Weasley goes to Flourish and Blotts with her husband and Ginny. This is mentioned in the sentence 'Mrs Weasley did not look entirely convinced, but allowed the separation, scurrying off towards Flourish and Blotts with her husband and Ginny'."
    },
    {
      "entity_1": "harry",
      "entity_2": "madam malkin's",
      "relationship_type": "goes_to",
      "description": "Harry goes to Madam Malkin's with Hagrid. This is mentioned in the sentence 'Harry, Ron, Hermione and Hagrid set off for Madam Malkin’s'."
    },
    {
      "entity_1": "ron",
      "entity_2": "madam malkin's",
      "relationship_type": "goes_to",
      "description": "Ron goes to Madam Malkin's with Hagrid. This is mentioned in the sentence 'Harry, Ron, Hermione and Hagrid set off for Madam Malkin’s'."
    },
    {
      "entity_1": "hermione",
      "entity_2": "madam malkin's",
      "relationship_type": "goes_to",
      "description": "Hermione goes to Madam Malkin's with Hagrid. This is mentioned in the sentence 'Harry, Ron, Hermione and Hagrid set off for Madam Malkin’s'."
    }
  ]
}