{
  "entities": [
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is leading a group of people to a place with hundreds of chairs. She is described as the one in charge, and her presence is mentioned first."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is following Professor McGonagall and does not recognize most of the people present. He is described as a person who is part of this group."
    },
    {
      "name": "kingsley shacklebolt",
      "entity_type": "person",
      "singular": true,
      "description": "Kingsley Shacklebolt is mentioned as a member of the Order of the Phoenix, and Harry recognizes him."
    },
    {
      "name": "mad-eye moody",
      "entity_type": "person",
      "singular": true,
      "description": "Mad-Eye Moody is also mentioned as a member of the Order of the Phoenix, and Harry recognizes him."
    },
    {
      "name": "tonks",
      "entity_type": "person",
      "singular": true,
      "description": "Tonks is described as having her hair miraculously returned to its original pink color. She is also mentioned as holding hands with Remus Lupin."
    },
    {
      "name": "remus lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Remus Lupin is described as being in a romantic relationship with Tonks, and they are holding hands."
    },
    {
      "name": "mr weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Weasley is mentioned as part of the group, along with his wife Mrs. Weasley."
    },
    {
      "name": "mrs weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Weasley is mentioned as part of the group, along with her husband Mr. Weasley."
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is described as being supported by Fleur and followed by his brothers Fred and George."
    },
    {
      "name": "fleur",
      "entity_type": "person",
      "singular": true,
      "description": "Fleur is described as supporting Bill, along with her husband's brothers Fred and George."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Fred is mentioned as part of the group, along with his brother George and their father Mr. Weasley."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as part of the group, along with his brother Fred and their father Mr. Weasley."
    },
    {
      "name": "madame maxime",
      "entity_type": "person",
      "singular": true,
      "description": "Madame Maxime is described as taking up two-and-a-half chairs on her own, indicating that she is a large or imposing person."
    },
    {
      "name": "tom",
      "entity_type": "person",
      "singular": true,
      "description": "Tom is mentioned as the landlord of the Leaky Cauldron, and he is part of the group present at this gathering."
    },
    {
      "name": "arabella figg",
      "entity_type": "person",
      "singular": true,
      "description": "Arabella Figg is mentioned as part of the group, along with other members of the wizarding community."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "harry",
      "relationship_type": "follows",
      "description": "Professor McGonagall is leading Harry and others to a place with hundreds of chairs."
    },
    {
      "entity_1": "tonks",
      "entity_2": "remus lupin",
      "relationship_type": "romantic partner",
      "description": "Tonks and Remus Lupin are holding hands, indicating that they are in a romantic relationship."
    },
    {
      "entity_1": "bill",
      "entity_2": "fleur",
      "relationship_type": "supported by",
      "description": "Fleur is supporting Bill, along with his brothers Fred and George."
    }
  ]
}