{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as maintaining a rigidly disapproving expression and refusing to talk if Harry uses the Muffliato spell on anyone in the vicinity. (\"amusing was Hermione, who main tained a rigidly disapprov- ing expression throughout and refused to talk at all if Harry had used the Muffliato spell on anyone in the vicinity.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as trying to examine a book more closely and having difficulty with non-verbal spells. (\"Sitting up in bed, Harry turned  the book sideways so as to examine more closely the scribbl ed instructions for a spell \")"
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is described as snoring loudly while the wind and sleet pounded on the windows. (\"While the wind and sleet pounded relentlessly on the win- dows and Neville snored loudly , Harry stared at the letters in brackets.\")"
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is described as being quick to comment on Harry's difficulty with non-verbal spells. (\"Harry rather doubted he would be able to bring off this particular spell; he was still having difficulty with non-verbal spells, something Snape had been quick to comment on in every DADA class.\")"
    },
    {
      "name": "the prince",
      "entity_type": "person",
      "singular": true,
      "description": "The Prince is described as being a more effective teacher than Snape. (\"On the other hand, the Prince had proved a much more effective teacher than Snape so far.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "commented_on",
      "description": "Snape commented on Harry's difficulty with non-verbal spells. (\"Harry rather doubted he would be able to bring off this particular spell; he was still having difficulty with non-verbal spells, something Snape had been quick to comment on in every DADA class.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "the prince",
      "relationship_type": "learned_from",
      "description": "Harry learned from the Prince. (\"On the other hand, the Prince had proved a much more effective teacher than Snape so far.\")"
    }
  ]
}