{
  "entities": [
    {
      "name": "horcruxes",
      "entity_type": "concept",
      "singular": true,
      "description": "Horcruxes are objects that contain pieces of Voldemort's soul. They are mentioned as a way for Voldemort to become invincible by killing the person who is destined to defeat him, in this case Harry Potter."
    },
    {
      "name": "nagini",
      "entity_type": "object",
      "singular": true,
      "description": "Nagini is a snake and one of Voldemort's Horcruxes. She is mentioned as being used by Voldemort to kill an old Muggle man, and later turned into his last Horcrux."
    },
    {
      "name": "lord voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Lord Voldemort is the main antagonist of the story. He is mentioned as believing that killing Harry Potter would make him invincible and destroy the danger outlined in the prophecy."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is the main protagonist of the story. He is mentioned as being destined to defeat Voldemort, and his death would have been a significant event for Voldemort."
    },
    {
      "name": "slytherin connection",
      "entity_type": "concept",
      "singular": true,
      "description": "The Slytherin connection refers to the fact that Nagini is a snake and one of Voldemort's Horcruxes, which enhances his mystique."
    },
    {
      "name": "muggle man",
      "entity_type": "person",
      "singular": true,
      "description": "An old Muggle man who was killed by Nagini at the behest of Voldemort."
    }
  ],
  "relationships": [
    {
      "entity_1": "lord voldemort",
      "entity_2": "nagini",
      "relationship_type": "ownership",
      "description": "Voldemort has control over Nagini, even for a Parselmouth. He likes to keep her close and seems to have an unusual amount of control over her."
    },
    {
      "entity_1": "lord voldemort",
      "entity_2": "harry potter",
      "relationship_type": "target",
      "description": "Voldemort believed that killing Harry Potter would make him invincible and destroy the danger outlined in the prophecy."
    }
  ]
}