{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as the main character in the story. He is mentioned by Ginny and is shown to be actively participating in the scene, sprinting after Snape and Malfoy."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is introduced as a character who is concerned about Harry's whereabouts. She asks him where he came from but does not get an answer."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as someone who must be caught by Harry. He is shown to be escaping and is the target of Harry's pursuit."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as someone who ran past with Snape. He is described as an enormous blond Death Eater."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is introduced as a character who is lying on the floor and clutching his stomach. He is shown to be concerned about Harry's safety."
    },
    {
      "name": "alecto",
      "entity_type": "death eater",
      "singular": true,
      "description": "Alecto is introduced as a female Death Eater who is sprinting away down the corridor with her brother behind her."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as someone who shouted 'Take that!' and is shown to be actively participating in the scene."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "pursuit",
      "description": "Harry is pursuing Snape, who must not escape. This relationship is described as Harry sprinting after Snape and trying to catch up with him."
    },
    {
      "entity_1": "harry",
      "entity_2": "malfoy",
      "relationship_type": "pursuit",
      "description": "Harry is also pursuing Malfoy, who ran past with Snape. This relationship is not explicitly described but can be inferred from the context."
    },
    {
      "entity_1": "neville",
      "entity_2": "harry",
      "relationship_type": "concern",
      "description": "Neville is concerned about Harry's safety and is lying on the floor clutching his stomach. This relationship is described as Neville muttering to himself that Snape and Malfoy ran past."
    },
    {
      "entity_1": "alecto",
      "entity_2": "snape",
      "relationship_type": "sibling",
      "description": "Alecto and her brother are mentioned as siblings who are sprinting away down the corridor together. This relationship is described as Alecto's brother being right behind her."
    }
  ]
}