{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as having an expression on his face that suggests he has been upset or disturbed. He denies being upset but eventually reveals the truth about Snape's betrayal."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is described as moving away from the window and looking closely at Harry with a slight crease between his eyebrows. He asks Harry what has happened to him."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned by Harry as the one who betrayed him by telling Voldemort about the prophecy and listening outside the door when Trelawney told Harry."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is mentioned by Harry as the one to whom Snape betrayed Harry by revealing the prophecy."
    },
    {
      "name": "fawkes",
      "entity_type": "animal",
      "singular": true,
      "description": "Fawkes is described as giving a soft squawk behind Dumbledore and Harry when Harry mentions Snape's name."
    },
    {
      "name": "trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Trelawney is mentioned by Harry as the one who told him about the prophecy that Snape betrayed to Voldemort."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "betrayed_by",
      "description": "Harry accuses Snape of betraying him by telling Voldemort about the prophecy and listening outside the door when Trelawney told Harry."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "concerned_for",
      "description": "Dumbledore is concerned for Harry's well-being and asks him what has happened to him."
    }
  ]
}