{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character in the story, a student at Hogwarts. He is waiting for someone to take his things out of the compartment so he can move."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "One of Harry's friends and classmates at Hogwarts. She is mentioned as someone who will help Harry with his things."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "One of Harry's friends and classmates at Hogwarts. He is mentioned as someone who will help Harry with his things."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "A student at Hogwarts, a rival of Harry's. He is waiting for Pansy to leave so he can be alone with Harry."
    },
    {
      "name": "pansy",
      "entity_type": "person",
      "singular": true,
      "description": "A student at Hogwarts, waiting for Malfoy and holding out her hand in the hopes that he will hold it."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "One of Malfoy's friends, who is pushing his way through a crowd of second-years to get off the train."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "One of Malfoy's friends, who follows Goyle out of the compartment."
    },
    {
      "name": "zabini",
      "entity_type": "person",
      "singular": true,
      "description": "One of Malfoy's friends, who follows Crabbe out of the compartment."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Harry is waiting for Hermione to help him with his things, indicating a close relationship between them."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "friendship",
      "description": "Similar to the relationship with Hermione, Harry is also waiting for Ron to help him with his things, showing their friendship."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "pansy",
      "relationship_type": "romantic_interest",
      "description": "Malfoy is waiting for Pansy to leave so he can be alone with Harry, suggesting a romantic interest between them."
    },
    {
      "entity_1": "goyle",
      "entity_2": "crabbe",
      "relationship_type": "friendship",
      "description": "Goyle and Crabbe are friends, as they follow each other out of the compartment."
    },
    {
      "entity_1": "goyle",
      "entity_2": "zabini",
      "relationship_type": "friendship",
      "description": "Similarly, Goyle and Zabini are also friends, following each other out of the compartment."
    }
  ]
}