{
  "entities": [
    {
      "name": "sopophorous bean",
      "entity_type": "plant",
      "singular": true,
      "description": "The sopophorous bean is described as being difficult to cut up. It is mentioned that Harry is trying to crush it with the flat side of a dagger."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who is trying to prepare a potion. He is described as turning to Hermione for help and then crushing the sopophorous bean with a dagger."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as being busy with her potion, which is still deep purple. Harry asks to borrow her silver knife."
    },
    {
      "name": "silver knife",
      "entity_type": "object",
      "singular": true,
      "description": "The silver knife is described as something that Hermione has and Harry wants to borrow it to cut up the sopophorous bean."
    },
    {
      "name": "cauldron",
      "entity_type": "container",
      "singular": true,
      "description": "The cauldron is mentioned as where Harry scoops the juice of the sopophorous bean into. It is also described as being used to hold a potion."
    },
    {
      "name": "textbook",
      "entity_type": "object",
      "singular": true,
      "description": "The textbook is mentioned as providing instructions for preparing the potion, including what color it should turn."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "sopophorous bean",
      "relationship_type": "has_problem_cutting",
      "description": "Harry is trying to cut up the sopophorous bean, but it's proving difficult."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "asks_for_help",
      "description": "Harry turns to Hermione for help with cutting up the sopophorous bean."
    },
    {
      "entity_1": "harry",
      "entity_2": "silver knife",
      "relationship_type": "borrows",
      "description": "Harry asks to borrow Hermione's silver knife to cut up the sopophorous bean."
    },
    {
      "entity_1": "harry",
      "entity_2": "cauldron",
      "relationship_type": "pours_into",
      "description": "Harry scoops the juice of the sopophorous bean into the cauldron."
    },
    {
      "entity_1": "textbook",
      "entity_2": "harry",
      "relationship_type": "provides_instructions",
      "description": "The textbook provides instructions for preparing the potion, including what color it should turn."
    }
  ]
}