{
  "entities": [
    {
      "name": "lavender brown",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender Brown is described as glaring at Hermione from a neighbouring table through very red eyes. This indicates that she has strong emotions and is paying attention to what's happening around her."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as noticing Lavender Brown glaring at Hermione, indicating that he is aware of the situation unfolding before him."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as letting go of Ron's arm when she sees Lavender Brown glaring at her, indicating that she is sensitive to the situation and wants to avoid conflict."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as looking down at his shoulders in vague surprise when he notices they have dandruff, indicating that he is concerned about his appearance and is trying to make sense of the situation."
    }
  ],
  "relationships": [
    {
      "entity_1": "lavender brown",
      "entity_2": "hermione",
      "relationship_type": "glared_at",
      "description": "Lavender Brown glares at Hermione from a neighbouring table, indicating that she has strong emotions towards her."
    },
    {
      "entity_1": "harry",
      "entity_2": "lavender brown",
      "relationship_type": "noticed",
      "description": "Harry notices Lavender Brown glaring at Hermione, indicating that he is aware of the situation unfolding before him."
    },
    {
      "entity_1": "hermione",
      "entity_2": "ron",
      "relationship_type": "let_go_of",
      "description": "Hermione lets go of Ron's arm when she sees Lavender Brown glaring at her, indicating that she is sensitive to the situation and wants to avoid conflict."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "looked_at",
      "description": "Ron looks down at his shoulders in vague surprise when he notices they have dandruff, indicating that he is concerned about his appearance and is trying to make sense of the situation."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "was_holding",
      "description": "Ron was holding Hermione's arm before she let go, indicating that they were physically connected and interacting with each other."
    }
  ]
}