{
  "entities": [
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is the Minister of Magic, as mentioned in the text. He is speaking to the Prime Minister about the threat posed by Voldemort and his followers."
    },
    {
      "name": "prime minister",
      "entity_type": "position",
      "singular": true,
      "description": "The Prime Minister is a government official who is being briefed by Fudge on the situation with Voldemort. He seems nervous and unsure about the threat posed by Voldemort."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort, also known as 'He Who Must Not Be Named', is a dark wizard who has joined forces with his followers and is wreaking havoc. He is mentioned by Fudge as the main threat to the government."
    },
    {
      "name": "azkaban",
      "entity_type": "location",
      "singular": true,
      "description": "Azkaban is a prison for wizards, where some of Voldemort's followers were being held. They broke out in January and have since joined forces with Voldemort."
    }
  ],
  "relationships": [
    {
      "entity_1": "fudge",
      "entity_2": "prime minister",
      "relationship_type": "informing",
      "description": "Fudge is informing the Prime Minister about the threat posed by Voldemort and his followers. He is briefing him on the situation."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "azkaban",
      "relationship_type": "escaped_from",
      "description": "Voldemort's followers broke out of Azkaban prison in January, joining forces with Voldemort and posing a threat to the government."
    },
    {
      "entity_1": "voldemort",
      "entity_2": "fudge",
      "relationship_type": "threatening",
      "description": "Voldemort is threatening Fudge and the government by demanding that they stand aside for him. He has also threatened a mass Muggle killing unless his demands are met."
    }
  ]
}