{
  "entities": [
    {
      "name": "room",
      "entity_type": "location",
      "singular": true,
      "description": "The room is described as having gone very quiet, indicating it's a significant setting for the scene."
    },
    {
      "name": "Harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as looking over Ginny's head to see what's happening, showing he's actively engaged in the scene."
    },
    {
      "name": "Ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as being on Harry's left, and he looks over her head to see what's happening, indicating she's part of the scene."
    },
    {
      "name": "Dean Thomas",
      "entity_type": "person",
      "singular": true,
      "description": "Dean Thomas is introduced holding a shattered glass in his hand, showing he's involved in some kind of incident."
    },
    {
      "name": "Romilda Vane",
      "entity_type": "person",
      "singular": true,
      "description": "Romilda Vane is described as looking like she might throw something, indicating she's upset or angry about something."
    },
    {
      "name": "Hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as beaming, showing she's happy or pleased about something."
    },
    {
      "name": "Ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is introduced still clutching the Cup and wearing an expression appropriate to having been clubbed over the head, indicating he's been injured or affected by some kind of incident."
    }
  ],
  "relationships": [
    {
      "entity_1": "Harry",
      "entity_2": "Ginny",
      "relationship_type": "looked_over",
      "description": "Harry looked over Ginny's head to see what was happening, indicating he's actively engaged in the scene and aware of her presence."
    },
    {
      "entity_1": "Harry",
      "entity_2": "Dean Thomas",
      "relationship_type": "saw",
      "description": "Harry saw Dean Thomas holding a shattered glass in his hand, showing he's aware of what's happening to him."
    },
    {
      "entity_1": "Harry",
      "entity_2": "Romilda Vane",
      "relationship_type": "saw",
      "description": "Harry saw Romilda Vane looking like she might throw something, indicating he's aware of her emotional state."
    },
    {
      "entity_1": "Harry",
      "entity_2": "Hermione",
      "relationship_type": "saw",
      "description": "Harry saw Hermione beaming, showing he's aware of her happy or pleased expression."
    },
    {
      "entity_1": "Harry",
      "entity_2": "Ron",
      "relationship_type": "looked_at",
      "description": "Harry looked at Ron, who was still clutching the Cup and wearing an expression appropriate to having been clubbed over the head, indicating they have a connection or relationship."
    },
    {
      "entity_1": "Ron",
      "entity_2": "Harry",
      "relationship_type": "looked_at",
      "description": "Ron looked at Harry for a fraction of a second before giving him a tiny jerk of the head, indicating they have a connection or relationship."
    }
  ]
}