{
  "entities": [
    {
      "name": "lavender brown",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender Brown is mentioned as the one who shrieked at Harry. She is staring right through Harry at Ron and Hermione emerging together from the boys' dormitories."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as being stared at by Lavender Brown, and he is also the one who heard Ron spluttering behind him. He is able to slip between Ginny and Dean through the portrait hole."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as being with Hermione, emerging together from the boys' dormitories. Harry heard him spluttering behind him."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as emerging together with Ron from the boys' dormitories."
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as coming through the portrait hole with Dean, and Harry brushes against her accidentally. She sounds annoyed at Dean for pushing her."
    },
    {
      "name": "dean",
      "entity_type": "person",
      "singular": true,
      "description": "Dean is mentioned as coming through the portrait hole with Ginny, and he pushes Ginny, making her sound annoyed."
    }
  ],
  "relationships": [
    {
      "entity_1": "lavender brown",
      "entity_2": "harry",
      "relationship_type": "stared_at",
      "description": "Lavender Brown is staring right through Harry at Ron and Hermione emerging together from the boys' dormitories."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "spluttered_behind",
      "description": "Harry heard Ron spluttering behind him as he darted across the room away from them."
    },
    {
      "entity_1": "ginny",
      "entity_2": "dean",
      "relationship_type": "pushed_by",
      "description": "'Don't push me, please, Dean,' she said, sounding annoyed. 'You're always doing that, I can get through perfectly well on my own ...'"
    },
    {
      "entity_1": "harry",
      "entity_2": "ginny",
      "relationship_type": "brushed_against",
      "description": "As he did so, he brushed accidentally against Ginny."
    }
  ]
}