{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as a quiet and calm character who is investigating the death. He is described as saying 'I shouldn't think so, no' in response to Mrs Cole's question."
    },
    {
      "name": "billy",
      "entity_type": "person",
      "singular": true,
      "description": "Billy is mentioned as someone who had argued with Tom Riddle the day before his death."
    },
    {
      "name": "amy benson",
      "entity_type": "person",
      "singular": true,
      "description": "Amy Benson is mentioned as one of the people who went into a cave with Tom Riddle and experienced something strange afterwards."
    },
    {
      "name": "dennis bishop",
      "entity_type": "person",
      "singular": true,
      "description": "Dennis Bishop is mentioned as someone who went into a cave with Tom Riddle and experienced something strange afterwards."
    },
    {
      "name": "tom riddle",
      "entity_type": "person",
      "singular": true,
      "description": "Tom Riddle is mentioned as the person who died. He is also described as having argued with Billy the day before his death and as going into a cave with Amy Benson and Dennis Bishop."
    },
    {
      "name": "mrs cole",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Cole is mentioned as someone who is investigating the death along with Dumbledore. She is described as taking a swig of gin and slopping some over her chin."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "tom riddle",
      "relationship_type": "investigation",
      "description": "Dumbledore is investigating the death of Tom Riddle."
    },
    {
      "entity_1": "billy",
      "entity_2": "tom riddle",
      "relationship_type": "argument",
      "description": "Billy had argued with Tom Riddle the day before his death."
    },
    {
      "entity_1": "amy benson",
      "entity_2": "tom riddle",
      "relationship_type": "interaction",
      "description": "Amy Benson went into a cave with Tom Riddle and experienced something strange afterwards."
    },
    {
      "entity_1": "dennis bishop",
      "entity_2": "tom riddle",
      "relationship_type": "interaction",
      "description": "Dennis Bishop went into a cave with Tom Riddle and experienced something strange afterwards."
    }
  ]
}