{
  "entities": [
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "The main protagonist of the story. Harry is mentioned as reacting to an announcement about Eileen Prince and her son Tobias Snape."
    },
    {
      "name": "eileen prince",
      "entity_type": "person",
      "singular": true,
      "description": "Eileen Prince is mentioned in an announcement about marrying a man called Tobias Snape. She later gives birth to a child."
    },
    {
      "name": "tobias snape",
      "entity_type": "character",
      "singular": true,
      "description": "Tobias Snape is the son of Eileen Prince and a Muggle man. He is mentioned in an announcement about his mother's marriage and later as being referred to by Harry."
    },
    {
      "name": "hermione",
      "entity_type": "character",
      "singular": true,
      "description": "Hermione is a character who reacts to the news about Eileen Prince and her son Tobias Snape."
    },
    {
      "name": "lucius malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Lucius Malfoy is mentioned as being related to Tobias Snape through his marriage with Narcissa (not explicitly stated in this text but known from the Harry Potter series)."
    },
    {
      "name": "dumbledore",
      "entity_type": "character",
      "singular": true,
      "description": "Dumbledore is a character who is criticized by Harry for trusting Tobias Snape."
    },
    {
      "name": "voldemort",
      "entity_type": "person",
      "singular": true,
      "description": "Voldemort is mentioned as being similar to Tobias Snape in terms of his background and behavior."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "dumbledore",
      "relationship_type": "criticism",
      "description": "Harry criticizes Dumbledore for trusting Tobias Snape."
    },
    {
      "entity_1": "tobias snape",
      "entity_2": "voldemort",
      "relationship_type": "similarity",
      "description": "Tobias Snape is compared to Voldemort in terms of his background and behavior."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "conversation",
      "description": "Harry has a conversation with Hermione about Eileen Prince and her son Tobias Snape."
    },
    {
      "entity_1": "tobias snape",
      "entity_2": "lucius malfoy",
      "relationship_type": "marriage",
      "description": "Tobias Snape is related to Lucius Malfoy through his marriage with Narcissa (not explicitly stated in this text but known from the Harry Potter series)."
    }
  ]
}