{
  "entities": [
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is a student at Hogwarts who is friends with Harry and Hermione. She is described as positively beaming when talking to Hermione, indicating that she feels guilty for laughing at her in Transfiguration class."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a student at Hogwarts who is friends with Harry and Parvati. She is described as beaming back at Parvati, indicating that she has forgiven her for laughing at her in Transfiguration class."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a student at Hogwarts who is friends with Harry and Hermione. He is described as surfacing after making a noise like a plunger being withdrawn from a blocked sink."
    },
    {
      "name": "lavender",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender is a student at Hogwarts who is mentioned as being ignored by Hermione when she talks to Parvati."
    },
    {
      "name": "slughorn",
      "entity_type": "professor",
      "singular": true,
      "description": "Professor Slughorn is the head of the Potions department at Hogwarts. He is hosting a party that Parvati and Hermione are interested in attending."
    },
    {
      "name": "cormac",
      "entity_type": "person",
      "singular": true,
      "description": "Cormac is a person who is mentioned as being met by Hermione at eight o'clock to attend Professor Slughorn's party."
    }
  ],
  "relationships": [
    {
      "entity_1": "parvati",
      "entity_2": "hermione",
      "relationship_type": "friendship",
      "description": "Parvati and Hermione are friends, as indicated by their positive interaction with each other."
    },
    {
      "entity_1": "parvati",
      "entity_2": "slughorn",
      "relationship_type": "attendance",
      "description": "Parvati is interested in attending Professor Slughorn's party."
    },
    {
      "entity_1": "hermione",
      "entity_2": "slughorn",
      "relationship_type": "attendance",
      "description": "Hermione is also interested in attending Professor Slughorn's party."
    },
    {
      "entity_1": "parvati",
      "entity_2": "cormac",
      "relationship_type": "meeting",
      "description": "Parvati is meeting Cormac at eight o'clock to attend Professor Slughorn's party."
    }
  ]
}