{
  "entities": [
    {
      "name": "madam malkin",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Malkin is a person who tries to roll up Harry's sleeve, but he jerks his arm away. She is described as someone who does not touch Harry."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character in the story. He has been branded with the Dark Mark on his left arm and tries to convince Ron and Hermione that he showed Borgin something important."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person who looks at Hermione when Harry says he was showing Borgin something. He sounds unconvinced by Harry's story."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who tries to convince Ron that Harry just wanted to get out of there, but she also believes that Harry was showing Borgin something important."
    },
    {
      "name": "borgin",
      "entity_type": "person",
      "singular": true,
      "description": "Borgin is a person who is scared by what Harry shows him. He takes Harry seriously and is described as being seriously affected by it."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "borgin",
      "relationship_type": "showed_something_to",
      "description": "Harry shows Borgin something that scares him. This is described as Harry trying to convince Ron and Hermione that he was showing Borgin who he was dealing with."
    },
    {
      "entity_1": "harry",
      "entity_2": "madam malkin",
      "relationship_type": "had_interaction_with",
      "description": "Harry has an interaction with Madam Malkin when she tries to roll up his sleeve, but he jerks his arm away."
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "tried_to_convince",
      "description": "Harry tries to convince Ron that he was showing Borgin something important. Ron is unconvinced by Harry's story."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "tried_to_convince",
      "description": "Harry tries to convince Hermione that he was showing Borgin something important. Hermione believes him and thinks Harry just wanted to get out of there."
    },
    {
      "entity_1": "borgin",
      "entity_2": "harry",
      "relationship_type": "was_scared_by",
      "description": "Borgin is scared by what Harry shows him. He takes Harry seriously and is described as being seriously affected by it."
    }
  ]
}