{
  "entities": [
    {
      "name": "bellatrix",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix is a Death Eater who has been questioning Snape's loyalty. She asks if he has never suspected him of being unfaithful to the Dark Lord."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape claims to have played his part well in deceiving Dumbledore and that he has been able to keep his allegiance hidden. He also mentions that Dumbledore trusts him implicitly."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is described as a great wizard who has always trusted Snape despite being aware of his past as a Death Eater. His age and injury are also mentioned as factors that make him vulnerable."
    },
    {
      "name": "dark lord",
      "entity_type": "organization",
      "singular": true,
      "description": "The Dark Lord is the leader of the Death Eaters and is acknowledged by Bellatrix to be powerful. Snape mentions that Dumbledore's trust in him is his great value to the Dark Lord."
    },
    {
      "name": "death eaters",
      "entity_type": "organization",
      "singular": false,
      "description": "Bellatrix is a member of the Death Eaters and Snape has been one as well. They are followers of the Dark Lord."
    }
  ],
  "relationships": [
    {
      "entity_1": "bellatrix",
      "entity_2": "snape",
      "relationship_type": "questioned",
      "description": "Bellatrix questions Snape's loyalty to the Dark Lord, asking if he has never suspected him."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "snape",
      "relationship_type": "trusted",
      "description": "Dumbledore trusts Snape despite knowing about his past as a Death Eater."
    },
    {
      "entity_1": "dark lord",
      "entity_2": "snape",
      "relationship_type": "valued",
      "description": "Snape's ability to deceive Dumbledore is his great value to the Dark Lord."
    }
  ]
}