{
  "entities": [
    {
      "name": "narcissa",
      "entity_type": "person",
      "singular": true,
      "description": "Narcissa is a person who is talking to Snape and asking for his help in protecting Draco. She is described as quietening down after being told to drink wine, and then she sits up and asks Snape if he will look after Draco."
    },
    {
      "name": "draco",
      "entity_type": "person",
      "singular": true,
      "description": "Draco is a person who Narcissa is asking Snape to protect. He is mentioned as someone who might be in harm's way."
    },
    {
      "name": "severus snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is a person who Narcissa is talking to and asking for his help in protecting Draco. He is described as being asked if he will look after Draco and make the Unbreakable Vow."
    },
    {
      "name": "bellatrix",
      "entity_type": "person",
      "singular": true,
      "description": "Bellatrix is a person who lets out a cackle of triumphant laughter when she hears Snape's response to Narcissa's request. She is described as someone who thinks Snape will not follow through on his promise."
    },
    {
      "name": "dark lord",
      "entity_type": "organization",
      "singular": true,
      "description": "The Dark Lord is an organization that Bellatrix mentions as the reason why Snape might slither out of action."
    }
  ],
  "relationships": [
    {
      "entity_1": "narcissa",
      "entity_2": "severus snape",
      "relationship_type": "asks_for_help",
      "description": "Narcissa asks Severus Snape for his help in protecting Draco. She is described as being desperate and pleading with him to make the Unbreakable Vow."
    },
    {
      "entity_1": "narcissa",
      "entity_2": "draco",
      "relationship_type": "concerned_about",
      "description": "Narcissa is concerned about Draco's safety and asks Snape to protect him. She is described as being worried that Draco might come to harm."
    },
    {
      "entity_1": "bellatrix",
      "entity_2": "severus snape",
      "relationship_type": "doubts",
      "description": "Bellatrix doubts Snape's ability to follow through on his promise to help Narcissa protect Draco. She is described as thinking that Snape will not make the Unbreakable Vow."
    },
    {
      "entity_1": "bellatrix",
      "entity_2": "dark lord",
      "relationship_type": "associated_with",
      "description": "Bellatrix is associated with the Dark Lord and mentions him as the reason why Snape might slither out of action."
    }
  ]
}