{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as Harry's favourite and the one who will always be there to protect him. (\"I see that being Dumbledore’s favourite has given you a false sense of security, Harry Potter.\")"
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as Dumbledore's favourite and the one who will be reunited with Sirius. (\"I see that being Dumbledore’s favourite has given you a false sense of security, Harry Potter.\")"
    },
    {
      "name": "narcissa malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Narcissa is mentioned as the one who restrained Draco and talked to Harry. (\"It’s all right, Draco,’ said Narcissa, restraining him with her thin white fingers upon his shoulder.\")"
    },
    {
      "name": "draco malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Draco is mentioned as the one who made an angry movement towards Harry and was restrained by Narcissa. (\"Malfoy made an angry movement towards Harry , but stumbled over his overlong robe.\")"
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as the one who laughed loudly when Draco stumbled. (\"Ron laughed loudly .\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who was talked to by Narcissa and had a wand raised higher. (\"‘It’s all right, Draco,’ said Narcissa, restraining him with her thin white fingers upon his shoulder.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as the one who grabbed Harry's arm and moaned. (\"‘Harry , no!’ moaned Hermione, grabbing his arm and\""
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as the one who Harry will be reunited with. (\"I expect Potter will be reunited with dear Sirius before I am reunited with Lucius.\")"
    },
    {
      "name": "lucius",
      "entity_type": "person",
      "singular": true,
      "description": "Lucius is mentioned as the one whom Narcissa will be reunited with. (\"I expect Potter will be reunited with dear Sirius before I am reunited with Lucius.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "harry potter",
      "relationship_type": "favourite_of",
      "description": "Dumbledore is Harry's favourite. (\"I see that being Dumbledore’s favourite has given you a false sense of security, Harry Potter.\")"
    },
    {
      "entity_1": "narcissa malfoy",
      "entity_2": "draco malfoy",
      "relationship_type": "restrainer_of",
      "description": "Narcissa restrained Draco. (\"It’s all right, Draco,’ said Narcissa, restraining him with her thin white fingers upon his shoulder.\")"
    },
    {
      "entity_1": "narcissa malfoy",
      "entity_2": "lucius",
      "relationship_type": "reunited_with",
      "description": "Narcissa will be reunited with Lucius. (\"I expect Potter will be reunited with dear Sirius before I am reunited with Lucius.\")"
    },
    {
      "entity_1": "harry potter",
      "entity_2": "sirius",
      "relationship_type": "reunited_with",
      "description": "Harry will be reunited with Sirius. (\"I expect Potter will be reunited with dear Sirius before I am reunited with Lucius.\")"
    }
  ]
}