{
  "entities": [
    {
      "name": "vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Uncle Vernon is described as well-groomed compared to the man on television, and he is also shown to be furious at the reporter for not providing information about the escaped maniac. He is also mentioned as pounding the table with his large purple fist."
    },
    {
      "name": "ministry of agriculture and fisheries",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Agriculture and Fisheries will announce something today, according to the reporter."
    },
    {
      "name": "aunt petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Aunt Petunia is described as bony and horse-faced, and she is mentioned as being nosy and spending most of her life spying on the neighbors."
    },
    {
      "name": "reporter",
      "entity_type": "person",
      "singular": true,
      "description": "The reporter is mentioned as reappearing and providing information about the Ministry of Agriculture and Fisheries, but Uncle Vernon is furious at him for not providing enough information about the escaped maniac."
    },
    {
      "name": "man on television",
      "entity_type": "person",
      "singular": true,
      "description": "The man on television is described as having a gaunt face surrounded by a matted, elbow-length tangle, and Uncle Vernon feels well-groomed compared to him."
    },
    {
      "name": "maniac",
      "entity_type": "person",
      "singular": true,
      "description": "The maniac is mentioned as being escaped, and Uncle Vernon is furious at the reporter for not providing information about where he came from."
    }
  ],
  "relationships": [
    {
      "entity_1": "vernon",
      "entity_2": "man on television",
      "relationship_type": "comparison",
      "description": "Uncle Vernon feels well-groomed compared to the man on television, who has a gaunt face surrounded by a matted, elbow-length tangle."
    },
    {
      "entity_1": "vernon",
      "entity_2": "reporter",
      "relationship_type": "conflict",
      "description": "Uncle Vernon is furious at the reporter for not providing enough information about the escaped maniac."
    },
    {
      "entity_1": "aunt petunia",
      "entity_2": "hot line number",
      "relationship_type": "desire",
      "description": "Aunt Petunia would love to be the one to call the hot line number, indicating that she has a desire to do so."
    },
    {
      "entity_1": "vernon",
      "entity_2": "ministry of agriculture and fisheries",
      "relationship_type": "announcement",
      "description": "The Ministry of Agriculture and Fisheries will announce something today, according to the reporter, which is mentioned by Uncle Vernon as well."
    }
  ]
}