{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as someone who is frustrated and wants to practice something useful. She mentions catching up on Cheering Charms."
    },
    {
      "name": "professor trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Trelawney is introduced as a clairvoyant who offers to help others interpret the shadowy portents within their Orb."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as someone who thinks he knows what the portents mean, and that there will be loads of fog tonight."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as someone who feels his heart sinking when Professor Trelawney approaches their table to look at the crystal ball."
    },
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is mentioned as one of the people looking scandalized at Harry and Hermione's behavior."
    },
    {
      "name": "lavender",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender is mentioned as one of the people looking scandalized at Harry and Hermione's behavior."
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "professor trelawney",
      "relationship_type": "interaction",
      "description": "Hermione interacts with Professor Trelawney when she offers to help others interpret the shadowy portents within their Orb."
    },
    {
      "entity_1": "ron",
      "entity_2": "professor trelawney",
      "relationship_type": "interaction",
      "description": "Ron interacts with Professor Trelawney when he whispers that it's obvious what the portents mean."
    },
    {
      "entity_1": "harry",
      "entity_2": "professor trelawney",
      "relationship_type": "interaction",
      "description": "Harry interacts with Professor Trelawney when she approaches their table to look at the crystal ball."
    },
    {
      "entity_1": "parvati",
      "entity_2": "harry",
      "relationship_type": "reaction",
      "description": "Parvati reacts to Harry and Hermione's behavior by looking scandalized."
    },
    {
      "entity_1": "lavender",
      "entity_2": "harry",
      "relationship_type": "reaction",
      "description": "Lavender reacts to Harry and Hermione's behavior by looking scandalized."
    }
  ]
}