{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as the one who doesn't think other people's pets matter very much. She is also described as looking daggers at Ron."
    },
    {
      "name": "lavender",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender is mentioned in the same sentence as Hermione, but no further description is given."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as looking daggers at Hermione and not talking to her for the whole class."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "teacher",
      "singular": true,
      "description": "Professor McGonagall is introduced as opening the classroom door and bringing up the subject of Hogsmeade permission forms."
    },
    {
      "name": "harry",
      "entity_type": "student",
      "singular": true,
      "description": "Harry is mentioned as sitting between Hermione and Ron in class and not talking to them."
    },
    {
      "name": "neville",
      "entity_type": "student",
      "singular": true,
      "description": "Neville is described as putting up his hand to ask a question about losing the permission form."
    },
    {
      "name": "hogsmeade",
      "entity_type": "location",
      "singular": false,
      "description": "Hogsmeade is mentioned as a village that students can visit with permission."
    },
    {
      "name": "longbottom",
      "entity_type": "family",
      "singular": true,
      "description": "Longbottom is mentioned as Neville's surname and his grandmother sending the permission form directly to Professor McGonagall."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "hogsmeade",
      "relationship_type": "related_to",
      "description": "Professor McGonagall is related to Hogsmeade as she brings up the subject of permission forms for visiting the village."
    },
    {
      "entity_1": "neville",
      "entity_2": "longbottom",
      "relationship_type": "family_member_of",
      "description": "Neville is a family member of Longbottom, as indicated by his surname."
    }
  ]
}