{
  "entities": [
    {
      "name": "pettigrew",
      "entity_type": "person",
      "singular": true,
      "description": "Pettigrew is a person who had dived for Lupin's dropped wand and later transformed into a werewolf. (\"Pettigrew had dived for Lupin’s dropped wand.\")"
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is a person whose wand was dropped by Pettigrew. (\"Pettigrew had dived for Lupin’s dropped wand.\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person who fell on his bandaged leg and was later motionless on the ground. (\"Ron, unsteady on his bandaged leg, fell.\")"
    },
    {
      "name": "crookshanks",
      "entity_type": "animal",
      "singular": true,
      "description": "Crookshanks is a cat who flew into the air and back to the earth in a heap. (\"Another bang — Crookshanks ﬂew into the air and back to the earth in a heap.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who yelled \"Expelliarmus!\" and pointed his own wand at Pettigrew. (\"‘Expelliarmus!’ Harry yelled, pointing his own wand at Pettigrew;\")"
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is a person who was bleeding and had gashes across his muzzle and back. (\"Black was bleeding; there were gashes across his muzzle and back,\")"
    },
    {
      "name": "black",
      "entity_type": "animal",
      "singular": true,
      "description": "Black is a werewolf who took flight and galloped into the forest. (\"There was a howl and a rumbling growl; Harry turned to see the werewolf taking ﬂight;\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "pettigrew",
      "entity_2": "lupin",
      "relationship_type": "had_dropped_wand_of",
      "description": "Pettigrew had dived for Lupin's dropped wand. (\"Pettigrew had dived for Lupin’s dropped wand.\")"
    },
    {
      "entity_1": "pettigrew",
      "entity_2": "ron",
      "relationship_type": "transformed_into_werewolf_near",
      "description": "Harry saw Pettigrew's bald tail whip through the manacle on Ron's outstretched arm. (\"Harry saw his bald tail whip through the manacle on Ron’s outstretched arm\")"
    },
    {
      "entity_1": "pettigrew",
      "entity_2": "harry",
      "relationship_type": "was_attacked_by",
      "description": "Harry yelled \"Expelliarmus!\" and pointed his own wand at Pettigrew. (\"‘Expelliarmus!’ Harry yelled, pointing his own wand at Pettigrew;\")"
    },
    {
      "entity_1": "black",
      "entity_2": "pettigrew",
      "relationship_type": "chased_after",
      "description": "Sirius was bleeding and had gashes across his muzzle and back, but he scrambled up again to chase after Pettigrew. (\"Black was bleeding; there were gashes across his muzzle and back, but at Harry’s words he scrambled up again,\")"
    }
  ]
}