{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a gamekeeper and Care of Magical Creatures teacher at Hogwarts School of Witchcraft and Wizardry. He is described as gloomy, with a sudden shudder when talking about dementors."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is one of Harry's best friends at Hogwarts. He reacts to Hagrid's news with concern, his lip twitching."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is one of Harry's best friends at Hogwarts. She asks Hagrid about his experience in Azkaban, showing concern and empathy."
    },
    {
      "name": "azkaban",
      "entity_type": "place",
      "singular": true,
      "description": "Azkaban is a maximum-security prison for wizards and witches. Hagrid describes it as a place where he felt terrible and like going mad."
    },
    {
      "name": "norbert",
      "entity_type": "animal",
      "singular": true,
      "description": "Norbert is a baby dragon that Hagrid won in a game of cards. He mentions Norbert as one of the painful memories from his past."
    },
    {
      "name": "hogwarts",
      "entity_type": "school",
      "singular": true,
      "description": "Hogwarts is a school for wizards and witches. Hagrid mentions being expelled from Hogwarts, which is a painful memory for him."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "azkaban",
      "relationship_type": "experienced_in",
      "description": "Hagrid has experienced the horrors of Azkaban, which is a maximum-security prison for wizards and witches."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "hogwarts",
      "relationship_type": "expelled_from",
      "description": "Hagrid was expelled from Hogwarts, which is a painful memory for him."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "norbert",
      "relationship_type": "owned",
      "description": "Hagrid once won Norbert in a game of cards and mentions him as one of the painful memories from his past."
    }
  ]
}