{
  "entities": [
    {
      "name": "minister",
      "entity_type": "person",
      "singular": true,
      "description": "The minister is mentioned as someone who was present earlier, but not currently visible. (\"No, Minister … by the time I had come ’round they were heading back to their positions at the entrances.\")"
    },
    {
      "name": "black",
      "entity_type": "person",
      "singular": true,
      "description": "Black is mentioned as someone who was unconscious and bound and gagged by the narrator. (\"I bound and gagged Black, naturally\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a main character in the story, mentioned as someone who was unconscious but now opening his eyes. (\"He opened his eyes.\")"
    },
    {
      "name": "madam pomfrey",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Pomfrey is a nurse in the hospital, mentioned as someone who is tending to Ron and Hermione. (\"At the very end of the ward, he could make out Madam Pomfrey with her back to him, bending over a bed.\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who is being tended to by Madam Pomfrey. (\"Ron’s red hair was visible beneath Madam Pomfrey’s arm.\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who is lying in bed and looking petrified. (\"In the bed to his right lay Hermione. Moonlight was falling across her bed.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "madam pomfrey",
      "relationship_type": "tending_to",
      "description": "Madam Pomfrey is tending to Harry, as evidenced by the fact that she is bending over his bed. (\"At the very end of the ward, he could make out Madam Pomfrey with her back to him, bending over a bed.\")"
    },
    {
      "entity_1": "madam pomfrey",
      "entity_2": "ron",
      "relationship_type": "tending_to",
      "description": "Madam Pomfrey is also tending to Ron, as evidenced by the fact that his red hair is visible beneath her arm. (\"Ron’s red hair was visible beneath Madam Pomfrey’s arm.\")"
    },
    {
      "entity_1": "madam pomfrey",
      "entity_2": "hermione",
      "relationship_type": "tending_to",
      "description": "Madam Pomfrey is tending to Hermione, as evidenced by the fact that she is bending over her bed. (\"At the very end of the ward, he could make out Madam Pomfrey with her back to him, bending over a bed.\")"
    }
  ]
}