{
  "entities": [
    {
      "name": "professor trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Trelawney is introduced as a character who sweeps over to Harry with a dustpan and brush. She asks for one of the blue ones, indicating that she is collecting something."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as a character who has teacups filled by Professor Trelawney. He tries to drink the scalding tea quickly with Ron."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is introduced as Harry's friend, who has teacups filled by Professor Trelawney and tries to drink the scalding tea quickly with Harry."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor trelawney",
      "entity_2": "harry",
      "relationship_type": "requests_something_from",
      "description": "Professor Trelawney asks Harry for one of the blue ones, indicating that she is requesting something from him."
    },
    {
      "entity_1": "professor trelawney",
      "entity_2": "ron",
      "relationship_type": "requests_something_from",
      "description": "Professor Trelawney also asks Ron for one of the blue ones, indicating that she is requesting something from him as well."
    },
    {
      "entity_1": "harry",
      "entity_2": "professor trelawney",
      "relationship_type": "receives_instruction_from",
      "description": "Harry receives instruction from Professor Trelawney to broaden his mind and see past the mundane, indicating that he is receiving guidance or advice from her."
    },
    {
      "entity_1": "ron",
      "entity_2": "professor trelawney",
      "relationship_type": "receives_instruction_from",
      "description": "Ron also receives instruction from Professor Trelawney to broaden his mind and see past the mundane, indicating that he is receiving guidance or advice from her as well."
    }
  ]
}