{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as having a particularly bad time of it, being surrounded by people, and being concerned for his Firebolt's safety. (Excerpt: 'He couldn’t walk to class without Slytherins sticking out their legs and trying to trip him up; Crabbe and Goyle kept popping up wherever he went...')"
    },
    {
      "name": "slytherin",
      "entity_type": "house",
      "singular": true,
      "description": "Slytherin is described as sticking out their legs and trying to trip Harry up, and putting him out of action. (Excerpt: 'He couldn’t walk to class without Slytherins sticking out their legs and trying to trip him up...')"
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is described as popping up wherever Harry went, looking disappointed when they saw him surrounded by people. (Excerpt: 'Crabbe and Goyle kept popping up wherever he went...')"
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is described as popping up wherever Harry went, looking disappointed when they saw him surrounded by people. (Excerpt: 'Crabbe and Goyle kept popping up wherever he went...')"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as being present in the Gryffindor common room the night before the match. (Excerpt: 'All usual pursuits were abandoned in the Gryﬀindor common room the night before the match. Even Hermione...')"
    },
    {
      "name": "gryffindor",
      "entity_type": "house",
      "singular": true,
      "description": "Gryffindor is described as taking up the challenge enthusiastically to accompany Harry everywhere he went. (Excerpt: 'The whole of Gryﬀindor House took up the challenge enthusiastically...')"
    },
    {
      "name": "wood",
      "entity_type": "person",
      "singular": true,
      "description": "Wood is described as giving instructions that Harry should be accompanied everywhere he went. (Excerpt: 'Wood had given instructions that Harry should be accompanied everywhere he went...')"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "slytherin",
      "relationship_type": "target_of",
      "description": "Harry is targeted by Slytherins, who try to trip him up and put him out of action. (Excerpt: 'He couldn’t walk to class without Slytherins sticking out their legs and trying to trip him up...')"
    },
    {
      "entity_1": "harry",
      "entity_2": "crabbe",
      "relationship_type": "target_of",
      "description": "Harry is targeted by Crabbe, who pops up wherever Harry goes. (Excerpt: 'Crabbe and Goyle kept popping up wherever he went...')"
    },
    {
      "entity_1": "harry",
      "entity_2": "goyle",
      "relationship_type": "target_of",
      "description": "Harry is targeted by Goyle, who pops up wherever Harry goes. (Excerpt: 'Crabbe and Goyle kept popping up wherever he went...')"
    },
    {
      "entity_1": "gryffindor",
      "entity_2": "harry",
      "relationship_type": "protector_of",
      "description": "Gryffindor House takes up the challenge to protect Harry and accompany him everywhere he goes. (Excerpt: 'The whole of Gryﬀindor House took up the challenge enthusiastically...')"
    },
    {
      "entity_1": "wood",
      "entity_2": "harry",
      "relationship_type": "protector_of",
      "description": "Wood gives instructions to protect Harry and accompany him everywhere he goes. (Excerpt: 'Wood had given instructions that Harry should be accompanied everywhere he went...')"
    }
  ]
}