{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as a person who might be hiding something, but no specific details are given. (\"D'you get the feeling Hermione's not telling us something? Ron asked Harry.\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as a person who asks Harry if he thinks Hermione is hiding something. (\"D'you get the feeling Hermione's not telling us something? Ron asked Harry.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a person who is being asked by Ron if he thinks Hermione is hiding something. (\"D'you get the feeling Hermione's not telling us something? Ron asked Harry.\")"
    },
    {
      "name": "professor lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Lupin is introduced as a new Defense Against the Dark Arts teacher. He is described as shabby but healthier than before. (\"Professor Lupin wasn't there when they arrived at his first Defense Against the Dark Arts lesson.\")"
    },
    {
      "name": "defense against the dark arts",
      "entity_type": "subject",
      "singular": true,
      "description": "Defense Against the Dark Arts is mentioned as a subject that Professor Lupin teaches. (\"Professor Lupin wasn't there when they arrived at his first Defense Against the Dark Arts lesson.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "asked",
      "description": "Ron asks Harry if he thinks Hermione is hiding something. (\"D'you get the feeling Hermione's not telling us something? Ron asked Harry.\")"
    },
    {
      "entity_1": "professor lupin",
      "entity_2": "defense against the dark arts",
      "relationship_type": "teaches",
      "description": "Professor Lupin teaches Defense Against the Dark Arts. (\"Professor Lupin wasn't there when they arrived at his first Defense Against the Dark Arts lesson.\")"
    }
  ]
}