{
  "entities": [
    {
      "name": "scabbers",
      "entity_type": "animal_name",
      "singular": true,
      "description": "Scabbers is Hermione's pet rat, which she suspects might be Peter Pettigrew in disguise. This is mentioned when Hermione says 'Scabbers can't be Pettigrew...'"
    },
    {
      "name": "pettigrew",
      "entity_type": "person_name",
      "singular": true,
      "description": "Peter Pettigrew, a wizard who has been in hiding. This is mentioned when Hermione says 'it just can't be true, you know it can't... that Scabbers can't be Pettigrew'."
    },
    {
      "name": "lupin",
      "entity_type": "person_name",
      "singular": true,
      "description": "Professor Lupin, a teacher at Hogwarts. This is mentioned when he responds to Hermione's question with 'Why can't it be true?' and then laughs."
    },
    {
      "name": "hermione",
      "entity_type": "person_name",
      "singular": true,
      "description": "Hermione Granger, a student at Hogwarts. This is mentioned when she asks her question about Scabbers being Pettigrew in disguise and then explains why it can't be true."
    },
    {
      "name": "mcgonagall",
      "entity_type": "person_name",
      "singular": true,
      "description": "Professor McGonagall, a teacher at Hogwarts. This is mentioned when Hermione says 'We did Animagi in class with Professor McGonagall'."
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization_name",
      "singular": true,
      "description": "The Ministry of Magic, which keeps tabs on witches and wizards who can become animals. This is mentioned when Hermione says 'the Ministry of Magic keeps tabs on witches and wizards who can become animals'."
    },
    {
      "name": "harry",
      "entity_type": "person_name",
      "singular": true,
      "description": "Harry Potter, a student at Hogwarts. This is mentioned when he thinks to himself about the effort Hermione puts into her homework."
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "scabbers",
      "relationship_type": "suspects",
      "description": "Hermione suspects that Scabbers might be Peter Pettigrew in disguise. This is mentioned when she says 'Scabbers can't be Pettigrew...'"
    },
    {
      "entity_1": "lupin",
      "entity_2": "hermione",
      "relationship_type": "teaches",
      "description": "Professor Lupin teaches Hermione in class. This is mentioned when he responds to her question with 'Why can't it be true?' and then laughs."
    },
    {
      "entity_1": "mcgonagall",
      "entity_2": "lupin",
      "relationship_type": "taught",
      "description": "Professor McGonagall taught Professor Lupin Animagi in class. This is mentioned when Hermione says 'We did Animagi in class with Professor McGonagall'."
    },
    {
      "entity_1": "hermione",
      "entity_2": "mcgonagall",
      "relationship_type": "looked_up",
      "description": "Hermione looked up Professor McGonagall on the register of Animagi. This is mentioned when she says 'I went and looked Professor McGonagall up on the register...'"
    },
    {
      "entity_1": "ministry of magic",
      "entity_2": "mcgonagall",
      "relationship_type": "monitors",
      "description": "The Ministry of Magic monitors witches and wizards who can become animals, including Professor McGonagall. This is mentioned when Hermione says 'the Ministry of Magic keeps tabs on witches and wizards who can become animals'."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "observes",
      "description": "Harry observes the effort that Hermione puts into her homework. This is mentioned when he thinks to himself about it."
    }
  ]
}