{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story. He is described as choking and struggling to free himself from a tangle of bodies."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "A friend of Harry's who joins in the fight against Black. She is described as gasping for breath and bleeding from her lip."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Another friend of Harry's who helps him in the fight against Black. He is described as throwing himself on Black's wand hand."
    },
    {
      "name": "black",
      "entity_type": "person",
      "singular": true,
      "description": "The antagonist of the story, who is being fought by Harry and his friends. He is described as letting go of Harry with a grunt of pain."
    },
    {
      "name": "crookshanks",
      "entity_type": "animal",
      "singular": true,
      "description": "A cat that joins in the fight against Black. It is described as darting towards Harry's wand and spitting at him."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "black",
      "relationship_type": "fought_against",
      "description": "Harry and Black are fighting each other, as described in the text: 'He fought free of the tangle of bodies and saw his own wand rolling across the floor; he threw himself toward it but — ... Black let go of Harry with a grunt of pain'."
    },
    {
      "entity_1": "ron",
      "entity_2": "black",
      "relationship_type": "fought_against",
      "description": "Ron is also fighting against Black, as described in the text: 'Ron had thrown himself on Black’s wand hand and Harry heard a faint clatter —'."
    },
    {
      "entity_1": "harry",
      "entity_2": "crookshanks",
      "relationship_type": "fought_against",
      "description": "Harry is fighting against Crookshanks, as described in the text: '“NO YOU DON’T!” roared Harry, and he aimed a kick at Crookshanks that made the cat leap aside, spitting;'."
    },
    {
      "entity_1": "hermione",
      "entity_2": "black",
      "relationship_type": "fought_against",
      "description": "Hermione is also fighting against Black, as described in the text: 'They didn’t need telling twice. Hermione, gasping for breath, her lip bleeding, scrambled aside, snatching up her wand'."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "protected",
      "description": "Harry is protecting Hermione, as described in the text: '“Get out of the way!” he shouted at Ron and Hermione. They didn’t need telling twice'."
    }
  ]
}