{
  "entities": [
    {
      "name": "peter",
      "entity_type": "person",
      "singular": true,
      "description": "Peter is mentioned as someone who is at Hogwarts and has the ability to act if a hint reaches his ears that the Dark Side is gathering strength again. He is also referred to as 'the last Potter' and it is implied that he is still alive."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who is at Hogwarts with Peter and is the target of Lord Voldemort. He is also referred to as 'the last Potter'."
    },
    {
      "name": "pettigrew",
      "entity_type": "person",
      "singular": true,
      "description": "Pettigrew is mentioned as someone who is shaking his head and mouthing noiselessly, but staring at Black as though hypnotized."
    },
    {
      "name": "black",
      "entity_type": "person",
      "singular": true,
      "description": "Black is mentioned as someone who Pettigrew is staring at as though hypnotized."
    },
    {
      "name": "lord voldemort",
      "entity_type": "organization",
      "singular": true,
      "description": "Lord Voldemort is mentioned as the target of Harry and Peter, and it is implied that he has a strong following or 'allies'."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as someone who is being targeted by Lord Voldemort."
    }
  ],
  "relationships": [
    {
      "entity_1": "peter",
      "entity_2": "harry",
      "relationship_type": "at_same_location",
      "description": "Peter and Harry are at the same location, Hogwarts. This is mentioned in the text as 'I realized he was at Hogwarts with Harry'."
    },
    {
      "entity_1": "peter",
      "entity_2": "lord voldemort",
      "relationship_type": "target_of",
      "description": "Peter and Lord Voldemort have a relationship where Peter is being targeted by Voldemort. This is mentioned in the text as 'if one hint reached his ears that the Dark Side was gathering strength again'."
    },
    {
      "entity_1": "harry",
      "entity_2": "lord voldemort",
      "relationship_type": "target_of",
      "description": "Harry and Lord Voldemort have a relationship where Harry is being targeted by Voldemort. This is mentioned in the text as 'If he gave them Harry, who'd dare say he’d betrayed Lord Voldemort?'"
    },
    {
      "entity_1": "pettigrew",
      "entity_2": "black",
      "relationship_type": "stares_at",
      "description": "Pettigrew and Black have a relationship where Pettigrew is staring at Black as though hypnotized. This is mentioned in the text as 'Pettigrew was shaking his head, mouthing noiselessly, but staring all the while at Black as though hypnotized'."
    }
  ]
}