{
  "entities": [
    {
      "name": "walls",
      "entity_type": "location",
      "singular": true,
      "description": "The walls are mentioned as a part of the scene where hundreds of squashy purple sleeping bags cover the floor. (\"walls; another wave, and the ﬂoor was covered with hundreds of squashy purple sleeping bags.\")"
    },
    {
      "name": "Professor Dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Dumbledore is mentioned as a person who said \"Sleep well\" before closing the door behind him. (\"‘Sleep well,’ said Professor Dumbledore, closing the door behind him.\")"
    },
    {
      "name": "Gryﬀindors",
      "entity_type": "house",
      "singular": false,
      "description": "The Gryﬀindors are mentioned as a group of students who were telling the rest of the school what had just happened. (\"The hall immediately began to buzz excitedly; the Gryﬀindors were telling the rest of the school what had just\")"
    },
    {
      "name": "sleeping bags",
      "entity_type": "object",
      "singular": false,
      "description": "Hundreds of squashy purple sleeping bags are mentioned as covering the floor. (\"the ﬂoor was covered with hundreds of squashy purple sleeping bags.\")"
    },
    {
      "name": "door",
      "entity_type": "location",
      "singular": true,
      "description": "The door is mentioned as being closed behind Professor Dumbledore. (\"‘Sleep well,’ said Professor Dumbledore, closing the door behind him.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "Professor Dumbledore",
      "entity_2": "door",
      "relationship_type": "closed",
      "description": "Professor Dumbledore closed the door behind him. (\"‘Sleep well,’ said Professor Dumbledore, closing the door behind him.\")"
    },
    {
      "entity_1": "Gryﬀindors",
      "entity_2": "school",
      "relationship_type": "informing",
      "description": "The Gryﬀindors were telling the rest of the school what had just happened. (\"The hall immediately began to buzz excitedly; the Gryﬀindors were telling the rest of the school what had just\")"
    }
  ]
}