{
  "entities": [
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is mentioned as one of the students who accompanied Professor to the castle. He is described as being led up the steps into the castle by Professor."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is mentioned as one of the students who accompanied Professor to the castle. He is described as being led up the steps into the castle by Professor."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as one of the students who joined the crowd swarming up the steps with Ron and Harry. She prodded Ron in the back to make him hurry."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as one of the students who joined the crowd swarming up the steps with Hermione and Harry."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as one of the students who joined the crowd swarming up the steps with Ron and Hermione. He followed the crowd toward the Great Hall."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "teacher",
      "singular": true,
      "description": "Professor McGonagall is mentioned as a Transfiguration teacher and head of Gryffindor House. She called out to Harry and Hermione over the heads of the crowd."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "professor mcgonagall",
      "relationship_type": "called_by",
      "description": "Professor McGonagall called out to Harry over the heads of the crowd."
    },
    {
      "entity_1": "hermione",
      "entity_2": "professor mcgonagall",
      "relationship_type": "called_by",
      "description": "Professor McGonagall called out to Hermione over the heads of the crowd."
    }
  ]
}