{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron's leg has broken and his foot vanished from sight. He is unable to move without being in range of the tree's blows."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is bleeding due to a cut on her shoulder by the Willow tree. She is trying to get help for Ron and Harry."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is trying to find a way through the branches of the tree to reach Ron, who has been injured by the tree. He is also trying to protect Hermione from the tree's blows."
    },
    {
      "name": "willow",
      "entity_type": "tree",
      "singular": true,
      "description": "The Willow tree is attacking Harry, Ron, and Hermione with its branches. It has cut Hermione across her shoulder."
    },
    {
      "name": "crookshanks",
      "entity_type": "cat",
      "singular": true,
      "description": "Crookshanks is a cat who helps Harry by slithering between the branches of the tree and placing his front paws on a knot on the trunk."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "helped_by",
      "description": "Harry is trying to help Ron, who has been injured by the tree. Harry is trying to find a way through the branches of the tree to reach Ron."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "helped_by",
      "description": "Harry is also trying to help Hermione, who is bleeding due to a cut on her shoulder by the Willow tree."
    },
    {
      "entity_1": "crookshanks",
      "entity_2": "harry",
      "relationship_type": "assisted",
      "description": "Crookshanks helps Harry by slithering between the branches of the tree and placing his front paws on a knot on the trunk."
    }
  ]
}