{
  "entities": [
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is mentioned as the one who is speaking bitterly about not finding someone, and he is also referred to by his title 'Minerva' by Madam Rosmerta. (\"Alas, if only we had,\" said Fudge bitterly.)"
    },
    {
      "name": "peter pettigrew",
      "entity_type": "person",
      "singular": true,
      "description": "Pettigrew is described as 'little Peter Pettigrew' and is mentioned as the one who found someone. He is also referred to as 'that fat little boy' by Madam Rosmerta. (It was not we who found him. It was little Peter Pettigrew — another of the Potters’ friends.)"
    },
    {
      "name": "black",
      "entity_type": "person",
      "singular": true,
      "description": "Black is mentioned as the Secret-Keeper and is referred to by Fudge as 'he'. (knowing that Black had been the Potters’ Secret-Keeper, he went after Black himself.)"
    },
    {
      "name": "madam rosmerta",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Rosmerta is mentioned as the one who asks about Pettigrew and refers to Fudge by his title 'Minerva'. (‘Pettigrew … that fat little boy who was always tagging around after them at Hogwarts?’ said Madam Rosmerta.)"
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as the one who hero-worshipped Black and Potter. (‘Hero-worshipped Black and Potter,’ said Professor McGonagall.)"
    },
    {
      "name": "potters",
      "entity_type": "family",
      "singular": false,
      "description": "The Potters are mentioned as friends of Pettigrew and as the ones who had a Secret-Keeper. (It was not we who found him. It was little Peter Pettigrew — another of the Potters’ friends.)"
    },
    {
      "name": "lily",
      "entity_type": "person",
      "singular": true,
      "description": "Lily is mentioned as someone that Pettigrew was sobbing about. (‘Lily and James, Sirus! How could you?’ And then he went for his wand.)"
    },
    {
      "name": "james",
      "entity_type": "person",
      "singular": true,
      "description": "James is mentioned as someone that Pettigrew was sobbing about. (‘Lily and James, Sirus! How could you?’ And then he went for his wand.)"
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned as someone that Pettigrew was sobbing about. (‘Lily and James, Sirus! How could you?’ And then he went for his wand.)"
    }
  ],
  "relationships": [
    {
      "entity_1": "peter pettigrew",
      "entity_2": "black",
      "relationship_type": "targeted",
      "description": "Pettigrew targeted Black after finding out that he was the Secret-Keeper. (knowing that Black had been the Potters’ Secret-Keeper, he went after Black himself.)"
    },
    {
      "entity_1": "black",
      "entity_2": "peter pettigrew",
      "relationship_type": "defeated",
      "description": "Black defeated Pettigrew in a duel. (Well, of course, Black was quicker. Blew Pettigrew to smithereens.)"
    }
  ]
}