{
  "entities": [
    {
      "name": "willow",
      "entity_type": "tree",
      "singular": true,
      "description": "The willow tree is being observed by Harry and Hermione. It is described as 'the Willow' which suggests it has a distinct identity."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character in this scene. He is described as looking up at the sky and expressing frustration at not being able to grab the cloak."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is a person who is present in the scene. He is described as seizing a broken branch from the ground and prod the knot on the trunk of the willow tree."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who is present in the scene. She is described as trying to stop Harry from grabbing the cloak and warning him that they mustn't be seen."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is a person who is mentioned in the scene. He is described as someone who would not be able to get the cloak if Harry grabbed it."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a person who is present in the scene. He is described as making his way up to the castle, singing at the top of his voice and weaving slightly as he walked."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "willow",
      "relationship_type": "observes",
      "description": "Harry looks up at the sky and observes the willow tree, which is being obscured by clouds."
    },
    {
      "entity_1": "lupin",
      "entity_2": "willow",
      "relationship_type": "interacts_with",
      "description": "Lupin seizes a broken branch from the ground and prod the knot on the trunk of the willow tree, causing it to stop fighting."
    },
    {
      "entity_1": "harry",
      "entity_2": "cloak",
      "relationship_type": "wants_to_grab",
      "description": "Harry wants to grab the cloak, which is lying there, but Hermione stops him saying they mustn't be seen."
    },
    {
      "entity_1": "hermione",
      "entity_2": "harry",
      "relationship_type": "stops",
      "description": "Hermione tries to stop Harry from grabbing the cloak by seizing the back of his robes."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "castle",
      "relationship_type": "approaches",
      "description": "Hagrid is making his way up to the castle, singing at the top of his voice and weaving slightly as he walked."
    }
  ]
}