{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as a student who received five points from Gryﬀindor and was scolded by Ron for not lying about Neville doing the potion. She is also seen hurrying up the stairs with her bag."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as a student who scolded Hermione for not lying about Neville doing the potion and looked around for her when she was missing."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is mentioned as someone who did the potion by himself, according to Ron."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a student who turned around with Ron when they were looking for Hermione and saw her hurrying up the stairs."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as a student who passed Harry and his friends on the stairs and smirked at Harry before disappearing."
    },
    {
      "name": "crabbe",
      "entity_type": "person",
      "singular": true,
      "description": "Crabbe is mentioned as one of Malfoy's companions walking between him and Goyle."
    },
    {
      "name": "goyle",
      "entity_type": "person",
      "singular": true,
      "description": "Goyle is mentioned as one of Malfoy's companions walking between him and Crabbe."
    },
    {
      "name": "gryﬀindor",
      "entity_type": "house",
      "singular": true,
      "description": "Gryﬀindor is mentioned as the house that gave Hermione five points for not lying about Neville doing the potion."
    },
    {
      "name": "great hall",
      "entity_type": "location",
      "singular": true,
      "description": "The Great Hall is mentioned as a location where the rest of the class was heading for lunch."
    },
    {
      "name": "lunch",
      "entity_type": "event",
      "singular": true,
      "description": "Lunch is mentioned as an event that the students were heading to in the Great Hall."
    },
    {
      "name": "potion",
      "entity_type": "object",
      "singular": true,
      "description": "The potion is mentioned as something that Neville did by himself and Hermione was accused of lying about."
    },
    {
      "name": "stairs",
      "entity_type": "location",
      "singular": false,
      "description": "The stairs are mentioned as a location where Harry, Ron, and Hermione were standing when they looked for Hermione."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "scolded",
      "description": "Ron scolded Hermione for not lying about Neville doing the potion."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "saw",
      "description": "Harry saw Hermione hurrying up the stairs with her bag."
    },
    {
      "entity_1": "ron",
      "entity_2": "hermione",
      "relationship_type": "looked_for",
      "description": "Ron looked around for Hermione when she was missing."
    },
    {
      "entity_1": "harry",
      "entity_2": "malfoy",
      "relationship_type": "saw",
      "description": "Harry saw Malfoy passing them on the stairs and smirking at him before disappearing."
    }
  ]
}