{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is described as the one who roared and seized a stone. He is also mentioned as saying 'See?' and chucking the stone down again."
    },
    {
      "name": "crookshanks",
      "entity_type": "animal",
      "singular": true,
      "description": "Crookshanks is described as having vanished with one swish of his long ginger tail. He is also mentioned as being let wander about by Scabbers and the narrator's assumption that he might be eating birds."
    },
    {
      "name": "scabbers",
      "entity_type": "animal",
      "singular": true,
      "description": "Scabbers is described as letting Crookshanks wander about wherever he wants. The narrator also assumes that Scabbers is being washed down with a couple of birds by Scabbers."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as taking a deep breath and feeling relief seep through him after thinking those eyes belonged to the Grim. He also didn't say anything to Ron nor did he look left or right until they had reached the well-lit entrance hall."
    },
    {
      "name": "grim",
      "entity_type": "animal",
      "singular": true,
      "description": "The Grim is described as being what Harry thought those eyes belonged to. It is also mentioned that Harry was sure for a moment that those eyes had belonged to the Grim."
    },
    {
      "name": "firebolt",
      "entity_type": "object",
      "singular": true,
      "description": "Firebolt is described as deserving a sort of guard of honor by the rest of the boys in Harry's dormitory."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "crookshanks",
      "relationship_type": "chased_by",
      "description": "Ron chased Crookshanks with a stone, but before he could do anything else, Crookshanks had vanished."
    },
    {
      "entity_1": "scabbers",
      "entity_2": "crookshanks",
      "relationship_type": "let_wander",
      "description": "Scabbers is letting Crookshanks wander about wherever he wants — probably washing down Scabbers with a couple of birds now."
    },
    {
      "entity_1": "harry",
      "entity_2": "grim",
      "relationship_type": "thought_belongs_to",
      "description": "Harry thought those eyes belonged to the Grim for a moment."
    }
  ]
}