{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story, mentioned as setting off after Crookshanks."
    },
    {
      "name": "crookshanks",
      "entity_type": "animal",
      "singular": true,
      "description": "A cat that Harry is following through a tunnel. Mentioned as having its tail bobbing in and out of view."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "A character who is following Harry through the tunnel, asking questions about where they are going."
    },
    {
      "name": "fred and george",
      "entity_type": "people",
      "singular": false,
      "description": "Two characters mentioned as having said that no one has ever gotten into the tunnel before. They are also associated with the Marauder's Map."
    },
    {
      "name": "marauder's map",
      "entity_type": "object",
      "singular": true,
      "description": "A magical map that shows the location of people and objects in the school, mentioned as showing the tunnel but not its exit point."
    },
    {
      "name": "hogsmeade",
      "entity_type": "location",
      "singular": true,
      "description": "A village near Hogwarts, mentioned as a possible destination for the tunnel."
    },
    {
      "name": "honeydukes",
      "entity_type": "location",
      "singular": true,
      "description": "A shop in Hogwarts, mentioned as being similar in length to the current tunnel."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's friend, mentioned as being in danger from an enormous dog."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "crookshanks",
      "relationship_type": "following",
      "description": "Harry is following Crookshanks through the tunnel, as mentioned in the text: 'He and Hermione paused, gasping for breath, edging forward. Both raised their wands to see what lay beyond.'"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "following",
      "description": "Harry and Hermione are following each other through the tunnel, as mentioned in the text: 'He and Hermione paused, gasping for breath, edging forward.'"
    },
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "concerned about",
      "description": "Harry is concerned about Ron's safety, as mentioned in the text: 'All Harry could think of was Ron and what the enormous dog might be doing to him.'"
    }
  ]
}