{
  "entities": [
    {
      "name": "seamus finnigan",
      "entity_type": "person",
      "singular": true,
      "description": "Seamus Finnigan is a student in Professor Trelawney's class. He is tilting his head from side to side, trying to see if Harry is going to die or not."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character in the story. Professor Trelawney says that he might be dying, which causes everyone to avoid looking at him."
    },
    {
      "name": "professor trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Trelawney is the teacher in the story. She has a misty voice and seems to be able to see into the future."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is another student in Professor Trelawney's class. He is being scolded by Professor Trelawney for being late next time."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a friend of Harry's and also a student in Professor Trelawney's class. He is avoiding looking at Harry because he thinks Harry might be dying."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor trelawney",
      "entity_2": "harry",
      "relationship_type": "sees_into_future",
      "description": "Professor Trelawney says that she perceives very little aura around Harry, implying that she can see into the future and knows something about Harry's fate."
    },
    {
      "entity_1": "professor trelawney",
      "entity_2": "neville",
      "relationship_type": "scolds",
      "description": "Professor Trelawney scolds Neville for being late next time, showing that she is in charge and has authority over the students."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "avoids",
      "description": "Ron avoids looking at Harry because he thinks Harry might be dying, showing that Ron is trying to avoid getting involved in whatever is happening with Harry."
    }
  ]
}