{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as moving a great stack of parchment off a chair and working hard on her essays. She is also shown to be tired and looking through a rune translation."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as looking around at the cluttered table and asking Hermione how she is getting through all the work. He is also shown to be watching her lift books and picking up a complicated-looking number chart."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is mentioned as looking almost as tired as Hermione."
    },
    {
      "name": "arithmancy",
      "entity_type": "subject",
      "singular": true,
      "description": "Arithmancy is described as a subject that Hermione loves and finds wonderful. It is also shown to be a complicated-looking number chart."
    },
    {
      "name": "muggle studies",
      "entity_type": "subject",
      "singular": true,
      "description": "Muggle Studies is mentioned as a subject with an essay titled 'Explain Why Muggles Need Electricity'."
    },
    {
      "name": "rune translation",
      "entity_type": "assignment",
      "singular": true,
      "description": "Rune translation is described as something Hermione is working on and looking through."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "asks_question",
      "description": "Harry asks Hermione how she is getting through all the work. This is shown in the text as 'How are you getting through all this stuﬀ?' Harry asked her.'"
    },
    {
      "entity_1": "harry",
      "entity_2": "arithmancy",
      "relationship_type": "expresses_doubt",
      "description": "Harry expresses doubt about Arithmancy, saying it 'looks terrible'. This is shown in the text as 'Arithmancy looks terrible,' said Harry, picking up a very complicated-looking number chart.'"
    },
    {
      "entity_1": "hermione",
      "entity_2": "arithmancy",
      "relationship_type": "expresses_love",
      "description": "Hermione expresses love for Arithmancy, saying it is her favorite subject and 'wonderful'. This is shown in the text as 'Oh no, it’s wonderful!' said Hermione earnestly. 'It’s —'"
    },
    {
      "entity_1": "hermione",
      "entity_2": "rune translation",
      "relationship_type": "works_on",
      "description": "Hermione works on rune translation, looking through it and searching for her rune dictionary. This is shown in the text as 'Close-up, Harry saw that she looked almost as tired as Lupin. “Why don’t you just drop a couple of subjects?” Harry asked, watching her lifting books as she searched for her rune dictionary.'"
    }
  ]
}