{
  "entities": [
    {
      "name": "broomsticks",
      "entity_type": "location",
      "singular": true,
      "description": "Broomsticks had opened again. This indicates that broomsticks are now operational."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry looked over the rim of his tankard and choked. Harry is a person who is reacting to something."
    },
    {
      "name": "professors mcgonagall and flitwick",
      "entity_type": "people",
      "singular": false,
      "description": "Professors McGonagall and Flitwick had just entered the pub with a flurry of snowflakes. They are professors who have entered the pub."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid, who was deep in conversation with a portly man in a lime-green bowler hat and a pinstriped cloak — Cornelius Fudge, Minister of Magic. Hagrid is a person who is having a conversation."
    },
    {
      "name": "cornelius fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Cornelius Fudge, Minister of Magic. He is the Minister of Magic and is in conversation with Hagrid."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron and Hermione had both placed hands on the top of Harry’s head and forced him off his stool and under the table. Ron is a person who is helping to move Harry."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione whispered, “Mobiliarbus!” The Christmas tree beside their table rose a few inches off the ground, drifted sideways, and landed with a soft thud. Hermione is a person who is whispering a spell."
    },
    {
      "name": "christmas tree",
      "entity_type": "object",
      "singular": true,
      "description": "The Christmas tree beside their table rose a few inches off the ground, drifted sideways, and landed with a soft thud. The Christmas tree is an object that is being affected by Hermione's spell."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "cornelius fudge",
      "relationship_type": "conversation",
      "description": "Hagrid, who was deep in conversation with a portly man in a lime-green bowler hat and a pinstriped cloak — Cornelius Fudge, Minister of Magic. Hagrid is having a conversation with Cornelius Fudge."
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "helping",
      "description": "Ron and Hermione had both placed hands on the top of Harry’s head and forced him off his stool and under the table. Ron is helping Harry to move."
    }
  ]
}