{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is described as the one who called out to Harry and took out her wand, indicating she is a key character in this scene. (\"Stand back! Hermione called to him...\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as the one who is being spoken to by Hermione and is helping Buckbeak, indicating he is a key character in this scene. (\"Stand back! Hermione called to him...\", \"Get on — there’s not much time\")"
    },
    {
      "name": "buckbeak",
      "entity_type": "hippogriﬀ",
      "singular": true,
      "description": "Buckbeak is described as a hippogriﬀ that Harry and Hermione are trying to escape on, indicating it is an important entity in this scene. (\"Get on — there’s not much time\", \"Okay, Buckbeak, up!\")"
    },
    {
      "name": "black",
      "entity_type": "person",
      "singular": true,
      "description": "Black is described as a person who is being helped by Harry and Hermione to escape, indicating he is an important entity in this scene. (\"How — how — ? said Black weakly\")"
    },
    {
      "name": "macnair",
      "entity_type": "person",
      "singular": true,
      "description": "Macnair is described as a person who has gone to get the dementors, indicating he is an important entity in this scene. (\"the dementors are coming — Macnair’s gone to get them\")"
    },
    {
      "name": "dementors",
      "entity_type": "dementor",
      "singular": true,
      "description": "Dementors are described as the entities that Black and Harry are trying to escape from, indicating they are an important entity in this scene. (\"the dementors are coming\")"
    },
    {
      "name": "west tower",
      "entity_type": "location",
      "singular": true,
      "description": "The West Tower is described as a location that Buckbeak and the others fly over, indicating it is an important entity in this scene. (\"high as the top of the West Tower\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "buckbeak",
      "relationship_type": "helps",
      "description": "Harry is helping Buckbeak by gripping him firmly on either side of his neck to hold him steady. (\"Get on — there’s not much time\", \"gripping Buckbeak ﬁrmly on either side of his sleek neck\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "helps",
      "description": "Harry is helping Hermione by shaking the rope to help Buckbeak take off. (\"Okay, Buckbeak, up!\")"
    },
    {
      "entity_1": "black",
      "entity_2": "buckbeak",
      "relationship_type": "rides",
      "description": "Black is riding on Buckbeak behind Hermione. (\"In seconds, he had managed to ﬂing one leg over Buckbeak’s back and pull himself onto the hippogriﬀ\")"
    },
    {
      "entity_1": "buckbeak",
      "entity_2": "west tower",
      "relationship_type": "lands_on",
      "description": "Buckbeak lands on the battlements of the West Tower. (\"Buckbeak landed with a clatter on the battlements\")"
    }
  ]
}