{
  "entities": [
    {
      "name": "seamus finnigan",
      "entity_type": "person",
      "singular": true,
      "description": "Seamus Finnigan is mentioned as the one who told Harry about Sirius Black's sighting. He said 'Hey, Harry,' and then shared the news that Daily Prophet reported Sirius Black's been sighted."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who was told by Seamus about Sirius Black's sighting. He asked 'Where?' and then looked excited when he heard it wasn't too far from here."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as the one who quickly asked Harry 'Where?' after Seamus told them about Sirius Black's sighting."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as the one who looked up and listened closely when Seamus told them about Sirius Black's sighting. He then leaned across the table to ask Harry if he was thinking of trying to catch Black single-handed."
    },
    {
      "name": "sirius black",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius Black is mentioned as the one who has been sighted by a Muggle. Seamus told Harry and Ron that Daily Prophet reported Sirius Black's been sighted."
    },
    {
      "name": "daily prophet",
      "entity_type": "newspaper",
      "singular": true,
      "description": "Daily Prophet is mentioned as the newspaper that reported Sirius Black's sighting. Seamus said 'they reckon Sirius Black’s been sighted' and then told them it was in the Daily Prophet."
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "Ministry of Magic is mentioned as the organization that received a call from a Muggle who saw Sirius Black. Seamus said 'By the time the Ministry of Magic got there, he was gone'."
    },
    {
      "name": "muggles",
      "entity_type": "group",
      "singular": false,
      "description": "Muggles are mentioned as a group that thinks Sirius Black is just an ordinary criminal. Seamus said 'The Muggles think he’s just an ordinary criminal, don’t they?'"
    },
    {
      "name": "brass scales",
      "entity_type": "object",
      "singular": true,
      "description": "Brass scales are mentioned as something that Harry has and Seamus borrowed from him. Seamus said 'have you heard? Daily Prophet this morning — they reckon Sirius Black’s been sighted' while leaning over to borrow Harry's brass scales."
    }
  ],
  "relationships": [
    {
      "entity_1": "seamus finnigan",
      "entity_2": "harry",
      "relationship_type": "told",
      "description": "Seamus told Harry about Sirius Black's sighting. He said 'Hey, Harry,' and then shared the news that Daily Prophet reported Sirius Black's been sighted."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "harry",
      "relationship_type": "asked",
      "description": "Ron quickly asked Harry 'Where?' after Seamus told them about Sirius Black's sighting."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "harry",
      "relationship_type": "accused",
      "description": "Malfoy accused Harry of trying to catch Sirius Black single-handed. He leaned across the table and said 'Thinking of trying to catch Black single-handed, Potter?'"
    },
    {
      "entity_1": "malfoy",
      "entity_2": "harry",
      "relationship_type": "watched",
      "description": "Malfoy watched Harry closely after Seamus told them about Sirius Black's sighting. Ron repeated 'Not too far from here' and then saw Malfoy watching him."
    }
  ]
}