{
  "entities": [
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is mentioned as a person who has met some of the dementors and is uncomfortable with their presence."
    },
    {
      "name": "madam rosmerta",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Rosmerta is mentioned as a business owner whose customers have been scared away by the dementors."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as someone who has refused to let the dementors inside the castle grounds."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as a teacher who is concerned about teaching with the dementors present."
    },
    {
      "name": "professor flitwick",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Flitwick is mentioned as a tiny professor who agrees with Professor McGonagall."
    },
    {
      "name": "black",
      "entity_type": "person",
      "singular": true,
      "description": "Black is mentioned as someone whose capabilities are being referred to by Fudge."
    }
  ],
  "relationships": [
    {
      "entity_1": "fudge",
      "entity_2": "dumbledore",
      "relationship_type": "disagreement",
      "description": "Fudge and Dumbledore have a disagreement about the dementors, with Fudge thinking they are necessary but unfortunate, while Dumbledore has refused to let them inside the castle grounds."
    },
    {
      "entity_1": "madam rosmerta",
      "entity_2": "fudge",
      "relationship_type": "agreement",
      "description": "Madam Rosmerta and Fudge agree that the dementors are a problem for business, but Madam Rosmerta still has trouble believing it."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "fudge",
      "relationship_type": "disagreement",
      "description": "Professor McGonagall and Fudge disagree about the dementors, with Professor McGonagall thinking they are a problem for teaching."
    },
    {
      "entity_1": "professor flitwick",
      "entity_2": "madam rosmerta",
      "relationship_type": "agreement",
      "description": "Professor Flitwick and Madam Rosmerta agree that the dementors are a problem, as evidenced by Professor Flitwick's 'hear, hear'."
    },
    {
      "entity_1": "fudge",
      "entity_2": "black",
      "relationship_type": "reference",
      "description": "Fudge refers to Black's capabilities as something worse than what the dementors are protecting against."
    }
  ]
}