{
  "entities": [
    {
      "name": "dudders",
      "entity_type": "person",
      "singular": true,
      "description": "Dudders is being referred to as a proper-sized man, implying that he has a certain stature or physical presence."
    },
    {
      "name": "vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Vernon is having a spot more brandy, indicating that he is an adult and able to consume alcohol."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry feels his stomach clench when his aunt points at him, suggesting that he is uncomfortable or anxious in her presence."
    },
    {
      "name": "colonel fubster",
      "entity_type": "person",
      "singular": true,
      "description": "Colonel Fubster is mentioned as having drowned a dog last year, implying that he has some sort of authority or responsibility."
    },
    {
      "name": "petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Petunia's bony hand is being patted by her aunt, suggesting that she may be frail or elderly."
    },
    {
      "name": "aunt marge",
      "entity_type": "person",
      "singular": true,
      "description": "Aunt Marge's voice is mentioned as continuing to speak, indicating that she is the dominant figure in the conversation."
    }
  ],
  "relationships": [
    {
      "entity_1": "dudders",
      "entity_2": "vernon",
      "relationship_type": "has_relationship_with",
      "description": "Dudders and Vernon are referred to as being together, with Dudders being told to be like his father."
    },
    {
      "entity_1": "harry",
      "entity_2": "aunt marge",
      "relationship_type": "is_being_referred_to_by",
      "description": "Aunt Marge is pointing at Harry and making a comment about him, indicating that she has some sort of relationship or connection with him."
    },
    {
      "entity_1": "petunia",
      "entity_2": "aunt marge",
      "relationship_type": "is_being_talked_about_by",
      "description": "Aunt Marge is talking about Petunia's sister, suggesting that she has some sort of knowledge or connection with the family."
    },
    {
      "entity_1": "colonel fubster",
      "entity_2": "dog",
      "relationship_type": "has_drowned",
      "description": "Colonel Fubster is mentioned as having drowned a dog last year, indicating that he has some sort of responsibility or authority over animals."
    }
  ]
}