{
  "entities": [
    {
      "name": "professor trelawney",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Trelawney is introduced as a familiar and misty voice, making her usual dramatic entrance out of the shadows. She is described as sitting with her back to the fire and gazing around."
    },
    {
      "name": "parvati",
      "entity_type": "person",
      "singular": true,
      "description": "Parvati is mentioned along with Lavender, quivering with excitement, their faces lit by the milky glow of their crystal ball."
    },
    {
      "name": "lavender",
      "entity_type": "person",
      "singular": true,
      "description": "Lavender is mentioned along with Parvati, quivering with excitement, their faces lit by the milky glow of their crystal ball."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as snorting in response to Professor Trelawney's statement about the fates informing her that the examination will concern the Orb."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned along with Ron, choking back laughs in response to Hermione's comment."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned along with Harry, choking back laughs in response to Hermione's comment."
    },
    {
      "name": "crystal ball",
      "entity_type": "object",
      "singular": true,
      "description": "The crystal ball is introduced as a tool used by Professor Trelawney for divination and is described as having a milky glow."
    },
    {
      "name": "orb",
      "entity_type": "object",
      "singular": true,
      "description": "The Orb is mentioned as the subject of the upcoming examination, which will concern it."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor trelawney",
      "entity_2": "crystal ball",
      "relationship_type": "uses",
      "description": "Professor Trelawney uses the crystal ball for divination, as described in the text."
    },
    {
      "entity_1": "professor trelawney",
      "entity_2": "orb",
      "relationship_type": "concerned with",
      "description": "The examination will concern the Orb, and Professor Trelawney is anxious to give students sufficient practice using the crystal ball."
    },
    {
      "entity_1": "hermione",
      "entity_2": "professor trelawney",
      "relationship_type": "responds to",
      "description": "Hermione responds to Professor Trelawney's statement about the fates informing her that the examination will concern the Orb."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "agrees with",
      "description": "Harry agrees with Hermione's comment about Professor Trelawney's statement, as described in the text."
    }
  ]
}