{
  "entities": [
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is a person who is waving his crumpet impatiently and trying to calm down Harry. He says that they don't send people to Azkaban for blowing up their aunts."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who has had past dealings with the Ministry of Magic and is being accused of using magic in his uncle's house."
    },
    {
      "name": "azkaban",
      "entity_type": "place",
      "singular": true,
      "description": "Azkaban is a place where people are sent for punishment. Fudge mentions that they don't send people there just for blowing up their aunts."
    },
    {
      "name": "ministry of magic",
      "entity_type": "organization",
      "singular": true,
      "description": "The Ministry of Magic is an organization that has given Harry official warnings in the past and threatened to expel him from Hogwarts if he uses magic again."
    },
    {
      "name": "hogwarts",
      "entity_type": "school",
      "singular": true,
      "description": "Hogwarts is a school where Harry is a student. The Ministry of Magic has threatened to expel him if he uses magic there again."
    },
    {
      "name": "tom",
      "entity_type": "person",
      "singular": true,
      "description": "Tom is a person who Fudge goes to see about getting a room for Harry."
    }
  ],
  "relationships": [
    {
      "entity_1": "fudge",
      "entity_2": "harry",
      "relationship_type": "accusing",
      "description": "Fudge accuses Harry of using magic in his uncle's house."
    },
    {
      "entity_1": "ministry of magic",
      "entity_2": "harry",
      "relationship_type": "punishing",
      "description": "The Ministry of Magic has given Harry official warnings and threatened to expel him from Hogwarts if he uses magic again."
    },
    {
      "entity_1": "fudge",
      "entity_2": "tom",
      "relationship_type": "asking_for_help",
      "description": "Fudge goes to see Tom about getting a room for Harry."
    }
  ]
}