{
  "entities": [
    {
      "name": "snitch",
      "entity_type": "object",
      "singular": true,
      "description": "The Snitch is a magical object that Harry needs to catch quickly due to the dangerous weather conditions. (\"Harry needed to get the Snitch quickly —\")"
    },
    {
      "name": "bludger",
      "entity_type": "object",
      "singular": true,
      "description": "A Bludger is an object that Harry needs to avoid while flying on his broomstick. (\"avoiding a Bludger\")"
    },
    {
      "name": "diggory",
      "entity_type": "person",
      "singular": true,
      "description": "Diggory is a person who is mentioned as being in the opposite direction of Harry. (\"ducking beneath Diggory\")"
    },
    {
      "name": "nimbus",
      "entity_type": "broomstick",
      "singular": true,
      "description": "Nimbus is Harry's broomstick that he is flying on. (\"Harry’s numb hands slipped on the broom handle and his Nimbus dropped a few feet.\")"
    },
    {
      "name": "thunder",
      "entity_type": "weather_condition",
      "singular": true,
      "description": "Thunder is a weather condition that is mentioned as occurring during Harry's flight. (\"There was another clap of thunder\")"
    },
    {
      "name": "lightning",
      "entity_type": "weather_condition",
      "singular": true,
      "description": "Lightning is a weather condition that is mentioned as occurring during Harry's flight. (\"This was getting more and more dangerous. Harry needed to get the Snitch quickly — He turned, intending to head back toward the middle of the field, but at that moment, another flash of lightning illuminated the stands\")"
    },
    {
      "name": "shaggy black dog",
      "entity_type": "animal",
      "singular": true,
      "description": "A shaggy black dog is an animal that Harry sees in the stands. (\"Harry saw something that distracted him completely — the silhouette of an enormous shaggy black dog\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "snitch",
      "relationship_type": "target",
      "description": "Harry is targeting the Snitch. (\"He turned, intending to head back toward the middle of the field, but at that moment, another flash of lightning illuminated the stands, and Harry saw something that distracted him completely — the silhouette of an enormous shaggy black dog, clearly imprinted against the sky, motionless in the topmost, empty row of seats.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "bludger",
      "relationship_type": "avoidance",
      "description": "Harry is avoiding a Bludger. (\"ducking beneath Diggory, who was streaking in the opposite direction. … There was another clap of thunder, followed immediately by forked lightning.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "nimbus",
      "relationship_type": "possession",
      "description": "Harry possesses a Nimbus broomstick. (\"Harry’s numb hands slipped on the broom handle and his Nimbus dropped a few feet.\")"
    }
  ]
}