{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as a child who was rescued from his parents' house after they were killed by You-Know-Who. He has a great slash across his forehead."
    },
    {
      "name": "lily",
      "entity_type": "person",
      "singular": true,
      "description": "Lily is described as Harry's mother who was killed by You-Know-Who along with her husband James."
    },
    {
      "name": "james",
      "entity_type": "person",
      "singular": true,
      "description": "James is described as Harry's father who was killed by You-Know-Who along with his wife Lily."
    },
    {
      "name": "sirius black",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius Black is described as a friend of Harry's parents and the Secret-Keeper. He arrives on a motorbike and tries to take Harry from Hagrid."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is described as a gamekeeper who rescues Harry from his parents' house and refuses to give him to Sirius Black."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is described as a teacher who tries to calm down Hagrid's loud voice."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is described as the headmaster who gives orders to Hagrid about what to do with Harry."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "sirius black",
      "relationship_type": "conflict",
      "description": "Hagrid and Sirius Black have a conflict when Hagrid refuses to give Harry to Sirius. Sirius tries to take Harry from Hagrid, but Hagrid stands firm."
    },
    {
      "entity_1": "hagrid",
      "entity_2": "dumbledore",
      "relationship_type": "obedience",
      "description": "Hagrid is obedient to Dumbledore's orders and refuses to give Harry to Sirius Black as per Dumbledore's instructions."
    }
  ]
}