{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is introduced as a character who turns an hourglass over three times, causing a time-travel effect. She is described as being next to Harry in the entrance hall and dragging him into a broom closet."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as a character who experiences a sensation of flying backward and has his ears pounding. He is described as being next to Hermione in the entrance hall and being dragged into a broom closet by her."
    },
    {
      "name": "hourglass",
      "entity_type": "object",
      "singular": true,
      "description": "The hourglass is introduced as an object that Hermione turns over three times, causing a time-travel effect. It is described as cutting into Harry's neck."
    },
    {
      "name": "broom closet",
      "entity_type": "location",
      "singular": true,
      "description": "The broom closet is introduced as a location where Hermione and Harry take refuge after being dragged in by her. It is described as containing buckets and mops."
    },
    {
      "name": "entrance hall",
      "entity_type": "location",
      "singular": true,
      "description": "The entrance hall is introduced as a location where Hermione and Harry are standing after the time-travel effect. It is described as being deserted and having golden sunlight falling across the floor from the open front doors."
    },
    {
      "name": "front doors",
      "entity_type": "location",
      "singular": true,
      "description": "The front doors are introduced as a location that is open, allowing golden sunlight to fall across the entrance hall. They are described as being part of the entrance hall."
    }
  ],
  "relationships": [
    {
      "entity_1": "hermione",
      "entity_2": "hourglass",
      "relationship_type": "used",
      "description": "Hermione uses the hourglass to turn it over three times, causing a time-travel effect. This is described as: 'Hermione turned the hourglass over three times.'"
    },
    {
      "entity_1": "hermione",
      "entity_2": "harry",
      "relationship_type": "dragged",
      "description": "Hermione drags Harry into the broom closet after turning the hourglass. This is described as: 'In here!' Hermione seized Harry's arm and dragged him across the hall to the door of a broom closet; she opened it, pushed him inside among the buckets and mops, then slammed the door behind them.'"
    },
    {
      "entity_1": "harry",
      "entity_2": "entrance hall",
      "relationship_type": "present_in",
      "description": "Harry is present in the entrance hall after the time-travel effect. This is described as: 'He was standing next to Hermione in the deserted entrance hall and a stream of golden sunlight was falling across the paved floor from the open front doors.'"
    },
    {
      "entity_1": "hermione",
      "entity_2": "entrance hall",
      "relationship_type": "present_in",
      "description": "Hermione is present in the entrance hall after the time-travel effect. This is described as: 'He was standing next to Hermione in the deserted entrance hall and a stream of golden sunlight was falling across the paved floor from the open front doors.'"
    },
    {
      "entity_1": "hermione",
      "entity_2": "broom closet",
      "relationship_type": "dragged_into",
      "description": "Hermione drags Harry into the broom closet after turning the hourglass. This is described as: 'In here!' Hermione seized Harry's arm and dragged him across the hall to the door of a broom closet; she opened it, pushed him inside among the buckets and mops, then slammed the door behind them.'"
    },
    {
      "entity_1": "harry",
      "entity_2": "broom closet",
      "relationship_type": "dragged_into",
      "description": "Harry is dragged into the broom closet by Hermione after turning the hourglass. This is described as: 'In here!' Hermione seized Harry's arm and dragged him across the hall to the door of a broom closet; she opened it, pushed him inside among the buckets and mops, then slammed the door behind them.'"
    }
  ]
}