{
  "entities": [
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is described as having a thin, sallow face and wearing an expression of loathing every time he sees Harry. He wanted the Defense Against the Dark Arts job."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as knowing Snape's expression well and being startled by it. He hated Snape but was also surprised by his reaction to not getting the job."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is introducing new appointments and announcing Professor Kettleburn's retirement and Hagrid's new teaching job."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Lupin received lukewarm applause for his work."
    },
    {
      "name": "kettleburn",
      "entity_type": "person",
      "singular": true,
      "description": "Kettleburn retired as the Care of Magical Creatures teacher to enjoy more time with his remaining limbs."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is taking on a new teaching job in addition to his gamekeeping duties. He was described as being ruby-red in the face."
    }
  ],
  "relationships": [
    {
      "entity_1": "snape",
      "entity_2": "harry",
      "relationship_type": "loathing",
      "description": "Snape has loathing for Harry, which is evident from his expression every time he sees him."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "kettleburn",
      "relationship_type": "retirement",
      "description": "Dumbledore announced Kettleburn's retirement as the Care of Magical Creatures teacher."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "hagrid",
      "relationship_type": "appointment",
      "description": "Dumbledore introduced Hagrid as the new Care of Magical Creatures teacher."
    },
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "hatred",
      "description": "Harry hated Snape, which is evident from his reaction to not getting the job."
    }
  ]
}