{
  "entities": [
    {
      "name": "uncle vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Uncle Vernon is mentioned as the one who is growling and giving orders to Harry. He is described as having a 'mean little eyes' and a 'great purple face'. (\"Firstly,\" growled Uncle Vernon, \"you'll keep a civil tongue in your head when you're talking to Marge.\")"
    },
    {
      "name": "marge",
      "entity_type": "person",
      "singular": true,
      "description": "Marge is mentioned as the one who is visiting Harry and his family. She is described as not knowing anything about Harry's abnormality. (\"Secondly,\" said Uncle Vernon, \"as Marge doesn't know anything about your abnormality...\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the one who is talking back to Uncle Vernon and refusing to behave. He is described as being white-faced and furious. (\"All right,\" said Harry bitterly, \"if she does when she's talking to me.\")"
    },
    {
      "name": "st brutus's secure center for incurably criminal boys",
      "entity_type": "organization",
      "singular": true,
      "description": "St. Brutus's Secure Center is mentioned as the place where Harry attends school. It is described as a place for 'Incurably Criminal Boys'. (\"And thirdly,\" said Uncle Vernon, \"we've told Marge you attend St. Brutus's Secure Center for Incurably Criminal Boys.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "uncle vernon",
      "entity_2": "marge",
      "relationship_type": "talking_to",
      "description": "Uncle Vernon is talking to Marge, as mentioned in the first sentence. (\"Firstly,\" growled Uncle Vernon, \"you'll keep a civil tongue in your head when you're talking to Marge.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "marge",
      "relationship_type": "talking_to",
      "description": "Harry is also talking to Marge, as mentioned in the second sentence. (\"All right,\" said Harry bitterly, \"if she does when she's talking to me.\")"
    },
    {
      "entity_1": "uncle vernon",
      "entity_2": "harry",
      "relationship_type": "ordering",
      "description": "Uncle Vernon is ordering Harry to behave and stick to the story about attending St. Brutus's Secure Center. (\"And thirdly,\" said Uncle Vernon, \"we've told Marge you attend St. Brutus's Secure Center for Incurably Criminal Boys.\")"
    },
    {
      "entity_1": "uncle vernon",
      "entity_2": "harry",
      "relationship_type": "threatening",
      "description": "Uncle Vernon is threatening Harry with trouble if he doesn't stick to the story about attending St. Brutus's Secure Center. (\"And you'll be sticking to that story, boy, or there'll be trouble,\" spat Uncle Vernon.)"
    }
  ]
}