{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is a person who roars and slaps the hippogriﬀ's hindquarters. (\"Go on, then!\" roared Hagrid)"
    },
    {
      "name": "hippogriff",
      "entity_type": "animal",
      "singular": true,
      "description": "The hippogriﬀ is a creature with twelve-foot wings that can fly. (Without warning, twelve-foot wings ﬂapped open on either side of Harry; he just had time to seize the hippogriﬀ around the neck before he was soaring upward.)"
    },
    {
      "name": "buckbeak",
      "entity_type": "animal",
      "singular": true,
      "description": "Buckbeak is a specific hippogriff that flies Harry around the paddock. (Buckbeak ﬂew him once around the paddock and then headed back to the ground;)"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a person who rides on the hippogriff's back. (he just had time to seize the hippogriﬀ around the neck before he was soaring upward.)"
    },
    {
      "name": "nimbus two thousand",
      "entity_type": "broomstick",
      "singular": true,
      "description": "The Nimbus Two Thousand is a broomstick that Harry prefers to ride. (It was nothing like a broomstick, and Harry knew which one he preferred;)"
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "hippogriff",
      "relationship_type": "slaps",
      "description": "Hagrid slaps the hippogriﬀ's hindquarters. (\"Go on, then!\" roared Hagrid, slapping the hippogriﬀ’s hindquarters.)"
    },
    {
      "entity_1": "harry",
      "entity_2": "hippogriff",
      "relationship_type": "rides",
      "description": "Harry rides on the hippogriff's back. (he just had time to seize the hippogriﬀ around the neck before he was soaring upward.)"
    },
    {
      "entity_1": "buckbeak",
      "entity_2": "harry",
      "relationship_type": "flies",
      "description": "Buckbeak flies Harry around the paddock. (Buckbeak ﬂew him once around the paddock and then headed back to the ground;)"
    },
    {
      "entity_1": "harry",
      "entity_2": "nimbus two thousand",
      "relationship_type": "prefers",
      "description": "Harry prefers to ride the Nimbus Two Thousand. (It was nothing like a broomstick, and Harry knew which one he preferred;)"
    }
  ]
}