{
  "entities": [
    {
      "name": "honeydukes",
      "entity_type": "store",
      "singular": true,
      "description": "Honeydukes is mentioned as a place where they have got a new kind of fudge and were giving out free samples. (\"Honeydukes has got a new kind of fudge; they were giving out free samples, there’s a bit, look —\")"
    },
    {
      "name": "three broomsticks",
      "entity_type": "store",
      "singular": true,
      "description": "The Three Broomsticks is mentioned as a place where ogres are seen. (\"We think we saw an ogre, honestly, they get all sorts at the Three Broomsticks —\")"
    },
    {
      "name": "butterbeer",
      "entity_type": "drink",
      "singular": true,
      "description": "Butterbeer is mentioned as a drink that warms you up. (\"Wish we could have brought you some butterbeer, really warms you up —\")"
    },
    {
      "name": "goblet",
      "entity_type": "object",
      "singular": true,
      "description": "The goblet is mentioned as something that Lupin drank. (\"Lupin drank it?\", \"He told them all about the goblet.\")"
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is mentioned as a person who made Harry a cup of tea and was seen drinking the goblet. (\"No, Lupin made me a cup of tea in his oﬀice.\", \"Lupin drank it?\", \"He told them all about the goblet.\")"
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as a person who came into Lupin's office. (\"And then Snape came in.\")"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as a person who reacted to the news about Lupin drinking the goblet. (\"Lupin drank it?\", \"Is he mad?\")"
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as a person who checked her watch and suggested going down to the feast. (\"Hermione checked her watch.\", \"We’d better go down, you know, the feast’ll be starting in five minutes.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as a person who was made tea by Lupin and reacted to the news about Lupin drinking the goblet. (\"No, Lupin made me a cup of tea in his oﬀice.\", \"Lupin drank it?\", \"Is he mad?\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "lupin",
      "entity_2": "goblet",
      "relationship_type": "drank",
      "description": "Lupin is described as drinking the goblet. (\"Lupin drank it?\", \"He told them all about the goblet.\")"
    },
    {
      "entity_1": "snape",
      "entity_2": "lupin",
      "relationship_type": "visited",
      "description": "Snape is described as coming into Lupin's office. (\"And then Snape came in.\")"
    }
  ]
}