{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character in the story. He is mentioned as saying 'We did it!' and is described as being breathless."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is a person who has gone on Buckbeak, according to Harry. He is not physically present in the scene."
    },
    {
      "name": "buckbeak",
      "entity_type": "animal",
      "singular": true,
      "description": "Buckbeak is an animal that Sirius has gone on. It is mentioned as a mode of transportation."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is the headmaster who beamed at Harry and Hermione. He is described as listening intently for any sound within the hospital wing."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a person who is with Harry in the story. She is mentioned as slipping back inside the dormitory and tucking the Time-Turner under her robes."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a person who is lying motionless in the end bed. He is mentioned as being still there when Harry and Hermione return to their own beds."
    },
    {
      "name": "madam pomfrey",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Pomfrey is a person who comes out of her office and asks if she can look after her patients now. She is described as being in a bad mood."
    },
    {
      "name": "time-turner",
      "entity_type": "object",
      "singular": true,
      "description": "The Time-Turner is an object that Hermione tucks under her robes. It is mentioned as being hidden from view."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "sirius",
      "relationship_type": "gone_with",
      "description": "Harry and Sirius are related by the fact that Sirius has gone on Buckbeak, according to Harry."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "beamed_at",
      "description": "Dumbledore beamed at Harry in the story. This is a physical action that shows their relationship."
    },
    {
      "entity_1": "madam pomfrey",
      "entity_2": "hermione",
      "relationship_type": "stood_over",
      "description": "Madam Pomfrey stood over Hermione, making sure she ate the chocolate. This is a physical action that shows their relationship."
    },
    {
      "entity_1": "harry",
      "entity_2": "time-turner",
      "relationship_type": "hidden_from",
      "description": "Harry and the Time-Turner are related by the fact that Hermione tucked it under her robes, hiding it from view."
    }
  ]
}