{
  "entities": [
    {
      "name": "newspaper",
      "entity_type": "publication",
      "singular": true,
      "description": "The newspaper is mentioned as a source that reported on the situation, but its name is not specified."
    },
    {
      "name": "dementors",
      "entity_type": "creatures",
      "singular": false,
      "description": "Dementors are mentioned as having little effect on one of the most heavily guarded individuals in the place. They are described as being outside his door day and night."
    },
    {
      "name": "madam rosmerta",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Rosmerta is mentioned as asking what she thinks he's broken out to do, implying that she is concerned about the situation."
    },
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is mentioned as being evasive and saying that it's possible that Black's eventual plan is to rejoin You-Know-Who."
    },
    {
      "name": "black",
      "entity_type": "person",
      "singular": true,
      "description": "Black is mentioned as someone who has broken out, but his name is not specified until later in the conversation."
    },
    {
      "name": "you-know-who",
      "entity_type": "person",
      "singular": true,
      "description": "You-Know-Who is mentioned as being alone and friendless, but with Black's return, he will rise again quickly."
    },
    {
      "name": "cornelius",
      "entity_type": "person",
      "singular": true,
      "description": "Cornelius is mentioned as someone who is dining with the headmaster, and Professor McGonagall suggests that they should head back up to the castle."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is mentioned as suggesting that Cornelius and she should head back up to the castle."
    }
  ],
  "relationships": [
    {
      "entity_1": "black",
      "entity_2": "you-know-who",
      "relationship_type": "plan_to_rejoin",
      "description": "Fudge mentions that Black's eventual plan is to rejoin You-Know-Who."
    },
    {
      "entity_1": "fudge",
      "entity_2": "black",
      "relationship_type": "trying_to_catch",
      "description": "Fudge says that they hope to catch Black before he rejoins You-Know-Who."
    },
    {
      "entity_1": "madam rosmerta",
      "entity_2": "black",
      "relationship_type": "concerned_about",
      "description": "Madam Rosmerta is concerned about what she thinks Black has broken out to do."
    }
  ]
}