{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as looking at a ragged old bit of parchment and reacting to George's actions."
    },
    {
      "name": "george",
      "entity_type": "person",
      "singular": true,
      "description": "George is mentioned as taking out his wand, touching the parchment, and saying 'I solemnly swear that I am up to no good'."
    },
    {
      "name": "messrs moony",
      "entity_type": "business",
      "singular": false,
      "description": "Messrs. Moony is mentioned as one of the purveyors of aids to magical mischief-makers, along with Wormtail, Padfoot, and Prongs."
    },
    {
      "name": "wormtail",
      "entity_type": "person",
      "singular": true,
      "description": "Wormtail is mentioned as one of the purveyors of aids to magical mischief-makers, along with Moony, Padfoot, and Prongs."
    },
    {
      "name": "padfoot",
      "entity_type": "person",
      "singular": true,
      "description": "Padfoot is mentioned as one of the purveyors of aids to magical mischief-makers, along with Moony, Wormtail, and Prongs."
    },
    {
      "name": "prongs",
      "entity_type": "person",
      "singular": true,
      "description": "Prongs is mentioned as one of the purveyors of aids to magical mischief-makers, along with Moony, Wormtail, and Padfoot."
    },
    {
      "name": "professor dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Dumbledore is mentioned as pacing his study, shown on the Marauder's Map."
    },
    {
      "name": "mrs. fawkes' cat",
      "entity_type": "animal",
      "singular": false,
      "description": "Mrs. Fawkes' cat is mentioned as being labeled on the Marauder's Map, but its name is not specified."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "george",
      "relationship_type": "interaction",
      "description": "Harry and George are interacting with each other, as shown by their conversation and actions."
    },
    {
      "entity_1": "messrs moony",
      "entity_2": "wormtail",
      "relationship_type": "partnership",
      "description": "Messrs. Moony and Wormtail are partners in the business of providing aids to magical mischief-makers, as mentioned on the Marauder's Map."
    },
    {
      "entity_1": "messrs moony",
      "entity_2": "padfoot",
      "relationship_type": "partnership",
      "description": "Messrs. Moony and Padfoot are partners in the business of providing aids to magical mischief-makers, as mentioned on the Marauder's Map."
    },
    {
      "entity_1": "messrs moony",
      "entity_2": "prongs",
      "relationship_type": "partnership",
      "description": "Messrs. Moony and Prongs are partners in the business of providing aids to magical mischief-makers, as mentioned on the Marauder's Map."
    },
    {
      "entity_1": "professor dumbledore",
      "entity_2": "harry",
      "relationship_type": "visibility",
      "description": "Professor Dumbledore is visible on the Marauder's Map, which Harry is looking at."
    }
  ]
}