{
  "entities": [
    {
      "name": "dudley",
      "entity_type": "person",
      "singular": true,
      "description": "Dudley is described as eating his fourth slice of pie and being the subject of Aunt Marge's comment about a healthy-sized boy. (\"A bit more than that … and a bit more … that’s the ticket.\")"
    },
    {
      "name": "aunt petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Aunt Petunia is described as sipping coffee with her little finger sticking out. (\"Aunt Petunia was sipping coﬀee with her little ﬁnger sticking out.\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as wanting to disappear into his bedroom but being forced to sit it out due to Uncle Vernon's angry eyes. (\"Harry really wanted to disappear into his bedroom, but he met Uncle Vernon’s angry little eyes and knew he would have to sit it out.\")"
    },
    {
      "name": "uncle vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Uncle Vernon is described as having angry little eyes that make Harry want to disappear. (\"Harry really wanted to disappear into his bedroom, but he met Uncle Vernon’s angry little eyes and knew he would have to sit it out.\")"
    },
    {
      "name": "aunt marge",
      "entity_type": "person",
      "singular": true,
      "description": "Aunt Marge is described as smacking her lips, putting down an empty brandy glass, and burping richly. (\"Aah,” said Aunt Marge, smacking her lips and putting the empty brandy glass back down.\")"
    },
    {
      "name": "dudley's pie",
      "entity_type": "food",
      "singular": true,
      "description": "Dudley's pie is described as being eaten by Dudley. (\"Dudley was eating his fourth slice of pie.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "aunt marge",
      "entity_2": "dudley",
      "relationship_type": "admires",
      "description": "Aunt Marge admires Dudley's size, saying \"But I do like to see a healthy-sized boy,\" and winking at him. (\"You’ll be a big strong boy, just like your father.\")"
    },
    {
      "entity_1": "aunt petunia",
      "entity_2": "dudley's pie",
      "relationship_type": "served",
      "description": "Aunt Petunia served Dudley his pie. (\"Excellent nosh, Petunia.\")"
    }
  ]
}