{
  "entities": [
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor McGonagall is introduced as a person who has a way of making Harry feel like he must have done something wrong. She is described as having a stern demeanor and is shown to be in charge, ushering Harry and Hermione away from the crowd and into her office."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as staring at Professor McGonagall as she ushers Harry and Hermione away. He is not described in detail, but his presence is noted."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is introduced as the main character who has been taken ill on the train. He is described as feeling worried and embarrassed about passing out in front of everyone."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is introduced as Harry's companion who accompanies him to Professor McGonagall's office. She is not described in detail, but her presence is noted."
    },
    {
      "name": "madam pomfrey",
      "entity_type": "person",
      "singular": true,
      "description": "Madam Pomfrey is introduced as the nurse who comes into Professor McGonagall's office to attend to Harry. She is described as bustling in and is shown to be concerned about Harry's well-being."
    },
    {
      "name": "professor lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Lupin is mentioned as having sent an owl ahead to inform Professor McGonagall that Harry was taken ill on the train. He is not described in detail, but his presence is noted."
    },
    {
      "name": "weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Weasley is mentioned as being told by Professor McGonagall to move along. It is likely that this refers to Ron Weasley, but it is not explicitly stated."
    }
  ],
  "relationships": [
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "harry",
      "relationship_type": "is_concerned_about",
      "description": "Professor McGonagall is concerned about Harry's well-being and has him brought to her office. She is described as having a way of making Harry feel like he must have done something wrong."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "hermione",
      "relationship_type": "is_accompanied_by",
      "description": "Professor McGonagall accompanies Hermione and Harry across the entrance hall, up the marble staircase, and along a corridor to her office."
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "madam pomfrey",
      "relationship_type": "is_assisted_by",
      "description": "Madam Pomfrey comes into Professor McGonagall's office to attend to Harry, indicating that she is assisting her in some way."
    },
    {
      "entity_1": "professor lupin",
      "entity_2": "harry",
      "relationship_type": "has_informed",
      "description": "Professor Lupin has sent an owl ahead to inform Professor McGonagall that Harry was taken ill on the train."
    }
  ]
}