{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as the sender of the letter, described as 'really sorry' for shouting during a telephone call. (Excerpt: 'I hope the Muggles didn’t give you a hard time. I asked Dad, and he reckons I shouldn’t have shouted.')"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the recipient of the letter, described as having been given a hard time by Muggles. (Excerpt: 'I hope the Muggles didn’t give you a hard time.')"
    },
    {
      "name": "bill",
      "entity_type": "person",
      "singular": true,
      "description": "Bill is mentioned as having taken Ron and others around tombs in Egypt. (Excerpt: 'It’s amazing here in Egypt. Bill’s taken us around all the tombs...')"
    },
    {
      "name": "dad",
      "entity_type": "person",
      "singular": true,
      "description": "Dad is mentioned as having been asked by Ron for advice on shouting during a telephone call. (Excerpt: 'I asked Dad, and he reckons I shouldn’t have shouted.')"
    },
    {
      "name": "ginny",
      "entity_type": "person",
      "singular": true,
      "description": "Ginny is mentioned as not being allowed to enter a tomb by Mum. (Excerpt: 'Mum wouldn’t let Ginny come in the last one.')"
    },
    {
      "name": "mum",
      "entity_type": "person",
      "singular": true,
      "description": "Mum is mentioned as having not allowed Ginny to enter a tomb. (Excerpt: 'Mum wouldn’t let Ginny come in the last one.')"
    }
  ],
  "relationships": [
    {
      "entity_1": "ron",
      "entity_2": "dad",
      "relationship_type": "advised_by",
      "description": "Ron asked Dad for advice on shouting during a telephone call. (Excerpt: 'I asked Dad, and he reckons I shouldn’t have shouted.')"
    },
    {
      "entity_1": "ron",
      "entity_2": "bill",
      "relationship_type": "accompanied_by",
      "description": "Ron was accompanied by Bill while visiting tombs in Egypt. (Excerpt: 'It’s amazing here in Egypt. Bill’s taken us around all the tombs...')"
    },
    {
      "entity_1": "ron",
      "entity_2": "harry",
      "relationship_type": "apologized_to",
      "description": "Ron apologized to Harry for shouting during a telephone call. (Excerpt: 'Dear Harry, Happy birthday! Look, I’m really sorry about that telephone call...')"
    },
    {
      "entity_1": "dad",
      "entity_2": "ron",
      "relationship_type": "advised",
      "description": "Dad advised Ron not to shout during a telephone call. (Excerpt: 'I asked Dad, and he reckons I shouldn’t have shouted.')"
    }
  ]
}