{
  "entities": [
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as dropping her voice and glancing nervously around. She is also described as being full to bursting with Honeydukes sweets."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as reaching the entrance hall and crossing into the Great Hall. He is also described as glancing at the staff table and noticing Snape's eyes flickering toward Lupin."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is mentioned as being poisoned, and Harry and Hermione are discussing whether he would have done it in front of Harry. He is also described as looking cheerful at the staff table."
    },
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as sitting at the staff table and having his eyes flicker toward Lupin more often than was natural."
    },
    {
      "name": "flitwick",
      "entity_type": "person",
      "singular": true,
      "description": "Flitwick is mentioned as being tiny and talking animatedly to Lupin at the staff table."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "lupin",
      "relationship_type": "concerned_about",
      "description": "Harry is concerned about Lupin's safety and is discussing it with Hermione. He is also glancing at the staff table to see how Lupin is doing."
    },
    {
      "entity_1": "hermione",
      "entity_2": "harry",
      "relationship_type": "concerned_about",
      "description": "Hermione is concerned about Harry's safety and is discussing it with him. She is also described as being full to bursting with Honeydukes sweets."
    },
    {
      "entity_1": "snape",
      "entity_2": "lupin",
      "relationship_type": "suspicious_of",
      "description": "Snape's eyes are flickering toward Lupin more often than was natural, suggesting that he may be suspicious of him."
    }
  ]
}