{
  "entities": [
    {
      "name": "wood",
      "entity_type": "person",
      "singular": true,
      "description": "Wood is the one who gives information about the score to Harry. He says they are fifty points up but warns that if they don't get the Snitch soon, they will be playing into the night."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is a student who is participating in a game. He is wearing glasses and is having trouble seeing due to the cold and wet conditions."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a student who has an idea to help Harry see better. She uses her wand to cast a spell called 'Impervius' on his glasses."
    },
    {
      "name": "snitch",
      "entity_type": "object",
      "singular": true,
      "description": "The Snitch is an object that the team needs to get soon, or they will be playing into the night. It is not clear what the Snitch is or why it is important."
    },
    {
      "name": "broom",
      "entity_type": "object",
      "singular": true,
      "description": "Harry's broom is mentioned at the end of the passage, but its significance is unclear. It may be a tool that Harry uses to move around or participate in the game."
    }
  ],
  "relationships": [
    {
      "entity_1": "wood",
      "entity_2": "snitch",
      "relationship_type": "concerned_about",
      "description": "Wood is concerned about getting the Snitch soon, as he warns Harry that if they don't get it, they will be playing into the night."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "helped_by",
      "description": "Hermione helps Harry by casting a spell on his glasses to make them repel water, allowing him to see better."
    },
    {
      "entity_1": "harry",
      "entity_2": "broom",
      "relationship_type": "uses",
      "description": "Harry uses his broom at the end of the passage, but its significance is unclear. It may be a tool that he uses to move around or participate in the game."
    }
  ]
}