{
  "entities": [
    {
      "name": "harry",
      "entity_type": "character",
      "singular": true,
      "description": "The main protagonist of the story, a wizard who is trying to get back down to the hospital wing without being seen."
    },
    {
      "name": "hermione",
      "entity_type": "character",
      "singular": true,
      "description": "A student at Hogwarts and one of Harry's friends, she is tugging at his sleeve and trying to hurry him along."
    },
    {
      "name": "dumbledore",
      "entity_type": "character",
      "singular": true,
      "description": "The headmaster of Hogwarts, he is mentioned as someone who will lock the door if they don't get back down to the hospital wing in time."
    },
    {
      "name": "fudge",
      "entity_type": "character",
      "singular": true,
      "description": "A Ministry of Magic official, he is walking along the corridor with Snape and discussing the Black affair."
    },
    {
      "name": "snape",
      "entity_type": "character",
      "singular": true,
      "description": "The potions master at Hogwarts, he is talking to Fudge about the Kiss and the dementors."
    },
    {
      "name": "macnair",
      "entity_type": "character",
      "singular": true,
      "description": "A Ministry of Magic official who is returning with the dementors."
    },
    {
      "name": "black",
      "entity_type": "person",
      "singular": true,
      "description": "Someone who has been involved in an affair that Fudge and Snape are discussing."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "accompanying",
      "description": "Harry is accompanied by Hermione as they try to get back down to the hospital wing without being seen."
    },
    {
      "entity_1": "fudge",
      "entity_2": "snape",
      "relationship_type": "conversing",
      "description": "Fudge and Snape are walking along the corridor together and discussing the Kiss and the dementors."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry",
      "relationship_type": "impeding",
      "description": "Dumbledore is mentioned as someone who will lock the door if Harry doesn't get back down to the hospital wing in time."
    }
  ]
}