{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is mentioned as a person who gave Harry a photo album. The text states 'the leather-bound photo album Hagrid had given him two years ago'."
    },
    {
      "name": "photo album",
      "entity_type": "object",
      "singular": true,
      "description": "The photo album is described as a leather-bound object that contains pictures of Harry's mother and father. The text states 'the leather-bound photo album Hagrid had given him two years ago'."
    },
    {
      "name": "bedside cabinet",
      "entity_type": "object",
      "singular": true,
      "description": "The bedside cabinet is mentioned as a piece of furniture where Harry finds the photo album. The text states 'He pushed his books aside and quickly found what he was looking for — the leather-bound photo album Hagrid had given him two years ago'."
    },
    {
      "name": "bed",
      "entity_type": "object",
      "singular": true,
      "description": "The bed is mentioned as a piece of furniture where Harry sits down to look at the photo album. The text states 'He sat down on his bed, drew the hangings around him'."
    },
    {
      "name": "hangings",
      "entity_type": "object",
      "singular": true,
      "description": "The hangings are mentioned as something that Harry draws around himself to look at the photo album. The text states 'He sat down on his bed, drew the hangings around him'."
    },
    {
      "name": "mother",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's mother is mentioned as a person in the photo album. The text states 'which was full of wizard pictures of his mother and father'."
    },
    {
      "name": "father",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's father is mentioned as a person in the photo album. The text states 'which was full of wizard pictures of his mother and father'."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "photo album",
      "relationship_type": "gave",
      "description": "Hagrid gave Harry the photo album. The text states 'the leather-bound photo album Hagrid had given him two years ago'."
    },
    {
      "entity_1": "harry",
      "entity_2": "photo album",
      "relationship_type": "looked at",
      "description": "Harry looked at the photo album. The text states 'He sat down on his bed, drew the hangings around him, and started turning the pages, searching'."
    }
  ]
}