{
  "entities": [
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is mentioned as one of the four men making their way up to the castle. He is described as a member of the old Committee."
    },
    {
      "name": "macnair",
      "entity_type": "person",
      "singular": true,
      "description": "Macnair is mentioned as one of the four men making their way up to the castle. He is described as being told by Fudge to murder Sirius on the spot."
    },
    {
      "name": "fudge",
      "entity_type": "person",
      "singular": true,
      "description": "Fudge is mentioned as one of the four men making their way up to the castle. He is described as telling Macnair to murder Sirius on the spot."
    },
    {
      "name": "sirius",
      "entity_type": "person",
      "singular": true,
      "description": "Sirius is mentioned in the context of being murdered by Macnair, as suggested by Fudge."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as expressing regret that Dumbledore did not come with them when they went down into the passage."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as watching the four men climb the castle steps and as expressing bitter thoughts about Fudge and Macnair."
    },
    {
      "name": "lupin",
      "entity_type": "person",
      "singular": true,
      "description": "Lupin is mentioned as another figure sprinting down the stone steps and haring toward them."
    }
  ],
  "relationships": [
    {
      "entity_1": "fudge",
      "entity_2": "macnair",
      "relationship_type": "ordered_by",
      "description": "Fudge is described as telling Macnair to murder Sirius on the spot, indicating that Fudge has ordered or instructed Macnair to do something."
    },
    {
      "entity_1": "harry",
      "entity_2": "lupin",
      "relationship_type": "saw",
      "description": "Harry is described as watching Lupin sprinting down the stone steps and haring toward them, indicating that Harry has seen or observed Lupin."
    }
  ]
}