{
  "entities": [
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "Professor Mc Gonagall is a teacher at Hogwarts School of Witchcraft and Wizardry. She is mentioned as sitting down on the wall and repeating Dumbledore's question about explaining something in a letter."
    },
    {
      "name": "dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "Dumbledore is a wise and experienced wizard who is also a teacher at Hogwarts School of Witchcraft and Wizardry. He is mentioned as looking very seriously over the top and agreeing with Professor Mc Gonagall."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is a student at Hogwarts School of Witchcraft and Wizardry who will become famous and legendary. He is mentioned as being known by every child in the world."
    }
  ],
  "relationships": [
    {
      "entity_1": "dumbledore",
      "entity_2": "professor mcgonagall",
      "relationship_type": "agree",
      "description": "Dumbledore agrees with Professor Mc Gonagall that Harry Potter will become famous and legendary, as mentioned in the text: 'Exactly,' said Dumbledore, looking very seriously over the top."
    },
    {
      "entity_1": "dumbledore",
      "entity_2": "harry potter",
      "relationship_type": "fame",
      "description": "Dumbledore believes that Harry Potter will become famous and legendary, as mentioned in the text: 'He’ll be famous – a legend – I wouldn’t be surprised if today was known as Harry Potter Day in future – there will be books written about Harry – every child in our world will know his name!'"
    },
    {
      "entity_1": "professor mcgonagall",
      "entity_2": "harry potter",
      "relationship_type": "fame",
      "description": "Professor Mc Gonagall also believes that Harry Potter will become famous and legendary, as mentioned in the text: 'He’ll be famous – a legend – I wouldn’t be surprised if today was known as Harry Potter Day in future – there will be books written about Harry – every child in our world will know his name!'"
    }
  ]
}