{
  "entities": [
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as sighing when the broomstick rolls onto Harry's bedspread. (\"Wow ,’ Ron sighed\")"
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as thinking the broom looks wonderful and later mounting his broomstick to fly again. (\"Even Harry , who knew nothing about the different brooms, thought it looked wonderful.\")"
    },
    {
      "name": "broomstick",
      "entity_type": "object",
      "singular": true,
      "description": "The broomstick is described as sleek and shiny with a mahogany handle and a long tail of neat, straight twigs. (\"Sl eek and shiny , with a mahogany handle, it had a long tail of neat, straight twigs\")"
    },
    {
      "name": "nimbus two thousand",
      "entity_type": "object",
      "singular": true,
      "description": "Nimbus Two Thousand is mentioned as being written in gold near the top of the broomstick. (\"Nimbus T wo Thous and written in gold near the top.\")"
    },
    {
      "name": "quidditch pitch",
      "entity_type": "location",
      "singular": true,
      "description": "The Quidditch pitch is described as being located outside the castle and having stands around it for spectators. (\"As seven o’clock drew nearer, Harry left the castle and set off towards the Quidditch pitch in th e dusk.\")"
    },
    {
      "name": "golden poles",
      "entity_type": "object",
      "singular": false,
      "description": "The golden poles are mentioned as being at either end of the pitch with hoops on the end. (\"At either end of the pitch were three golden poles with hoops on the end.\")"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "broomstick",
      "relationship_type": "mounts",
      "description": "Harry mounts his broomstick to fly again. (\"Too eager to fly again to wait for Wood, Harry mounted his broomstick and kicked off from the ground.\")"
    },
    {
      "entity_1": "harry",
      "entity_2": "quidditch pitch",
      "relationship_type": "arrives_at",
      "description": "Harry arrives at the Quidditch pitch. (\"As seven o’clock drew nearer, Harry left the castle and set off towards the Quidditch pitch in th e dusk.\")"
    }
  ]
}