{
  "entities": [
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "Hagrid is described as a person who can be seen from the upstairs windows, defrosting broomsticks on the Quidditch pitch. He is bundled up in a long mole-skin overcoat, rabbit-fur gloves and enormous beaverskin boots."
    },
    {
      "name": "quidditch",
      "entity_type": "sport",
      "singular": true,
      "description": "Quidditch is described as the sport being played on the pitch. The Quidditch season has begun, and Harry will be playing in his first match after weeks of training."
    },
    {
      "name": "gryffindor",
      "entity_type": "house",
      "singular": true,
      "description": "Gryffindor is described as a house that is competing in the House Championship. If they win, they will move up into second place."
    },
    {
      "name": "slytherin",
      "entity_type": "house",
      "singular": true,
      "description": "Slytherin is described as a house that is competing against Gryffindor in the House Championship."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as a person who will be playing Seeker in his first match. He has been kept secret by Wood, but the news of his playing has leaked out."
    },
    {
      "name": "wood",
      "entity_type": "person",
      "singular": true,
      "description": "Wood is described as a person who has decided to keep Harry's playing a secret. He considers Harry their secret weapon."
    }
  ],
  "relationships": [
    {
      "entity_1": "hagrid",
      "entity_2": "quidditch",
      "relationship_type": "associated_with",
      "description": "Hagrid is associated with Quidditch as he can be seen defrosting broomsticks on the Quidditch pitch."
    },
    {
      "entity_1": "harry",
      "entity_2": "gryffindor",
      "relationship_type": "member_of",
      "description": "Harry is a member of Gryffindor house and will be playing in their match against Slytherin."
    },
    {
      "entity_1": "harry",
      "entity_2": "quidditch",
      "relationship_type": "plays_in",
      "description": "Harry plays Quidditch as he is going to play in his first match after weeks of training."
    },
    {
      "entity_1": "gryffindor",
      "entity_2": "slytherin",
      "relationship_type": "competes_against",
      "description": "Gryffindor competes against Slytherin in the House Championship. If they win, they will move up into second place."
    },
    {
      "entity_1": "wood",
      "entity_2": "harry",
      "relationship_type": "keeps_secret_of",
      "description": "Wood keeps Harry's playing a secret as he considers him their secret weapon."
    }
  ]
}