{
  "entities": [
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story, a student at Hogwarts School of Witchcraft and Wizardry. He is described as feeling warm and sleepy, looking up at the High Table, and experiencing pain on his forehead."
    },
    {
      "name": "hagrid",
      "entity_type": "person",
      "singular": true,
      "description": "The gamekeeper at Hogwarts, drinking from a goblet at the High Table. He is described as being present in the scene but not directly interacting with Harry."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "person",
      "singular": true,
      "description": "A professor at Hogwarts, talking to Professor Dumbledore at the High Table. She is described as being present in the scene but not directly interacting with Harry."
    },
    {
      "name": "professor dumbledore",
      "entity_type": "person",
      "singular": true,
      "description": "The headmaster of Hogwarts, talking to Professor McGonagall at the High Table. He is described as being present in the scene but not directly interacting with Harry."
    },
    {
      "name": "professor quirrell",
      "entity_type": "person",
      "singular": true,
      "description": "A professor at Hogwarts, wearing an absurd turban and talking to a teacher with greasy black hair. He is described as being present in the scene and interacting with another character."
    },
    {
      "name": "percy",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's friend or classmate, who is asked by Harry about the identity of a teacher talking to Professor Quirrell. He is described as being present in the scene and interacting with Harry."
    },
    {
      "name": "teacher with greasy black hair",
      "entity_type": "person",
      "singular": true,
      "description": "A teacher at Hogwarts, described as having greasy black hair, a hooked nose, and sallow skin. He is described as talking to Professor Quirrell and looking directly into Harry's eyes."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "teacher with greasy black hair",
      "relationship_type": "looked_at",
      "description": "The teacher looked past Quirrell’s turban straight into Harry’s eyes – and a sharp, hot pain shot across the scar on Harry’s forehead."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "percy",
      "relationship_type": "asked_question",
      "description": "‘Who’s that teacher talking to Professor Quirrell?’ he asked Percy."
    }
  ]
}