{
  "entities": [
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is recognized by Harry as he sneaks into the Forest while everyone else is at dinner. He is described as having a 'prowling walk'."
    },
    {
      "name": "quirrell",
      "entity_type": "person",
      "singular": true,
      "description": "Quirrell is mentioned as being present in the shadowy clearing with Snape, stuttering worse than ever."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is described as flying on his broomstick and following Snape into the Forest. He tries to catch what Snape and Quirrell are saying."
    },
    {
      "name": "nimbus two thousand",
      "entity_type": "broomstick",
      "singular": false,
      "description": "Nimbus Two Thousand is Harry's broomstick that he uses to fly over the castle and follow Snape into the Forest."
    },
    {
      "name": "forest",
      "entity_type": "location",
      "singular": false,
      "description": "The Forest is where Snape sneaks in while everyone else is at dinner. Harry follows him there on his broomstick."
    },
    {
      "name": "castle",
      "entity_type": "location",
      "singular": true,
      "description": "The castle is mentioned as the place where everyone else is having dinner while Snape sneaks into the Forest."
    }
  ],
  "relationships": [
    {
      "entity_1": "snape",
      "entity_2": "quirrell",
      "relationship_type": "meeting",
      "description": "Snape and Quirrell are meeting in a shadowy clearing in the Forest. They seem to be discussing something, with Snape being more composed than Quirrell."
    },
    {
      "entity_1": "harry",
      "entity_2": "snape",
      "relationship_type": "following",
      "description": "Harry is following Snape into the Forest on his broomstick, trying to catch what they are saying. He lands noiselessly in a towering beech tree and tries to see through the leaves."
    }
  ]
}