{
  "entities": [
    {
      "name": "snape",
      "entity_type": "person",
      "singular": true,
      "description": "Snape is mentioned as a person who might have stolen the dog, but it's not clear if he actually did. (What di d it matter if Snape stole it, really?)"
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is Harry's friend who is with him on their quest to find the mirror room. He is covered in the Cloak and is cold."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is the main character who is trying to find the mirror room with Ron's help. He is determined to find it and is not willing to give up."
    },
    {
      "name": "the dog",
      "entity_type": "animal",
      "singular": true,
      "description": "The dog is being guarded by a headed dog, but its significance in the story is unclear."
    },
    {
      "name": "the mirror room",
      "entity_type": "location",
      "singular": true,
      "description": "The mirror room is a location that Harry and Ron are trying to find. It's where Harry can see his parents' ghosts."
    },
    {
      "name": "the library",
      "entity_type": "location",
      "singular": true,
      "description": "The library is mentioned as the starting point for Harry and Ron's journey to find the mirror room."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "ron",
      "relationship_type": "accompanying",
      "description": "Harry and Ron are together on their quest to find the mirror room. (They tried retracing Harry’s route from the library, wandering around the dark passageways for nearly an hour.)"
    },
    {
      "entity_1": "harry",
      "entity_2": "the mirror room",
      "relationship_type": "searching_for",
      "description": "Harry is searching for the mirror room with Ron's help. (What Harry feared most was that he might not be able to find the mirror room again.)"
    },
    {
      "entity_1": "ron",
      "entity_2": "the cloak",
      "relationship_type": "covered_by",
      "description": "Ron is covered in the Cloak, which is a magical garment. (With Ron covered in the Cloak too, they had to walk much more slowly next night.)"
    },
    {
      "entity_1": "harry",
      "entity_2": "the mirror",
      "relationship_type": "approaching",
      "description": "Harry is approaching the mirror, where he can see his parents' ghosts. (They pushed the door open. Harry dropped the Cloak from round his shoulders and ran to the mirror.)"
    }
  ]
}