{
  "entities": [
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is the person who is being scolded by Ron and Harry. He is told to stand up to people, but not to them (Ron and Harry). Neville drops Trevor the toad and challenges Ron to hit him."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is one of Neville's friends who is scolding him for breaking rules. He tells Neville not to stand up to them (Ron and Harry)."
    },
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is another friend of Neville's who is worried about the situation and asks Hermione to do something."
    },
    {
      "name": "hermione",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is a friend of Neville's who steps forward to help him. She uses her wand to cast a spell on Neville, making him stiff and rigid."
    },
    {
      "name": "trevor",
      "entity_type": "animal",
      "singular": true,
      "description": "Trevor is a toad that Neville drops when Ron takes a step forward. Trevor leaps out of sight."
    }
  ],
  "relationships": [
    {
      "entity_1": "neville",
      "entity_2": "ron",
      "relationship_type": "scolded_by",
      "description": "Ron scolds Neville for breaking rules and standing up to them (Ron and Harry)."
    },
    {
      "entity_1": "harry",
      "entity_2": "hermione",
      "relationship_type": "asked_for_help_from",
      "description": "Harry asks Hermione to do something to help Neville, who is in a difficult situation."
    },
    {
      "entity_1": "hermione",
      "entity_2": "neville",
      "relationship_type": "helped_by",
      "description": "Hermione uses her wand to cast a spell on Neville, making him stiff and rigid. This helps to calm down the situation."
    },
    {
      "entity_1": "ron",
      "entity_2": "neville",
      "relationship_type": "challenged_by",
      "description": "Ron challenges Neville to hit him after Neville drops Trevor the toad and stands up to them (Ron and Harry)."
    }
  ]
}