{
  "entities": [
    {
      "name": "filch",
      "entity_type": "person",
      "singular": true,
      "description": "Filch is mentioned as someone who might catch Harry and Ron for breaking school rules. He is described as being present in the text with the phrase 'going to get caught by Filch'."
    },
    {
      "name": "mrs norris",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs Norris is mentioned as someone who might catch Harry and Ron for breaking school rules. She is described as being present in the text with the phrase 'going to get caught by Mrs Norris'."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy's sneering face is mentioned as a reason for Harry to want to confront him. He is described as being present in the darkness with the phrase 'Malfoy’s sneering face kept looming up out of the darkness'."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who is with Harry and Hermione. He is described as muttering to himself with the phrase 'Half past eleven,’ Ron muttered at last.'"
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as the main character of the story. He is described as feeling like he's pushing his luck by breaking another school rule with the phrase 'Harry felt he was pushing his luck, breaking another school rule today.'"
    },
    {
      "name": "hermione granger",
      "entity_type": "person",
      "singular": true,
      "description": "Hermione is mentioned as someone who catches Harry and Ron in the Gryffindor common room. She is described as wearing a pink dressing-gown and frown with the phrase 'A lamp flickered on. It was Hermione Granger, wearing a pink dressing-gown and a frown.'"
    },
    {
      "name": "percy weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Percy is mentioned as Harry's brother who would put a stop to their plans if he knew about them. He is described as being a Prefect with the phrase 'he’s a Prefect, he’d put a stop to this.'"
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "malfoy",
      "relationship_type": "confrontation",
      "description": "Harry wants to confront Malfoy face-to-face with the phrase 'this was his big chance to beat Malfoy , face to face.'"
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "hermione granger",
      "relationship_type": "argument",
      "description": "Ron is furious at Hermione for catching them in the Gryffindor common room with the phrase 'You!’ said Ron furiously . ‘Go back to bed!’"
    },
    {
      "entity_1": "harry potter",
      "entity_2": "hermione granger",
      "relationship_type": "confrontation",
      "description": "Hermione is also mentioned as someone who confronts Harry about his plans with the phrase 'I can’t believe you’re going to do this, Harry .’"
    },
    {
      "entity_1": "harry potter",
      "entity_2": "percy weasley",
      "relationship_type": "obstacle",
      "description": "Percy is mentioned as someone who would put a stop to their plans if he knew about them with the phrase 'he’s a Prefect, he’d put a stop to this.'"
    }
  ]
}