{
  "entities": [
    {
      "name": "potters",
      "entity_type": "family",
      "singular": false,
      "description": "The Potters are mentioned as the Dursleys' sister and her husband. They are described as being 'as unDursleyish as it was possible to be', indicating that they have a different lifestyle and values than the Dursleys."
    },
    {
      "name": "dudley",
      "entity_type": "person",
      "singular": true,
      "description": "Dudley is mentioned as the son of Mr. and Mrs. Dursley. He is described as someone who should not mix with a child like Harry Potter."
    },
    {
      "name": "mr dursley",
      "entity_type": "person",
      "singular": true,
      "description": "Mr. Dursley is mentioned as waking up on the day of the story and getting ready for work. He hums while picking out his tie."
    },
    {
      "name": "mrs dursley",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Dursley is mentioned as gossiping away in the morning. She pretends she doesn't have a sister and tries to keep the Potters away from her family."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as the son of Mr. and Mrs. Potter. He is described as someone who should not mix with Dudley."
    },
    {
      "name": "mrs potter",
      "entity_type": "person",
      "singular": true,
      "description": "Mrs. Potter is mentioned as being the sister of Mrs. Dursley. She has a small son named Harry Potter."
    },
    {
      "name": "potter",
      "entity_type": "family",
      "singular": false,
      "description": "The Potters are mentioned as having a small son and living in a different lifestyle than the Dursleys."
    }
  ],
  "relationships": [
    {
      "entity_1": "dursley",
      "entity_2": "potter",
      "relationship_type": "family_relationship",
      "description": "The Dursleys have a family relationship with the Potters, as Mrs. Dursley is the sister of Mrs. Potter."
    },
    {
      "entity_1": "mr dursley",
      "entity_2": "harry potter",
      "relationship_type": "no_relationship",
      "description": "Mr. Dursley does not want his son Dudley to mix with Harry Potter, indicating that there is no relationship between them."
    }
  ]
}