{
  "entities": [
    {
      "name": "harry",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story, a young boy who receives letters in green ink."
    },
    {
      "name": "uncle vernon",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's uncle, who is trying to prevent Harry from receiving letters in green ink. He is described as shouting at Harry and trying to tear up the letters."
    },
    {
      "name": "aunt petunia",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's aunt, who is skeptical of Uncle Vernon's plan to prevent Harry from receiving letters in green ink. She brings him a piece of fruit cake while he is trying to nail up the letter-box."
    },
    {
      "name": "frui t cake",
      "entity_type": "food",
      "singular": true,
      "description": "A type of baked good that Aunt Petunia brings to Uncle Vernon, which he uses as a makeshift hammer to try and knock in a nail."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry",
      "entity_2": "uncle vernon",
      "relationship_type": "conflict",
      "description": "Uncle Vernon is trying to prevent Harry from receiving letters in green ink, and he shouts at him for about half an hour."
    },
    {
      "entity_1": "harry",
      "entity_2": "uncle vernon",
      "relationship_type": "recipient",
      "description": "Harry receives letters in green ink, which are addressed to him. Uncle Vernon tries to prevent these letters from being delivered."
    },
    {
      "entity_1": "aunt petunia",
      "entity_2": "uncle vernon",
      "relationship_type": "concerned",
      "description": "Aunt Petunia is skeptical of Uncle Vernon's plan to prevent Harry from receiving letters in green ink, and she expresses her concerns to him."
    },
    {
      "entity_1": "harry",
      "entity_2": "letters",
      "relationship_type": "recipient",
      "description": "Harry receives letters in green ink, which are addressed to him. These letters arrive at his home despite Uncle Vernon's attempts to prevent them from being delivered."
    },
    {
      "entity_1": "uncle vernon",
      "entity_2": "letters",
      "relationship_type": "obstacle",
      "description": "Uncle Vernon tries to prevent the letters in green ink from being delivered to Harry. He tears up the letters and nails up the letter-box."
    }
  ]
}