{
  "entities": [
    {
      "name": "seamus finnigan",
      "entity_type": "person",
      "singular": true,
      "description": "Seamus Finnigan is mentioned as someone who tells long, boastful stories about flying on his broomstick. He says he spent most of his childhood zooming around the countryside on his broomstick."
    },
    {
      "name": "ron weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is mentioned as someone who tells stories about Quidditch and has an argument with Dean Thomas about football. He also tries to make the players move on Dean's poster of West Ham football team."
    },
    {
      "name": "dean thomas",
      "entity_type": "person",
      "singular": true,
      "description": "Dean is mentioned as someone who shares a dormitory with Ron and has an argument with him about football. He also has a poster of West Ham football team in his room."
    },
    {
      "name": "neville longbottom",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is mentioned as someone who has never been on a broomstick in his life."
    },
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry is mentioned as someone who catches Ron prodding Dean's poster of West Ham football team."
    },
    {
      "name": "quidditch",
      "entity_type": "sport",
      "singular": false,
      "description": "Quidditch is mentioned as a sport that everyone from wizarding families talks about constantly. It is also the subject of many stories and boasts by Ron, Seamus, and others."
    },
    {
      "name": "muggles",
      "entity_type": "group",
      "singular": false,
      "description": "Muggles are mentioned as people who fly in helicopters that Quidditch players narrowly escape from."
    },
    {
      "name": "west ham football team",
      "entity_type": "team",
      "singular": true,
      "description": "West Ham is mentioned as a football team that Dean Thomas has a poster of. Ron tries to make the players move on this poster."
    }
  ],
  "relationships": [
    {
      "entity_1": "ron weasley",
      "entity_2": "dean thomas",
      "relationship_type": "argument",
      "description": "Ron and Dean have an argument about football, which is mentioned in the text. This relationship is described as a disagreement between two people."
    },
    {
      "entity_1": "ron weasley",
      "entity_2": "west ham football team",
      "relationship_type": "dislike",
      "description": "Ron dislikes West Ham football team and tries to make the players move on Dean's poster of them. This relationship is described as a negative feeling towards a particular entity."
    },
    {
      "entity_1": "seamus finnigan",
      "entity_2": "broomstick",
      "relationship_type": "use",
      "description": "Seamus uses his broomstick to fly around the countryside, which is mentioned in the text. This relationship is described as a functional one between Seamus and his broomstick."
    },
    {
      "entity_1": "neville longbottom",
      "entity_2": "broomstick",
      "relationship_type": "inability_to_use",
      "description": "Neville has never been on a broomstick in his life, which is mentioned in the text. This relationship is described as an inability to use or operate a particular entity."
    }
  ]
}