{
  "entities": [
    {
      "name": "seamus",
      "entity_type": "person",
      "singular": true,
      "description": "Seamus is a student who has a mixed background of being half Muggle and half witch. This is mentioned in the text as 'I'm half and half'."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Ron is a friend of Seamus and Neville, and he asks Neville about his background."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "Neville is a student who has a mixed background of being half Muggle and half witch. This is mentioned in the text as 'Well, my gran brought me up and she's a witch'."
    },
    {
      "name": "algie",
      "entity_type": "person",
      "singular": true,
      "description": "Algie is Neville's great-uncle who tries to catch Neville off guard and force magic out of him. This is mentioned in the text as 'Great-uncle Algie kept trying to catch me off my guard'."
    },
    {
      "name": "enid",
      "entity_type": "person",
      "singular": true,
      "description": "Enid is Neville's great-aunt who offers a meringue to Algie and accidentally lets go of Neville. This is mentioned in the text as 'Great-auntie Enid offered him a meringue'."
    },
    {
      "name": "seamus's dad",
      "entity_type": "person",
      "singular": true,
      "description": "Seamus's dad is a Muggle who was surprised to find out that his wife was a witch. This is mentioned in the text as 'Me dad's a Muggle. Mam didn't tell him she was a witch'."
    }
  ],
  "relationships": [
    {
      "entity_1": "algie",
      "entity_2": "neville",
      "relationship_type": "tried_to_force_magic_out_of",
      "description": "Algie tried to force magic out of Neville by pushing him off the end of Blackpool pier. This is mentioned in the text as 'Great-uncle Algie kept trying to catch me off my guard and force some magic out of me'."
    },
    {
      "entity_1": "enid",
      "entity_2": "neville",
      "relationship_type": "accidentally_saved",
      "description": "Enid accidentally let go of Neville, causing him to bounce down the garden. This is mentioned in the text as 'Great-auntie Enid offered him a meringue and he accidentally let go'."
    },
    {
      "entity_1": "algie",
      "entity_2": "neville",
      "relationship_type": "accidentally_saved",
      "description": "Algie accidentally let go of Neville, causing him to bounce down the garden. This is mentioned in the text as 'But I bounced – all the way down the garden and into the road'."
    },
    {
      "entity_1": "algie",
      "entity_2": "neville",
      "relationship_type": "pleased_with_neville's_magic",
      "description": "Algie was pleased when Neville showed signs of magic. This is mentioned in the text as 'They were all really pleased. Gran was crying, she was so happy'."
    }
  ]
}