{
  "entities": [
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "Harry Potter is mentioned as a student who has returned to Hogwarts. He is described as being brave and having friends with him."
    },
    {
      "name": "fred weasley",
      "entity_type": "person",
      "singular": true,
      "description": "Fred Weasley is mentioned as one of the twins who are part of the Quidditch team. He is described as being confident that they will win the Quidditch Cup."
    },
    {
      "name": "george weasley",
      "entity_type": "person",
      "singular": true,
      "description": "George Weasley is mentioned as one of the twins who are part of the Quidditch team. He is described as being confident that they will win the Quidditch Cup."
    },
    {
      "name": "wood",
      "entity_type": "person",
      "singular": true,
      "description": "Wood is mentioned as a teacher who has told Fred and George about Harry's good performance in Quidditch."
    },
    {
      "name": "lee jordan",
      "entity_type": "person",
      "singular": true,
      "description": "Lee Jordan is mentioned as someone who thinks he has found a new secret passageway out of the school."
    },
    {
      "name": "gregory the smarmy",
      "entity_type": "person",
      "singular": true,
      "description": "Gregory the Smarmy is mentioned as the statue behind which Lee Jordan thinks he has found a secret passageway."
    },
    {
      "name": "malfoy",
      "entity_type": "person",
      "singular": true,
      "description": "Malfoy is mentioned as someone who is not welcome and is accompanied by Crabbe and Goyle. He is described as being sarcastic towards Harry."
    }
  ],
  "relationships": [
    {
      "entity_1": "fred weasley",
      "entity_2": "harry potter",
      "relationship_type": "friendship",
      "description": "Fred Weasley is a friend of Harry Potter's and is confident that they will win the Quidditch Cup."
    },
    {
      "entity_1": "george weasley",
      "entity_2": "harry potter",
      "relationship_type": "friendship",
      "description": "George Weasley is a friend of Harry Potter's and is confident that they will win the Quidditch Cup."
    },
    {
      "entity_1": "wood",
      "entity_2": "fred weasley",
      "relationship_type": "teacher_student",
      "description": "Wood is a teacher who has told Fred and George about Harry's good performance in Quidditch."
    },
    {
      "entity_1": "lee jordan",
      "entity_2": "gregory the smarmy",
      "relationship_type": "connection_to_location",
      "description": "Lee Jordan thinks he has found a secret passageway behind the statue of Gregory the Smarmy."
    },
    {
      "entity_1": "malfoy",
      "entity_2": "harry potter",
      "relationship_type": "enmity",
      "description": "Malfoy is not welcome and is described as being sarcastic towards Harry."
    }
  ]
}