{
  "entities": [
    {
      "name": "harry potter",
      "entity_type": "person",
      "singular": true,
      "description": "The main character of the story, a young boy who is about to attend Hogwarts School of Witchcraft and Wizardry. He is described as nervous and unsure about what will happen during the Sorting Ceremony."
    },
    {
      "name": "neville",
      "entity_type": "person",
      "singular": true,
      "description": "A student in Harry's year group, mentioned by Professor McGonagall for wearing his cloak under his left ear. He is not described as being nervous or anxious about the Sorting Ceremony."
    },
    {
      "name": "ron",
      "entity_type": "person",
      "singular": true,
      "description": "Harry's friend and a student in his year group. He is mentioned as having a smudged nose and is unsure about what will happen during the Sorting Ceremony."
    },
    {
      "name": "professor mcgonagall",
      "entity_type": "teacher",
      "singular": true,
      "description": "A teacher at Hogwarts School of Witchcraft and Wizardry who is in charge of the Sorting Ceremony. She is described as leaving the chamber to prepare for the ceremony."
    },
    {
      "name": "fred",
      "entity_type": "person",
      "singular": true,
      "description": "Ron's brother, mentioned by Ron as saying that the Sorting Ceremony hurts a lot (although he thinks Fred was joking)."
    },
    {
      "name": "hogwarts school of witchcraft and wizardry",
      "entity_type": "school",
      "singular": true,
      "description": "The school where Harry is about to attend. It is mentioned as having different houses that students will be sorted into."
    }
  ],
  "relationships": [
    {
      "entity_1": "harry potter",
      "entity_2": "professor mcgonagall",
      "relationship_type": "addressed_by",
      "description": "Harry is addressed by Professor McGonagall during the Sorting Ceremony. She tells him to wait quietly and that she will return when they are ready for him."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "ron",
      "relationship_type": "friend_of",
      "description": "Harry is friends with Ron, as evidenced by their conversation about the Sorting Ceremony. They are both students in the same year group and are anxious about what will happen during the ceremony."
    },
    {
      "entity_1": "harry potter",
      "entity_2": "neville",
      "relationship_type": "classmate_of",
      "description": "Harry is a classmate of Neville, as they are both students in the same year group at Hogwarts School of Witchcraft and Wizardry. They are mentioned together by Professor McGonagall during the Sorting Ceremony."
    }
  ]
}